
Процедура ПриЗаписи(Отказ, Замещение)
		
	Перем ОбновлятьЗначениеГлПеременной;
	
	Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда //Если это Игорь:), то не надо нам никого информировать
	Иначе
	КэшНастроекПользователей = глЗначениеПеременной("ЗначенияНастроекПользователей");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшНастроекПользователей, 
																					  "Настройка",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения настроек",
																					  ОбновлятьЗначениеГлПеременной);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
	КонецЕсли;																						  
	КонецЕсли;
КонецПроцедуры
