
///////////////////////////////////////////////////////
// СТАНДАРТНЫЕ СОБЫТИЯ ФОРМЫ 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();	
	
КонецПроцедуры

///////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ ШАПКИ

&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	
	УстановитьВидимость();	
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПодарковКратноКомплектамПокупкиПриИзменении(Элемент)
	
	УстановитьВидимость();	
	
КонецПроцедуры


///////////////////////////////////////////////////////
// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ ФОРМЫ 

// Устанавливаем видимость элементов
Процедура УстановитьВидимость() 
	
	Если Объект.ТипАкции = ПредопределенноеЗначение("Перечисление.ТипыАкций.Подарок") Тогда
		Если Объект.КоличествоПодарковКратноКомплектамПокупки Тогда
			Элементы.КомплектПокупки.Видимость = Истина;
		Иначе
			Элементы.КомплектПокупки.Видимость = Ложь;
		КонецЕсли;
		Элементы.АкционныеТоварыКоличество.Видимость = Истина;
		Элементы.КоличествоПодарковКратноКомплектамПокупки.Видимость = Истина;
	ИначеЕсли Объект.ТипАкции = ПредопределенноеЗначение("Перечисление.ТипыАкций.ФиксированнаяЦена") Тогда
		Элементы.КомплектПокупки.Видимость = Ложь;
		Элементы.АкционныеТоварыКоличество.Видимость = Ложь;
		Элементы.КоличествоПодарковКратноКомплектамПокупки.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

