Процедура Основная(Сотрудник, ДатаН, ДатаК) Экспорт
	РезалтТабл.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Нач", КонецДня(ДатаН));
	Запрос.УстановитьПараметр("Кон", КонецДня(ДатаК));
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|   Штрафы.Сотрудник.Код    КАК Имя,
	|   Штрафы.Период    КАК Дата,
	|   Штрафы.Магазин   КАК Магазин,
	|   Штрафы.Причина    КАК Причина,
	|   Штрафы.Сумма    КАК Сумма,
	|   Штрафы.Регистратор.Номер    КАК Документ
	|ИЗ
	|	РегистрСведений.Штрафы КАК Штрафы
	|ГДЕ Штрафы.Период МЕЖДУ &Нач И &Кон";
	Если Сотрудник <> Справочники.Пользователи.ПустаяСсылка() Тогда
		Запрос.Текст = Запрос.Текст+"
		|   И Штрафы.Сотрудник = &Сотрудник";
	КонецЕсли;
	
	Итог = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Пока Выборка.Следующий() Цикл
			Итог = Итог+Выборка.Сумма;
			НовСтр = РезалтТабл.Добавить();
			НовСтр.Дата = Выборка.Дата;
			НовСтр.Сотрудник = Выборка.Имя;
			НовСтр.Магазин = Выборка.Магазин;
			НовСтр.Причина = Выборка.Причина;
			НовСтр.Сумма = Выборка.Сумма;
			НовСтр.Документ = Документы.ШтрафыСотрудников.НайтиПоНомеру(Выборка.Документ);
		КонецЦикла;
	Иначе
		Сообщить ("Нет данных");
	КонецЕсли;
	
	РезалтТабл.Сортировать("Дата Возр");
	ЭтотОбъект.ПолучитьФорму("Форма").ЭлементыФормы.Надпись6.Видимость=Истина;
	ЭтотОбъект.ПолучитьФорму("Форма").ЭлементыФормы.Надпись6.Значение=Строка(Итог);
	
	
КонецПроцедуры