//21.07.2017, Юра
Функция ЭтоСклад5ЛБ(Дата,Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	_5LB_СоответствиеСкладаИКонтрагентаСрезПоследних.Контрагент
		|ИЗ
		|	РегистрСведений._5LB_СоответствиеСкладаИКонтрагента.СрезПоследних(&Дата, Склад = &Склад) КАК _5LB_СоответствиеСкладаИКонтрагентаСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат НЕ ВыборкаДетальныеЗаписи.Следующий();
КонецФункции

//24.07.2017, Юра
//Номер документа для форм 1-Т, ТОРГ-12 и Транспортная накладная  нужно брать из документа "Перемещение товаров" реквизит "_5LB_НомерДокументаРеализацияТоваровУслугВБазе1СБухгалтерия5ЛБ"
Функция НомерДокументаДляПечатиТОРГ12_1Т(ТекНомер) Экспорт
	Если ЗначениеЗаполнено(ТекНомер) Тогда
		НомерДокументаДляПечатиТОРГ12_1Т = СокрЛП(ТекНомер);
		//Префиксы базы 1С:Бухгалтерии искать затратно, поэтому
		//тупо убираем слева все символы и нули, пока не дойдем до первого числа 1,...,9 
		Пока Найти("123456789",Лев(НомерДокументаДляПечатиТОРГ12_1Т, 1)) = 0 Цикл
			НомерДокументаДляПечатиТОРГ12_1Т = Сред(НомерДокументаДляПечатиТОРГ12_1Т, 2);
		КонецЦикла;
			
		Возврат НомерДокументаДляПечатиТОРГ12_1Т;
	Иначе
		Возврат "Не подготовлен";
	КонецЕсли;
КонецФункции

//24.07.2017, Юра
Функция ОпределитьЮрЛицоПоСкладу(ТекДатаДокумента,ТекСклад) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_5LB_СоответствиеСкладаИКонтрагентаСрезПоследних.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений._5LB_СоответствиеСкладаИКонтрагента.СрезПоследних(&ДатаДокумента, Склад = &СкладПолучатель) КАК _5LB_СоответствиеСкладаИКонтрагентаСрезПоследних";
	Запрос.УстановитьПараметр("ДатаДокумента", ТекДатаДокумента);
	Запрос.УстановитьПараметр("СкладПолучатель", ТекСклад);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Контрагент;
	Иначе 
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
КонецФункции

//20.07.2017, Юра
Функция ПолучитьПараметрыТС_ИДоверенностиВодителя(ТекФизЛицо) Экспорт
	ЗапросПоВодителю = Новый Запрос;
	ЗапросПоВодителю.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Наименование,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &ФизЛицо";
	ЗапросПоВодителю.УстановитьПараметр("ФизЛицо", ТекФизЛицо);
	РезультатЗапросаПоВодителю = ЗапросПоВодителю.Выполнить();
	ВыборкаПоВодителю = РезультатЗапросаПоВодителю.Выбрать();
	ВУ = "";
	МаркаАвто = "";
	НомерАвто = "";
	Рез = Новый Структура("ТелефонВодителя,ВУ,МаркаАвто,НомерАвто");
	Пока ВыборкаПоВодителю.Следующий() Цикл
		Если ВыборкаПоВодителю.Наименование = "Водительское удостоверение" Тогда
			Рез.Вставить("ВУ",ВыборкаПоВодителю.Значение);
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Марка автомобиля" Тогда
			Рез.Вставить("МаркаАвто",ВыборкаПоВодителю.Значение);
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Номер автомобиля" Тогда
			Рез.Вставить("НомерАвто",ВыборкаПоВодителю.Значение);
			
		//Добавлено про доверенность 25.07.2017, Юра
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Доверенность номер" Тогда
			Рез.Вставить("ДоверенностьНомер",ВыборкаПоВодителю.Значение);
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Доверенность дата" Тогда
			Рез.Вставить("ДоверенностьДата",ВыборкаПоВодителю.Значение);
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Доверенность выдана" Тогда
			Рез.Вставить("ДоверенностьВыдана",ВыборкаПоВодителю.Значение);
		ИначеЕсли ВыборкаПоВодителю.Наименование = "Доверенность через кого" Тогда
			Рез.Вставить("ДоверенностьЧерезКого",ВыборкаПоВодителю.Значение);
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Тип.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И ВЫРАЗИТЬ(КонтактнаяИнформация.Объект КАК Справочник.ФизическиеЛица).Ссылка = &ТекФизЛицо";
	Запрос.УстановитьПараметр("ТекФизЛицо", ТекФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез.Вставить("ТелефонВодителя",ВыборкаДетальныеЗаписи.Представление);
	КонецЦикла;
		
	Возврат Рез;
КонецФункции


//#***+Добавления*** Тасмаджиев 03/12/2018// ->>
//Получает Контрагента из РС СобственныеКонтрагенты
Функция ПолучитьКотрагентаПоОрганизации(Организация)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобственныеКонтрагенты.Контрагент,
	|	СобственныеКонтрагенты.Объект КАК Организация
	|ИЗ
	|	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|ГДЕ
	|	СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.ВидыСобственныхКонтрагентов.Организация)
	|	И СобственныеКонтрагенты.Объект = &Организация";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	ВыборкаОрганизацийСкладов = Запрос.Выполнить().Выбрать();
	
	
	Если ВыборкаОрганизацийСкладов.Количество()> 0 Тогда
		
		Пока ВыборкаОрганизацийСкладов.Следующий()  Цикл
			
			Контрагент = ВыборкаОрганизацийСкладов.Контрагент;
			
		КонецЦикла;
		
	Иначе
		
		Контрагент = Неопределено;

		ВызватьИсключение НСтр("ru = 'Не заполнен  регистр сведений СобственныеКонтрагенты .
		|Заполните регистр соответствием Контрагент-->Организация 
		|и попробуйте снова .'");
		
	КонецЕсли;
	
	Возврат Контрагент;

КонецФункции //#***-Добавления*** Тасмаджиев 03/12/2018// <<-


//#***+Добавления*** Тасмаджиев 03/12/2018// ->>
//Получает Организацию из РС СобственныеКонтрагенты
Функция ПолучитьОрганизациюПоКотрагенту(Котрагент)Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобственныеКонтрагенты.Контрагент,
	|	СобственныеКонтрагенты.Объект КАК Организация
	|ИЗ
	|	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|ГДЕ
	|	СобственныеКонтрагенты.ВидСвязи = ЗНАЧЕНИЕ(Перечисление.ВидыСобственныхКонтрагентов.Организация)
	|	И СобственныеКонтрагенты.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент",Котрагент);
	ВыборкаОрганизацийСкладов = Запрос.Выполнить().Выбрать();
		
	Если ВыборкаОрганизацийСкладов.Количество()> 0 Тогда
		
		Пока ВыборкаОрганизацийСкладов.Следующий()  Цикл
			
			Организация = ВыборкаОрганизацийСкладов.Организация;
			
		КонецЦикла;
		
	Иначе
		
		Организация = Неопределено;
		
		ВызватьИсключение НСтр("ru = 'Не заполнен  регистр сведений СобственныеКонтрагенты .
		|Заполните регистр соответствием Контрагент-->Организация 
		|и попробуйте снова .'");
		
	КонецЕсли;

	Возврат Организация;
	
КонецФункции //#***-Добавления*** Тасмаджиев 03/12/2018// <<-



