
Процедура ПередЗаписью(Отказ, Замещение)
	
	////// < 20.12.16 Вялов - ИНТЕГРАЦИЯ - обязательная проверка и создание Н+Х УТ-11
	////Если РольДоступна("НСИ_УТ11_ПолныеПрава") Тогда
	//Если НЕ ПараметрыСеанса._Номенклатура_УТ11_Блокировать Тогда
	////	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Объект) Тогда
	////		НоменклатураСссылка = ЭтотОбъект.Отбор.Объект.Значение; 	
	////		Если РегистрыСведений._СоответствияНоменклатуры.ЕстьСоответствиеНоменклатуры(НоменклатураСссылка) Тогда
	////			НоменклатураХарактеристика = РегистрыСведений._СоответствияНоменклатуры.НайтиСоответствиеНоменклатуры(НоменклатураСссылка);
	////			НоменклатураУТ11 = НоменклатураХарактеристика.Номенклатура;
	////			Если Не ЗначениеЗаполнено(НоменклатураУТ11) Тогда
	////				Отказ = Истина;
	////			Иначе
	////				ОбрСоотв = Обработки._СоответствиеНоменклатуры_УТ11;
	////				Отказ = НЕ ОбрСоотв.ОбновитьНоменклатуруСРеквизитами(НоменклатураСссылка, НоменклатураУТ11, НоменклатураХарактеристика.Характеристика); 							
	////			КонецЕсли;
	////		КонецЕсли; 
	////	КонецЕсли;    		
	//	П = 1;
	//КонецЕсли;	
	////// 20.12.16 Вялов - ИНТЕГРАЦИЯ - обязательная проверка и создание Н+Х УТ-11 >
	
		
	Если ЭтотОбъект.Отбор.Количество() > 0 Тогда
		НоменклатураСссылка = ЭтотОбъект.Отбор.Объект.Значение; 	
		Если ТипЗнч(НоменклатураСссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			Для Каждого ТекСвойство Из ЭтотОбъект Цикл
				ОбщегоНазначения5LB.ЗаписатьИзменениеРегистраСведенийСОбъектом(НоменклатураСссылка,
					"Категория", ТекСвойство.Категория);
				Прервать;	// только одно значение!
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;

		
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	НоменклатураСссылка = ЭтотОбъект.Отбор.Объект.Значение;
	
	//Если ЗначениеЗаполнено(НоменклатураСссылка) Тогда
	//	Если ТипЗнч(НоменклатураСссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
	//		
	//		бТолькоИзменениеРеквизитов = Ложь;				
	//		стрИзменение = ОбщегоНазначения5LB.ПолучитьИзмененияОбъектаСтрокой(
	//			НоменклатураСссылка, 
	//			бТолькоИзменениеРеквизитов,
	//			"*Категория");
				
	бПродолжить = Ложь;
	Если ЗначениеЗаполнено(НоменклатураСссылка) Тогда	
		Если ТипЗнч(НоменклатураСссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если НЕ НоменклатураСссылка.ЭтоГруппа Тогда												
				
				бТолькоИзменениеРеквизитов = Ложь;
				стрИзменение = ОбщегоНазначения5LB.ПолучитьИзмененияОбъектаСтрокой(НоменклатураСссылка, 
					бТолькоИзменениеРеквизитов, "*Категория");				
					
				Если стрИзменение <> "" Тогда
					бПродолжить = Истина;
				КонецЕсли;	
			
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;   	
	
					
	Если бПродолжить Тогда  								
		Если стрИзменение <> "" Тогда
					
				ОбрСоотв = Обработки._5LB_СоответствиеНоменклатуры_УТ11;     								
				бЕстьОбмен = ОбрСоотв.НоменклатураДоступнаДляОбмена(НоменклатураСссылка);	
				Если бЕстьОбмен Тогда
				 	НоменклатураХарактеристика = ОбрСоотв.НайтиСоответствиеНоменклатуры(НоменклатураСссылка); 
					НоменклатураУТ11 = НоменклатураХарактеристика.Номенклатура;
					ХарактеристикаУТ11 = НоменклатураХарактеристика.Характеристика;	
					Если ЗначениеЗаполнено(НоменклатураУТ11) Тогда	
						
						//стрИзменение = "";
						РезОбновления = ОбрСоотв.ОбновитьНоменклатуруСРеквизитами(
								НоменклатураСссылка, НоменклатураУТ11, ХарактеристикаУТ11, Истина,
								стрИзменение);											
							//Если Источник.Метаданные().Имя = "ШтрихКод" Тогда  	// для штрих-кода отдельно
							//	ОбрСоотв.СинхронизироватьШтрихКод(НоменклатураСсылка, НоменклатураУТ11, ХарактеристикаУТ11);	
							//				////		бУспешно = НЕ ОбрСоотв.ОбновитьЗаписьСоответствий(Ссылка, НоваяНоменклатура, НоваяХарактеристика);  
							//				////	Если бУспешно Тогда
							//				////		стрСообщ = "Не удалось создать запись связи номенклатуры УТ-10 и новой номенклатуры УТ-11!";
							//				////		статусСообщ = СтатусСообщения.Важное;
							//				////		//Сообщить(стрСообщ, статусСообщ);												
					КонецЕсли;							
				КонецЕсли;							
							
	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
