//{+Добавления}Автор:Тасмаджиев 13/07/2018// ->>
//При проведении документа «Реализация товаров и услуг» в статусе «В пути» и при условии,
//что склад, указанный в реквизите «Магазин» не переведен на розницу (Свойство «Переведен в розницу» = Ложь),
//должен автоматически создаваться документ «Поступление товаров и услуг» со следующими реквизитами:
Процедура _5LB_ПриПроведенииРТУОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	#Если Клиент Тогда
		Если ЗначениеЗаполнено(Источник._5LB_Магазин) и Источник._5LB_СтатусПеревозки  = Перечисления.СтатусПеревозки.ВПути И не Источник._5LB_Врозницу  Тогда
			//=!{Получаем список дополнительных свойств склада}!= ->>
			ОбработкаОбъектЗначенияСвойств = Обработки.ЗначенияСвойствОбъекта.Создать();
			ОбработкаОбъектЗначенияСвойств.НазначениеСвойств = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Склады;
			ОбработкаОбъектЗначенияСвойств.ОбъектОтбораЗначений =Источник._5LB_Магазин;
			ОбработкаОбъектЗначенияСвойств.ОбъектОтбораНазначений = Источник._5LB_Магазин; 
			ОбработкаОбъектЗначенияСвойств.ПрочитатьЗаполнитьСвойстваИЗначения();
			//=!{Получаем список дополнительных свойств склада}!= <<-
			//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>
			//***=!{Добавлена проверка на заполненные доп свойства}!=*** ->>
			Если ЗначениеЗаполнено(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Переведен на розницу")) Тогда
				
					Если ЗначениеЗаполнено(ОбработкаОбъектЗначенияСвойств.ЭтотОбъект.СвойстваИЗначения.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Переведен на розницу")).Значение) Тогда
						
						НовыйДокументПТУ = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
						НовыйДокументПТУ.Заполнить(Источник.ссылка);
						НовыйДокументПТУ.Записать();
					//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>	
					Иначе
						//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>
						Сообщить("Добавьте дополнительное свойство ""Переведен на розницу"" складу "+Источник._5LB_Магазин.Наименование,СтатусСообщения.Важное);
					КонецЕсли;
					//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>
				Иначе
					//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>
					Сообщить("Добавьте свойство ПланыВидовХарактеристик.СвойстваОбъектов - ""Переведен на розницу"" ",СтатусСообщения.Важное);
				КонецЕсли;
				
			КонецЕсли;
			
		#КонецЕсли	
		
КонецПроцедуры //{-Добавления}Автор:Тасмаджиев 13/07/2018// <<-
