Процедура Основная(ТипЦен) Экспорт
	РозничныеЦены.Очистить();
	СпрБазТип = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000005");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипЦен", СпрБазТип);
	Запрос.УстановитьПараметр("Нач", КонецДня(ТекущаяДата()-2592000));
	Запрос.УстановитьПараметр("Кон", КонецДня(ТекущаяДата()));
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	Среднее(ЦеныНоменклатуры.Цена)  КАК Цена,
	|   ЦеныНоменклатуры.Номенклатура.Код    КАК Код,
	|   ЦеныНоменклатуры.Номенклатура.Наименование    КАК Наименование
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|   ГДЕ ЦеныНоменклатуры.ТипЦен = &ТипЦен
	|   И ЦеныНоменклатуры.Период МЕЖДУ &Нач И &Кон
	|СГРУППИРОВАТЬ ПО ЦеныНоменклатуры.Номенклатура.Код,ЦеныНоменклатуры.Номенклатура.Наименование
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Цена = Выборка.Цена * (1 + ТипЦен.ПроцентСкидкиНаценки / 100);
		НовСтр = РозничныеЦены.Добавить();
		НовСтр.Код = Выборка.Код;
		НовСтр.Наименование = Выборка.Наименование;
		НовСтр.БазоваяЦена = Выборка.Цена;
	    НовСтр.РозничнаяЦена = Цена;
	КонецЦикла;

	
	
	
	КонецПроцедуры