
// 07.08.17 Вялов
// возвращает "Истина" - если карта новая, "Ложь" - старая, "Неопределено" - если номер не действительный!
Функция ЭтоНоваяПодарочнаяКарта(Номер) Экспорт
	
	стрНомер = СокрЛП(Номер);
	
	Если стрНомер = "" Тогда
		Рез = Неопределено;
	Иначе
		
		// 1-проверка - первый символ - число или символ?
		Попытка
			Зн = Число(Лев(стрНомер, 1));
			Рез = Истина;
		Исключение
			Рез = Ложь;
		КонецПопытки;
		
		// 2-проверка - длина
		Если НЕ Рез Тогда   // старый вариант 16 символов
			Рез = ?(СтрДлина(стрНомер) = 16, Ложь, Неопределено);
		Иначе   // новый - длина 13
			Рез = ?(СтрДлина(стрНомер) = 13, Истина, Неопределено);
		КонецЕсли;
		
		// 3-проверка
		Если НЕ Рез Тогда   // старый вариант
			ЗнПроверка = Сред(стрНомер, 2);
		Иначе
			ЗнПроверка = стрНомер;
		КонецЕсли;		
		 
		Попытка
			Зн = Число(ЗнПроверка);
			//Рез = Рез;
		Исключение
			Рез = Неопределено;
		КонецПопытки;
		 
	 КонецЕсли;
	 
	 Возврат Рез;	
	
КонецФункции
