
//pryan@inbox.ru 10/12/2013		
Функция ЕстьСписаниеОприходование(Объект)
	Рез = Ложь;
	
	если Объект.ЭтоНовый() тогда
		возврат Рез;
	конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СписаниеТоваров.Ссылка
	|ИЗ
	|	Документ.СписаниеТоваров КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.Проведен
	|	И СписаниеТоваров.ИнвентаризацияТоваровНаСкладе = &Инвентаризация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Проведен
	|	И ОприходованиеТоваров.ИнвентаризацияТоваровНаСкладе = &Инвентаризация";
	
	Запрос.УстановитьПараметр("Инвентаризация", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	если Выборка.Следующий() тогда
		Рез = Истина;
	конецесли;
	
	возврат Рез;
	
КонецФункции	
//pryan@inbox.ru 10/12/2013		

Процедура ПередЗаписьюИнвентаризацииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	#Если Клиент Тогда 
		//pryan@inbox.ru 10/12/2013		
		если (РольДоступна(Метаданные.Роли.ЗаведующийСкладом)) И (НЕ РольДоступна(Метаданные.Роли.Advanced)) тогда
			если ЕстьСписаниеОприходование(Источник) тогда
				сообщить("Невозможна корректировка принятого к учету документа.");
				Отказ = Истина;
				Возврат;
			конецесли;
		конецесли;
		//pryan@inbox.ru 10/12/2013		
		Если (Источник.Товары.Итог("Цена")=0) И (Источник.Товары.Количество()>0) Тогда
			//Если Источник.Товары.Найти(0,"Цена")<>Неопределено Тогда
			Предупреждение ("Необходимо перезаполнить учётные количества и суммы!");
			Отказ=Истина;
		КонецЕсли;
		
		Если Источник.ОбработанныеПредИнвенты.Количество()>0  Тогда
			НачатьТранзакцию();
			Для Каждого ст из Источник.ОбработанныеПредИнвенты Цикл
				Об = Ст.Док.ПолучитьОбъект();
				Об.Обработано = Истина;
				Попытка
					Об.Записать (РежимЗаписиДокумента.Запись);
				Исключение
					ОтменитьТранзакцию();
					Сообщить("Произошла ошибка "+ОписаниеОшибки());
					Отказ=Истина;
					прервать;
				КонецПопытки;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура ПередЗаписьюПредварительнойИнвентаркиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.Склад = Справочники.Склады.ПустаяСсылка() Тогда
		Сообщить ("Укажите склад!");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
