//{+Добавления} Автор: Тасмаджиев 16/07/2018// ->>
Процедура ПоискПТУПоШтрихкоду() Экспорт
	#Если Клиент Тогда
		Перем Результат;
		Результат = "";
		Пока ВвестиСтроку(Результат, "Введите штрихкод") Цикл
			Если РольДоступна("_5LB_Перемещение_товаров_магазин")ИЛИ РольДоступна("_5LB_Перемещение_товаров_склад") Тогда
				Если ЗначениеЗаполнено(Результат) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
					             |	ПоступлениеТоваровУслуг.Ссылка КАК Документ,
					             |	ВЫБОР
					             |		КОГДА ПоступлениеТоваровУслуг.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
					             |			ТОГДА ПоступлениеТоваровУслуг.ДокументОснование
					             |		ИНАЧЕ ВЫБОР
					             |				КОГДА ПоступлениеТоваровУслуг.Сделка ССЫЛКА Документ.РеализацияТоваровУслуг
					             |					ТОГДА ПоступлениеТоваровУслуг.Сделка
					             |			КОНЕЦ
					             |	КОНЕЦ КАК Основание
					             |ИЗ
					             |	РегистрСведений.ШтрихкодыЗаказы КАК Р
					             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
					             |		ПО (Р.Владелец = ПоступлениеТоваровУслуг.ДокументОснование
					             |				ИЛИ Р.Владелец = ПоступлениеТоваровУслуг.Сделка)
					             |ГДЕ
					             |	Р.Штрихкод = &Штрих";
					Запрос.УстановитьПараметр("Штрих",Результат);
					
					Рез = Запрос.Выполнить();
					Если Рез.Пустой() Тогда
						Сообщить ("Штрих-код "+Результат+" не найден");
						возврат;
					КонецЕсли;
					
					Выб = Рез.Выбрать();
					
					Если Выб.Количество()<>1 Тогда
						
						Сообщить ("Нарушение штрих-кодирования заказов! Обратитесь к руководству!");
						
					Иначе
						
						Выб.Следующий();
						Док = Выб.Документ;
						Основание =  Выб.Основание;
						Параметр = Новый Структура("Основание",Основание);
						ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса",_5LB_Взаимодействие,Параметр),
						"Вы принимаете документ по грузовым местам ?",
						РежимДиалогаВопрос.ДаНетОтмена,
						0, // таймаут в секундах
						КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
						"ВНИМАНИЕ" // (необ.) заголовок
						);    
							
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры  //{-Добавления} Автор: Тасмаджиев 16/07/2018// <<-
				
//{+Добавления} Автор: Тасмаджиев 16/07/2018// ->> 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметр) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Основание = Параметр.Основание;
		
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если РольДоступна("_5LB_Перемещение_товаров_магазин")Тогда
				
				Документ = Основание.ПолучитьОбъект();
				Документ._5LB_СтатусПеревозки = Перечисления.СтатусПеревозки.Принят;
				Документ.Записать(РежимЗаписиДокумента.Запись);
				
			ИначеЕсли РольДоступна("_5LB_Перемещение_товаров_склад") Тогда
				
				Документ = Основание.ПолучитьОбъект();
				Документ._5LB_СтатусПеревозки = Перечисления.СтатусПеревозки.ВозвратсОтметкойПокупателя;
				Документ.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры  //{-Добавления} Автор: Тасмаджиев 16/07/2018// <<-
				
