
Функция ЗаполнитьСписокИзмененныхОбъектов(ИмяПравила, ИмяТаблицы, стрВидОбъекта="Справочник", стрРеквОтбор="")
	
	Узел = ПланыОбмена.ОбменУправлениеТорговлей11.НайтиПоНаименованию("УТ11");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Табл.Ссылка КАК Ссылка,
		|	Табл.НомерСообщения,
		|	Табл.Узел
		|ИЗ
		|	" + стрВидОбъекта + "." + ИмяТаблицы + ".Изменения КАК Табл
		|ГДЕ
		|	Табл.Узел = &Узел 
		//|	Табл.Узел <> &ЭтотУзел 
		|";
	//Запрос.Параметры.Вставить("ЭтотУзел", ПланыОбмена.ОбменУправлениеТорговлей11.ЭтотУзел());	
	Запрос.Параметры.Вставить("Узел", Узел);	
	
	Если стрРеквОтбор <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Ссылка", стрРеквОтбор);
	Иначе
		стрРеквОтбор = "Ссылка";
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	//РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();    
	СписокОбъектов = Новый СписокЗначений();
	СписокОбъектов.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Сообщить(ВыборкаДетальныеЗаписи.Ссылка);
	    СписокОбъектов.Добавить(ВыборкаДетальныеЗаписи[стрРеквОтбор]);
	КонецЦикла;		

	Возврат СписокОбъектов;
	
	
	
	
	
	

КонецФункции

Функция УдалитьРегистрациюИзмененийВУзле(Узел) Экспорт
	
	//ПланыОбмена.ОбменУправлениеТорговлей11.УдалитьРегистрациюИзмененийВУзле(Узел);
	//ПланыОбмена.УдалитьРегистрациюИзменений(Узел, УдаляемыеДанные);
	//
	//	 ПланыОбмена.УдалитьРегистрациюИзменений
КонецФункции

Функция УстановитьРегистрациюВУзле(Узел, ОбъектСсылка) Экспорт
	
	//ПланыОбмена.ОбменУправлениеТорговлей11.УдалитьРегистрациюИзмененийВУзле(Узел);
	//ПланыОбмена.УдалитьРегистрациюИзменений(Узел, УдаляемыеДанные);
	//
	//	 ПланыОбмена.УдалитьРегистрациюИзменений
КонецФункции

Функция ПолучитьСписокИзменений() Экспорт
	
	СтруктураИзменений = Новый Структура();
	
	
	
	//// Таблица связей сатрой и новой номенклатуры - Номенклатура поставщиков
	//СтруктураИзменений.Вставить("НоменклатураПоставщиков",  
	//ЗаполнитьСписокИзмененныхОбъектов("НоменклатураПоставщиков", "_СоответствияНоменклатуры", "РегистрСведений", "Номенклатура"));
	//
	
	
	// НОМЕНКЛАТУРА	
	СтруктураИзменений.Вставить("Номенклатура",  ЗаполнитьСписокИзмененныхОбъектов("Номенклатура", "_Номенклатура_УТ11"));
	
	// ХАРАКТЕРИСТИКИ НОМЕНКЛАТУРЫ
	СтруктураИзменений.Вставить("ХарактеристикиНоменклатуры",  ЗаполнитьСписокИзмененныхОбъектов("Номенклатура", "_ХарактеристикиНоменклатуры_УТ11"));

	
	// УпаковкиЕдиницыИзмерения
	СтруктураИзменений.Вставить("УпаковкиЕдиницыИзмерения",  ЗаполнитьСписокИзмененныхОбъектов("УпаковкиЕдиницыИзмерения", "_УпаковкиЕдиницыИзмерения_УТ11"));

	
	// ЗначенияСвойствОбъектов
	СтруктураИзменений.Вставить("ЗначенияСвойствОбъектов",  
	ЗаполнитьСписокИзмененныхОбъектов("ЗначенияСвойствОбъектов", "_ЗначенияСвойствОбъектов_УТ11"));
	
	// ДополнительныеСведения
	СтруктураИзменений.Вставить("ДополнительныеСведения",  
	ЗаполнитьСписокИзмененныхОбъектов("ДополнительныеСведения", "_ДополнительныеСведения", "РегистрСведений", "Объект"));	

	
	// ШтрихкодыНоменклатуры
	СтруктураИзменений.Вставить("ШтрихкодыНоменклатуры",  
	ЗаполнитьСписокИзмененныхОбъектов("ШтрихкодыНоменклатуры", "_ШтрихкодыНоменклатуры", "РегистрСведений", "Штрихкод"));
	
	// НоменклатураКонтрагентов - СоответствиеНоменклатуры
	СтруктураИзменений.Вставить("НоменклатураПоставщиков",  
	ЗаполнитьСписокИзмененныхОбъектов("НоменклатураПоставщиков", "_СоответствияНоменклатуры", "РегистрСведений", "Номенклатура"));

	// Документы
	
	// Установка цен номенклатуры
	СтруктураИзменений.Вставить("УстановкаЦенНоменклатуры",  
	ЗаполнитьСписокИзмененныхОбъектов("УстановкаЦенНоменклатуры", "УстановкаЦенНоменклатуры", "Документ"));	
	
	// Перемещения товаров
	СтруктураИзменений.Вставить("ПеремещениеТоваров",  
	ЗаполнитьСписокИзмененныхОбъектов("ПеремещениеТоваров", "ПеремещениеТоваров", "Документ"));	
	
	Возврат СтруктураИзменений;

КонецФункции
 
