Перем мВалютаРегламентированногоУчета Экспорт;

// Валюта курс и кратность для пересчета регламентированных сумм
Перем мВалютаУпрУчета Экспорт;
Перем мКурсУпрУчета Экспорт;
Перем мКратностьУпрУчета Экспорт;

Перем мРазрешитьНулевыеЦеныВРознице Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Функция помещает в структуру все данные, отображаемые при печати документа.
// Вызывается из функции ПечатьДокумента и из веб-приложения
//
// Возвращаемое значение:
//  Структура
//
Функция ПолучитьДанныеДляПечатиДокумента() Экспорт
	
	ПараметрыПечати = Новый Структура;
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ПараметрыПечати.Вставить("ВыводитьКоды", Истина);
		ПараметрыПечати.Вставить("ИмяКолонкиКодов", "Артикул");
		ТекстКодАртикул = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ПараметрыПечати.Вставить("ВыводитьКоды", Истина);
		ПараметрыПечати.Вставить("ИмяКолонкиКодов", "Код");
		ТекстКодАртикул = "Код";
	Иначе
		ПараметрыПечати.Вставить("ВыводитьКоды", Ложь);
		ПараметрыПечати.Вставить("ИмяКолонкиКодов", "");
		ТекстКодАртикул = "Код";
	КонецЕсли;
    	
	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаПечати = мВалютаРегламентированногоУчета;
	Иначе
		ВалютаПечати = мВалютаУпрУчета;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидСкладаНТТ",    Перечисления.ВидыСкладов.НТТ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Организация,
	|	Склад.Представление КАК ПредставлениеСклада,
	|	Организация,
	|	Склад,
	|	Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Номенклатура."+ ТекстКодАртикул + " КАК КодАртикул,
	|		Номенклатура.НаименованиеПолное КАК Товар,
	|		Количество                      КАК Количество,
	|		КоличествоУчет                  КАК КоличествоПоУчету,
	|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА ЦенаВРознице
	|			ИНАЧЕ Цена
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА Количество * ЦенаВРознице
	|			ИНАЧЕ Сумма
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА КоличествоУчет *ЦенаВРознице
	|			ИНАЧЕ СуммаУчет
	|		КОНЕЦ КАК СуммаПоУчету,
	|		ХарактеристикаНоменклатуры      КАК Характеристика,
	|		СерияНоменклатуры               КАК Серия
	|	)
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	// Выводим шапку накладной
	ПараметрыПечати.Вставить("ТекстЗаголовка", ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Инвентаризация товаров на складе"));

	// Выводим данные об организации и складе
	ПараметрыПечати.Вставить("ПредставлениеОрганизации", ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,"));
	ПараметрыПечати.Вставить("ПредставлениеСклада", Шапка.ПредставлениеСклада);
	ПараметрыПечати.Вставить("ВалютаНаименование", СокрЛП(ВалютаПечати));
	ПараметрыПечати.Вставить("Валюта", ВалютаПечати);
	
	Позиции = Новый Массив;
	
	ИтогСуммы        = 0;
	ИтогСуммыПоУчету = 0;

	Пока ВыборкаСтрокТовары.Следующий() Цикл

		ПараметрыПозиции = Новый Структура;
		ПараметрыПозиции.Вставить("Номенклатура", ВыборкаСтрокТовары.Номенклатура);		
        ПараметрыПозиции.Вставить("НомерСтроки", ВыборкаСтрокТовары.НомерСтроки);		
		ПараметрыПозиции.Вставить("Товар", ВыборкаСтрокТовары.Товар + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары));
		ПараметрыПозиции.Вставить("Количество", ВыборкаСтрокТовары.Количество);
		ПараметрыПозиции.Вставить("КоличествоПоУчету", ВыборкаСтрокТовары.КоличествоПоУчету);
		ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.ЕдиницаИзмерения);
		ПараметрыПозиции.Вставить("Цена", ВыборкаСтрокТовары.Цена);
		ПараметрыПозиции.Вставить("Сумма", ВыборкаСтрокТовары.Сумма);
		ПараметрыПозиции.Вставить("СуммаПоУчету", ВыборкаСтрокТовары.СуммаПоУчету);

		Если ПараметрыПечати.ВыводитьКоды Тогда
			ПараметрыПозиции.Вставить("КодАртикул", ВыборкаСтрокТовары.КодАртикул);
		КонецЕсли;

//pryan@inbox.ru 15/12/2013
		//ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.Сумма;
		ИтогСуммы        = ИтогСуммы        + ВыборкаСтрокТовары.Количество;
		//ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.СуммаПоУчету;
		ИтогСуммыПоУчету = ИтогСуммыПоУчету + ВыборкаСтрокТовары.КоличествоПоУчету;
//pryan@inbox.ru 15/12/2013

		#Если ВнешнееСоединение Тогда
		WEBПриложения.ПодготовитьСтруктуруДляВнешнегоСоединения(ПараметрыПозиции);
		#КонецЕсли

		Позиции.Добавить(ПараметрыПозиции);

	КонецЦикла;
	
	ПараметрыПечати.Вставить("Позиции", Позиции);

	// Вывести Итого
	ПараметрыПечати.Вставить("Всего", ОбщегоНазначения.ФорматСумм(ИтогСуммы));
	ПараметрыПечати.Вставить("ВсегоПоУчету", ОбщегоНазначения.ФорматСумм(ИтогСуммыПоУчету));	

	#Если ВнешнееСоединение Тогда
	WEBПриложения.ПодготовитьСтруктуруДляВнешнегоСоединения(ПараметрыПечати);
	#КонецЕсли
	
	Возврат ПараметрыПечати;
	
КонецФункции //ПолучитьДанныеДляПечатиДокумента()	

#Если Клиент Тогда

// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
//
// Параметры:
//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ПечатьБланк(НаПринтер)

	Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, , , НаПринтер);

	Возврат Неопределено;

КонецФункции // ПечатьБланк()

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента()

	ПараметрыПечати = ПолучитьДанныеДляПечатиДокумента();
	
	Если ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьШапки  = "ШапкаСКодом";
		ОбластьСтроки = "СтрокаСКодом";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	Конецесли;

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИнвентаризацияТоваровНаСкладе";

	Макет = ПолучитьМакет("ИнвентаризацияТоваровНаСкладе");

	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим данные об организации и складе
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим шапку таблицы
	ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
	Если ПараметрыПечати.ВыводитьКоды Тогда
		ОбластьМакета.Параметры.Колонка = ПараметрыПечати.ИмяКолонкиКодов;
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета    = Макет.ПолучитьОбласть(ОбластьСтроки);

	Для каждого ПараметрыПозиции Из ПараметрыПечати.Позиции Цикл	

		Если НЕ ЗначениеЗаполнено(ПараметрыПозиции.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ПараметрыПозиции);

		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	// Вывести Итого
	ОбластьМакета                        = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим подписи к документу
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// ТекстОписания
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
Функция ПечатьИНВ3(БезФактическихДанных = Ложь)

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;

	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаПересчета = мВалютаРегламентированногоУчета;
	Иначе
		ВалютаПересчета = мВалютаУпрУчета;
	КонецЕсли;

	ВалютаПечати = мВалютаРегламентированногоУчета;
	Параметры    = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПересчета, Дата);
	Запрос       = Новый Запрос;

	Запрос.УстановитьПараметр("ТекущийДокумент",      ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Курс",                 Параметры.Курс);
	Запрос.УстановитьПараметр("Кратность",            Параметры.Кратность);
	Запрос.УстановитьПараметр("ВидСкладаНТТ",         Перечисления.ВидыСкладов.НТТ);
	Запрос.УстановитьПараметр("БезФактическихДанных", БезФактическихДанных);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер КАК НомерДокумента,
	|	Дата  КАК ДатаДокумента,
	|	Дата  КАК ДатаСнятияОстатков,
	|	Организация,
	|	Склад.Представление КАК ПредставлениеСклада,
	|	Товары.(
	|		НомерСтроки                     КАК Номер,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|		Номенклатура." + ТоварКод + "   КАК ТоварКод,
	|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
	|		ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|		ВЫБОР
	|			КОГДА &БезФактическихДанных ТОГДА 0
	|			ИНАЧЕ Количество
	|		КОНЕЦ КАК ФактКоличество,
	|		КоличествоУчет КАК БухКоличество,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА ЦенаВРознице
	|			ИНАЧЕ Цена * &Курс / &Кратность
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА &БезФактическихДанных ТОГДА 0
	|			ИНАЧЕ ВЫБОР КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА Количество * ЦенаВРознице ИНАЧЕ Сумма * &Курс / &Кратность КОНЕЦ
	|		КОНЕЦ КАК ФактСумма,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА КоличествоУчет *ЦенаВРознице
	|			ИНАЧЕ СуммаУчет * &Курс / &Кратность
	|		КОНЕЦ КАК БухСумма,
	|		ХарактеристикаНоменклатуры КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	)
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ3";
	
	//pryan@inbox.ru 15/12/2013
	//Макет       = ПолучитьОбщийМакет("ИНВ3");
	Макет       = ПолучитьОбщийМакет("ИНВ3_К");
	//pryan@inbox.ru 15/12/2013

	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
	
	// 04.08.17 Вялов - задача # 3597 - Иванова
	ОбластьМакета.Параметры.Подразделение			 = Шапка.ПредставлениеСклада;

	ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
	
	// 04.08.17 Вялов - задача # 3597 - Иванова
	ОбластьМакета.Параметры.ДатаНачала				 = Шапка.ДатаСнятияОстатков;
	ОбластьМакета.Параметры.ДатаОкончания			 = Шапка.ДатаСнятияОстатков;

	ОбластьМакета.Параметры.ДатаСнятияОстатков       = Шапка.ДатаСнятияОстатков;
	ОбластьМакета.Параметры.НомерДокумента           = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
	// 07.08.17 Вялов - задача # 3597 - Иванова (доп.07.08)
	ОбластьМакета.Параметры.ВидЦенностей			 = "товар";
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	СтрокНаСтранице = 19;
	СтрокШапки      = 5;
	СтрокПодвала    = 5;
	НомерСтраницы   = 2;
	Ном             = 0;

	ИтогФактКоличество = 0;
	ИтогФактСумма      = 0;
	ИтогБухКоличество  = 0;
	ИтогБухСумма       = 0;

	КолвоСтрокПоСтранице = 0;
	КолвоПостранице      = 0;
	СуммаЛиста           = 0;
	ИтогоКолво           = 0;
	ИтогоСумма           = 0;

	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	КоличествоСтрок = ВыборкаСтрокТовары.Количество();

	Если КоличествоСтрок = 1 Тогда
		ПереноситьПоследнююСтроку = 0;
	Иначе
		ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;

	// Выводим многострочную часть докмента
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Ном = Ном + 1;
		//Начинаем новую страницу, если предыдущая строка была последней на странице
		//или пора переносить последнюю строку на последнюю страницу с подвалом.
		ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;

		Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
		 или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда

			ОбластьИтоговПоСтранице                               = Макет.ПолучитьОбласть("ПодвалСтраницы");
			ОбластьИтоговПоСтранице.Параметры.ИтогоФактКоличество = ИтогФактКоличество;
//pryan@inbox.ru 15/12/2013			
			//ОбластьИтоговПоСтранице.Параметры.ИтогоФактСумма      = ИтогФактСумма;
			ОбластьИтоговПоСтранице.Параметры.ИтогоБухКоличество  = ИтогБухКоличество;
//pryan@inbox.ru 15/12/2013
			//ОбластьИтоговПоСтранице.Параметры.ИтогоБухСумма       = ИтогБухСумма;

			ОбластьИтоговПоСтранице.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
			Если НЕ БезФактическихДанных Тогда
				ОбластьИтоговПоСтранице.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(КолвоПостранице);
//pryan@inbox.ru 15/12/2013
				//ОбластьИтоговПоСтранице.Параметры.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаЛиста, ВалютаПечати);
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
			
			НомерСтраницы = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);

			ИтогФактКоличество = 0;
			ИтогФактСумма      = 0;
			ИтогБухКоличество  = 0;
			ИтогБухСумма       = 0;

			КолвоСтрокПоСтранице = 0;
			КолвоПостранице      = 0;
			СуммаЛиста           = 0;

		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрокТовары.ТоварНаименование + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.Номер             = Ном;

		ТабДокумент.Вывести(ОбластьМакета);

		ИтогФактКоличество = ИтогФактКоличество + ВыборкаСтрокТовары.ФактКоличество;
		ИтогФактСумма      = ИтогФактСумма      + ВыборкаСтрокТовары.ФактСумма;
		ИтогБухКоличество  = ИтогБухКоличество  + ВыборкаСтрокТовары.БухКоличество;
		ИтогБухСумма       = ИтогБухСумма       + ВыборкаСтрокТовары.БухСумма;
		ИтогоКолво         = ИтогоКолво         + ВыборкаСтрокТовары.ФактКоличество;
		ИтогоСумма         = ИтогоСумма         + ВыборкаСтрокТовары.ФактСумма;

		КолвоСтрокПоСтранице = КолвоСтрокПоСтранице + 1;
		КолвоПостранице      = КолвоПостранице      + ВыборкаСтрокТовары.ФактКоличество;
		СуммаЛиста           = СуммаЛиста           + ВыборкаСтрокТовары.ФактСумма;

	КонецЦикла;

	// Выводим итоги по последней странице
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ПодвалСтраницы");
	ОбластьИтоговПоСтранице.Параметры.ИтогоФактКоличество  = ИтогФактКоличество;
//pryan@inbox.ru 15/12/2013
	//ОбластьИтоговПоСтранице.Параметры.ИтогоФактСумма       = ИтогФактСумма;
	ОбластьИтоговПоСтранице.Параметры.ИтогоБухКоличество   = ИтогБухКоличество;
//pryan@inbox.ru 15/12/2013
	//ОбластьИтоговПоСтранице.Параметры.ИтогоБухСумма        = ИтогБухСумма;
	ОбластьИтоговПоСтранице.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(КолвоСтрокПоСтранице, ,",,,,,,,,0");
	Если НЕ БезФактическихДанных Тогда
		ОбластьИтоговПоСтранице.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(КолвоПостранице);
//pryan@inbox.ru 15/12/2013
		//ОбластьИтоговПоСтранице.Параметры.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаЛиста, ВалютаПечати);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

	// Выводим подвал документа
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.НачальныйНомерПоПорядку = 1;
	ОбластьМакета.Параметры.НомерКонца              = ВыборкаСтрокТовары.Количество();
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(ВыборкаСтрокТовары.Количество(), ,",,,,,,,,0");
	Если НЕ БезФактическихДанных Тогда
		ОбластьМакета.Параметры.ОбщееКоличествоЕдиницФактическиНаСтраницеПрописью = ФормированиеПечатныхФорм.КоличествоПрописью(ИтогоКолво);
//pryan@inbox.ru 15/12/2013
		//ОбластьМакета.Параметры.СуммаФактическиНаСтраницеПрописью                 = ОбщегоНазначения.СформироватьСуммуПрописью(ИтогоСумма, ВалютаПечати);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);

	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Возврат ТабДокумент;

КонецФункции // ПечатьИНВ3()

// ТекстОписания
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
Функция ПечатьИНВ19()

	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ТоварКод = "Артикул";
	Иначе
		ТоварКод = "Код";
	КонецЕсли;

	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		ВалютаПересчета = мВалютаРегламентированногоУчета;
	Иначе
		ВалютаПересчета = мВалютаУпрУчета;
	КонецЕсли;

	ВалютаПечати = мВалютаРегламентированногоУчета;
	Параметры    = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПересчета, Дата);
	Запрос       = Новый Запрос;

	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Курс",            Параметры.Курс);
	Запрос.УстановитьПараметр("Кратность",       Параметры.Кратность);
	Запрос.УстановитьПараметр("ВидСкладаНТТ",    Перечисления.ВидыСкладов.НТТ);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер  КАК НомерДокумента,
	|	Дата   КАК ДатаДокумента,
	|	Дата   КАК ДатаНачалаИнвентаризации,
	|	Организация КАК Руководители,
	|	Организация,
	|	Склад.Представление КАК ПредставлениеСклада,
	|	Товары.(
	|		НомерСтроки КАК Номер,
	|		Номенклатура,
	|		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|		Номенклатура." + ТоварКод + "   КАК ТоварКод,
	|		ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияНаименование,
	|		ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|		Количество                     КАК ФактКоличество,
	|		КоличествоУчет                 КАК БухКоличество,
	|       Номенклатура.Родитель          КАК Родитель,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА ЦенаВРознице
	|			ИНАЧЕ Цена * &Курс / &Кратность
	|		КОНЕЦ КАК Цена,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА Количество * ЦенаВРознице
	|			ИНАЧЕ Сумма * &Курс / &Кратность
	|		КОНЕЦ КАК ФактСумма,
	|		ВЫБОР
	|			КОГДА Склад.ВидСклада = &ВидСкладаНТТ ТОГДА КоличествоУчет *ЦенаВРознице
	|			ИНАЧЕ СуммаУчет * &Курс / &Кратность
	|		КОНЕЦ КАК БухСумма,
	|		ХарактеристикаНоменклатуры     КАК Характеристика,
	|		СерияНоменклатуры КАК Серия
	|	)
	|ИЗ
	|	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	|
	|ГДЕ
	|	ИнвентаризацияТоваровНаСкладе.Ссылка = &ТекущийДокумент
	|Упорядочить ПО 
	|ИнвентаризацияТоваровНаСкладе.Товары.Номенклатура.Родитель";


	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаСтрокТовары = Шапка.Товары.Выбрать();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияТоваровНаСкладе_ИНВ19";
//pryan@inbox.ru 15/12/2013
	//Макет       = ПолучитьОбщийМакет("ИНВ19");
	Макет       = ПолучитьОбщийМакет("ИНВ19_К");
	
	ОрганизацияСклада = Справочники.Организации.ПустаяСсылка();
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(СокрЛП(Склад.Наименование));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Склад);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	если Выборка.Следующий() тогда
		ОрганизацияСклада = Выборка.Значение;
	конецесли;
	
	// < 04.08.17 Вялов - запрет "пустой" организации # 3597 - Иванова
//	ОрганизацияНаПечать = сокрлп(Склад.Наименование)+", "+?(ОрганизацияСклада.Пустая(),"",сокрлп(ОрганизацияСклада.Наименование));
////pryan@inbox.ru 15/12/2013
	ОрганизацияНаПечать = ОрганизацияСклада;
	// 04.08.17 Вялов - запрет "пустой" организации # 3597 - Иванова >

	// Выводим шапку накладной
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
//pryan@inbox.ru 15/12/2013	
	//ОбластьМакета.Параметры.ПредставлениеОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	//ОбластьМакета.Параметры.ОрганизацияПоОКПО        	= СведенияОбОрганизации.КодПоОКПО;
	
	// < 04.08.17 Вялов - задача # 3597 - Иванова
	//ОбластьМакета.Параметры.ПредставлениеОрганизации = ОрганизацияНаПечать;
	ОбластьМакета.Параметры.ПредставлениеОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	ОбластьМакета.Параметры.ПредставлениеПодразделения	= Шапка.ПредставлениеСклада;
 	// 04.08.17 Вялов - задача # 3597 - Иванова >
	
	ОбластьМакета.Параметры.ОрганизацияПоОКПО        	= ОрганизацияСклада.КодПоОКПО;
//pryan@inbox.ru 15/12/2013	
	ОбластьМакета.Параметры.ДатаДокумента            	= Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.ДатаНачалаИнвентаризации 	= Шапка.ДатаНачалаИнвентаризации;
	// 04.08.17 Вялов - задача # 3597 - Иванова
	ОбластьМакета.Параметры.ДатаОкончанияИнвентаризации	= Шапка.ДатаНачалаИнвентаризации;

	ОбластьМакета.Параметры.НомерДокумента           	= ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);

	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.ДатаДокумента,);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;

	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	Ном             = 0;
	НомерСтраницы   = 2;

	ИтогоРезультатИзлишекКолво   = 0;
	ИтогоРезультатИзлишекСумма   = 0;
	ИтогоРезультатНедостачаКолво = 0;
	ИтогоРезультатНедостачаСумма = 0;

	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы1");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	КоличествоСтрок = ВыборкаСтрокТовары.Количество();

	// Выводим многострочную часть докмента
	//ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	// Выводим многострочную часть докмента
	ОбластьМакета           = Макет.ПолучитьОбласть("СтрокаТаблицы1");
	ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоТаблицы1");
	ОбластьПодвала          = Макет.ПолучитьОбласть("Подвал");
	Пока ВыборкаСтрокТовары.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		МассивВыводимыхОбластей.Очистить();
		МассивВыводимыхОбластей.Добавить(ОбластьМакета);
		МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
		Если Ном = КоличествоСтрок Тогда
			МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
		КонецЕсли;		
		
		Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда

			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

			НомерСтраницы = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);

		КонецЕсли;

		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрокТовары.ТоварНаименование + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары);

		Разница     = 0;
		РазницаСумм = 0;

		Разница     = ВыборкаСтрокТовары.ФактКоличество - ВыборкаСтрокТовары.БухКоличество;
		РазницаСумм = ВыборкаСтрокТовары.ФактСумма      - ВыборкаСтрокТовары.БухСумма;
		Если Разница = 0 Тогда
			Продолжить;
		КонецЕсли;

		Если Разница < 0 И РазницаСумм < 0 Тогда
			ОбластьМакета.Параметры.РезультатНедостачаКолво = - Разница;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатНедостачаСумма = - РазницаСумм;
			ОбластьМакета.Параметры.РезультатИзлишекКолво   = 0;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатИзлишекСумма   = 0;

			ИтогоРезультатНедостачаКолво = ИтогоРезультатНедостачаКолво + (- Разница);
			ИтогоРезультатНедостачаСумма = ИтогоРезультатНедостачаСумма + (- РазницаСумм);
			ИтогоРезультатИзлишекКолво   = ИтогоРезультатИзлишекКолво   + 0;
			ИтогоРезультатИзлишекСумма   = ИтогоРезультатИзлишекСумма   + 0;
		ИначеЕсли Разница < 0 И РазницаСумм >= 0 Тогда
			ОбластьМакета.Параметры.РезультатНедостачаКолво = - Разница;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатНедостачаСумма = РазницаСумм;
			ОбластьМакета.Параметры.РезультатИзлишекКолво   = 0;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатИзлишекСумма   = 0;

			ИтогоРезультатНедостачаКолво = ИтогоРезультатНедостачаКолво + (- Разница);
			ИтогоРезультатНедостачаСумма = ИтогоРезультатНедостачаСумма + РазницаСумм;
			ИтогоРезультатИзлишекКолво   = ИтогоРезультатИзлишекКолво   + 0;
			ИтогоРезультатИзлишекСумма   = ИтогоРезультатИзлишекСумма   + 0;
		Иначе
			ОбластьМакета.Параметры.РезультатНедостачаКолво = 0;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатНедостачаСумма = 0;
			ОбластьМакета.Параметры.РезультатИзлишекКолво   = Разница;
//pryan@inbox.ru 15/12/2013
			//ОбластьМакета.Параметры.РезультатИзлишекСумма   = РазницаСумм;

			ИтогоРезультатНедостачаКолво = ИтогоРезультатНедостачаКолво + 0;
			ИтогоРезультатНедостачаСумма = ИтогоРезультатНедостачаСумма + 0;
			ИтогоРезультатИзлишекКолво   = ИтогоРезультатИзлишекКолво   + Разница;
			ИтогоРезультатИзлишекСумма   = ИтогоРезультатИзлишекСумма   + РазницаСумм;
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьМакета);

		Ном = Ном + 1;

	КонецЦикла;

	ОбластьИтоговПоСтранице.Параметры.ИтогоРезультатИзлишекКолво   = ИтогоРезультатИзлишекКолво;
//pryan@inbox.ru 15/12/2013
	//ОбластьИтоговПоСтранице.Параметры.ИтогоРезультатИзлишекСумма   = ИтогоРезультатИзлишекСумма;
	ОбластьИтоговПоСтранице.Параметры.ИтогоРезультатНедостачаКолво = ИтогоРезультатНедостачаКолво;
//pryan@inbox.ru 15/12/2013
	//ОбластьИтоговПоСтранице.Параметры.ИтогоРезультатНедостачаСумма = ИтогоРезультатНедостачаСумма;
	ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ФИОБухгалтера =  Бухгалтер;
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);

	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Возврат ТабДокумент;

КонецФункции // ПечатьИНВ19()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Ведомость" Тогда

		// Печать упр. формы документа
		ТабДокумент = ПечатьДокумента();
	ИначеЕсли ИмяМакета = "ИНВ3" тогда

		// Печать униф. формы ИНВ-3
		ТабДокумент = ПечатьИНВ3();
	ИначеЕсли ИмяМакета = "ИНВ3_БезФактДанных" тогда

		// Печать униф. формы ИНВ-3
		ТабДокумент = ПечатьИНВ3(Истина);
	ИначеЕсли ИмяМакета = "ИНВ19" тогда

		// Печать униф. формы ИНВ-19
		ТабДокумент = ПечатьИНВ19();
	ИначеЕсли ИмяМакета = "Бланк" Тогда
		ТабДокумент = ПечатьБланк(НаПринтер);
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);

		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Ведомость"         , "Инвентаризация товаров на складе");
	СтруктураМакетов.Вставить("ИНВ3"              , "ИНВ-3 (Инвентаризационная опись товаров)");
	СтруктураМакетов.Вставить("ИНВ3_БезФактДанных", "ИНВ-3 (Инвентаризационная опись с пустыми фактическими данными)");
	СтруктураМакетов.Вставить("ИНВ19"             , "ИНВ-19 (Сличительная ведомость)");
	СтруктураМакетов.Вставить("Бланк"             , "Бланк товарного наполнения");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ЗаполнитьНачальныеНастройки(ПостроительОтчета) Экспорт
	ПостроительОтчета.Текст =
	"ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,","") + "
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	|			0 
	|		ИНАЧЕ
	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	|	КОНЕЦ                                  КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад)
	|КАК ОстаткиТоваров
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, 
	|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|ПО
	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры
	|	И ОстаткиТоваров.Качество = ОстаткиПартий.Качество
	|
	|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество";
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Номенклатура");
	МассивОтбора.Добавить("НоменклатурнаяГруппа");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
КонецПроцедуры

#КонецЕсли

// Выполняет необходимые действия при изменении реквизита Организация
//
Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт

	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;

КонецПроцедуры // ПриИзмененииОрганизации()

// Заполняет реквизиты значениями по умолчанию
//
// Параметры: 
//  ПараметрОбъектКопирования	- содержкит ссылку на документ копирования в случае, 
//								  если новый документ создается копированием
//  ПараметрОснование			- содержкит ссылку на документ-основание в случае, 
//								  если новый документ создается на основании другого
//
Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт

	#Если Клиент Или ВнешнееСоединение Тогда
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), , , ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли

КонецПроцедуры // ИнициализироватьНовыйДокумент()

// Заполняет документ по остаткам на складе
// 
Процедура ЗаполнитьПоОстаткамНаСкладе(ПостроительОтчета, ТолькоУчетные = Ложь, МетодЗаполнения = Неопределено, ВыводитьНоменклатуруБезОстатков = Ложь) Экспорт

	Если РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ВестиПартионныйУчетПоСкладам Тогда
		ВремСклад = Склад;
	Иначе
		ВремСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;
	
	ВалютаУпрУчета    = глЗначениеПеременной("ВалютаУправленческогоУчета");
	СтруктураКурса    = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУпрУчета, Дата);
	КурсУпрУчета      = СтруктураКурса.Курс;
	КратностьУпрУчета = СтруктураКурса.Кратность;
	
	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		
		ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_ВидСкладаНТТ(УчитыватьСерии);
				
	ИначеЕсли Склад.Наименование = "Основной" тогда
		
		//++ Кузнецов С.А. - Добавлена возможность заполнения остатков по методу "Метод "На полке"" и "Стандартный метод" (С выводом номенклатуры без остатков) - 20.04.2016
		Если МетодЗаполнения = "Метод ""На полке""" Тогда			
			
			Если ВыводитьНоменклатуруБезОстатков Тогда				
				ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_Основной_МетодНаПолке_ВыводитьНоменклатуруБезОстатков(УчитыватьСерии);				
			Иначе				
				ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_Основной_МетодНаПолке_НеВыводитьНоменклатуруБезОстатков(УчитыватьСерии);				
			КонецЕсли;
			
		Иначе			
			// Стандартный метод
			
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
				РегОстатки = "ТоварыНаСкладах";
			Иначе
				РегОстатки = "ТоварыВРознице";
			КонецЕсли;
			
			Если ВыводитьНоменклатуруБезОстатков Тогда
				ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_Основной_СтандартныйМетод_ВыводитьНоменклатуруБезОстатков(УчитыватьСерии, РегОстатки);								
			Иначе					
				ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_Основной_СтандартныйМетод_НеВыводитьНоменклатуруБезОстатков(УчитыватьСерии, РегОстатки);
			КонецЕсли;	
			
		КонецЕсли;		
		//-- Кузнецов С.А. - 20.04.2016		
		
	Иначе	
		
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
			РегОстатки = "ТоварыНаСкладах";
		Иначе
			РегОстатки = "ТоварыВРознице";
		КонецЕсли;
		
		ПостроительОтчета.Текст = ЗапросЗаполненияПоОстаткамНаСкладе_ВидСклада_Розничный_Оптовый(УчитыватьСерии, РегОстатки);
				
	КонецЕсли;
	
	Запрос = ПостроительОтчета.ПолучитьЗапрос();
	
	Запрос.УстановитьПараметр("Склад",           Склад);
	Запрос.УстановитьПараметр("ПартионныйСклад", ВремСклад);
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("МоментДокумента", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = Товары.Добавить();
		
		СтрокаТабличнойЧасти.Номенклатура     = Выборка.Номенклатура;
		СтрокаТабличнойЧасти.КоличествоУчет   = Выборка.Количество;
		СтрокаТабличнойЧасти.Количество       = ?(ТолькоУчетные, 0, СтрокаТабличнойЧасти.КоличествоУчет);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = Выборка.ЕдиницаХранения;
		СтрокаТабличнойЧасти.Коэффициент      = Выборка.КоэффициентЕдиницыХранения;
		СтрокаТабличнойЧасти.СуммаУчет        = Выборка.Сумма;
		СтрокаТабличнойЧасти.Сумма            = ?(ТолькоУчетные, 0, Выборка.Сумма);
		
		//++ Кузнецов С.А. - Задача в МегаПлане №3232 - 20.04.2016
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.КоличествоУчет) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сумма) Тогда
			СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.КоличествоУчет;		
		КонецЕсли;
		//-- Кузнецов С.А. - 20.04.2016		
		
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			СтрокаТабличнойЧасти.ЦенаВРознице = Выборка.ЦенаВРознице;
		Иначе
			СтрокаТабличнойЧасти.Качество     = Выборка.Качество;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.СуммаРегл        = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, ВалютаУпрУчета,
		мВалютаРегламентированногоУчета, КурсУпрУчета, 1, КратностьУпрУчета, 1);
		
		СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		Если УчитыватьСерии Тогда
			СтрокаТабличнойЧасти.СерияНоменклатуры = Выборка.СерияНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПоОстаткамНаСкладе()

// Процедура перезаполняет учетные количества в документе
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Процедура ПерезаполнитьУчетныеКоличества(ПостроительОтчета, МетодПерезаполнения = Неопределено) Экспорт

#Если Клиент Тогда
		
	//++ Бажибин М.В. - 
	// Должен заполняться в любом случае, не зависимо от того есть ли строки или нет.
	//	
	Если Товары.Количество() > 0 Тогда
		ТекстВопроса = "Перезаполнить учетные количества и суммы?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	//Иначе
	//	Возврат;
	КонецЕсли;

	// Документ должен быть записан, чтобы этот запрос сработал.
	//Если Модифицированность() Тогда
	//	ТекстВопроса = "Перед заполнением следует записать документ.
	//				   |Продолжить?";
	//	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
	//	Если Ответ <> КодВозвратаДиалога.Да Тогда
	//		Возврат;
	//	КонецЕсли;
	//	Записать(РежимЗаписиДокумента.Запись);
	//КонецЕсли;
#КонецЕсли

	Если РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).ВестиПартионныйУчетПоСкладам Тогда
		ВремСклад = Склад;
	Иначе
		ВремСклад = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	Если Склад.ВидСклада <> Перечисления.ВидыСкладов.НТТ Тогда
		СписокНом = Новый СписокЗначений;
		СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("124"));  // Канцелярия
		
		//++ Кузнецов С.А. - Закомментировал (задача в МегаПлане №3217) - 19.04.2016		
		//СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("1122"));	// Литература_Литература
		//СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("91")); // Muscle&Fitness_Маскл&Фитнесс
		//СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("93")); // IW_Айрон Ворлд
		//-- Кузнецов С.А. - 19.04.2016
		
		СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("132")); // Одежда_Одежда
		СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("116")); // ТМЦ
		СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("999967")); // Услуги
		СписокНом.Добавить(Справочники.Номенклатура.НайтиПоКоду("03062013")); // Хоз. товары
		
		Если  
			//++ Кузнецов С.А. - Возможность заполнение методом "На полке" - 29.01.2016
			//Склад.Наименование = "Основной"
			МетодПерезаполнения = "Метод ""На полке"""
			//-- Кузнецов С.А. - 29.01.2016
		тогда
		
		ПостроительОтчета.Текст =
			"ВЫБРАТЬ
			|	ОстаткиТоваров.Номенклатура,
			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
			|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
			|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
			|	ОстаткиТоваров.Качество,
			|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
			|	ВЫБОР
			|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
			|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
			|			0 
			|		ИНАЧЕ
			|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
			|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
			|	КОНЕЦ                                  КАК Сумма
			|ПОМЕСТИТЬ тзОстатки
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментДокумента, Склад = &Склад)
			|КАК ОстаткиТоваров
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
			|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
			|ПО
			|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
			|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
			+?(УчитыватьСерии, "
			|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
			|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
			|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
			|
			|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
			|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиТоваров.Номенклатура,
			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
			|	ОстаткиТоваров.Качество
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыНаПолкеОстатки.Номенклатура,
			|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
			|	СУММА(ТоварыНаПолкеОстатки.КоличествоСобраноОстаток) КАК КоличествоСобраноОстаток
			|ПОМЕСТИТЬ тзТоварыНаПолке
			|ИЗ
			|	РегистрНакопления.ТоварыНаПолке.Остатки(&МоментДокумента, Склад = &Склад) КАК ТоварыНаПолкеОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыНаПолкеОстатки.Номенклатура,"
			+?(УчитыватьСерии, "
			|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
			|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	тзОстатки.Номенклатура,
			|	тзОстатки.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	тзОстатки.СерияНоменклатуры,", "") + "
			|	тзОстатки.ЕдиницаХранения,
			|	тзОстатки.КоэффициентЕдиницыХранения,
			|	тзОстатки.Качество,
			|	тзОстатки.Количество - ЕСТЬNULL(тзТоварыНаПолке.КоличествоСобраноОстаток,0) КАК Количество,
			|	тзОстатки.Сумма
			|ИЗ
			|	тзОстатки КАК тзОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ тзТоварыНаПолке КАК тзТоварыНаПолке
			|		ПО тзОстатки.Номенклатура = тзТоварыНаПолке.Номенклатура
			|			И тзОстатки.ХарактеристикаНоменклатуры = тзТоварыНаПолке.ХарактеристикаНоменклатуры"
			+?(УчитыватьСерии, "
			|	И (тзОстатки.СерияНоменклатуры          = тзТоварыНаПолке.СерияНоменклатуры
			|		ИЛИ НЕ тзОстатки.Номенклатура.ВестиПартионныйУчетПоСериям)", "")+ "
			|";
			
		Иначе
			
			Если Склад.ВидСклада = Перечисления.ВидыСкладов.Оптовый Тогда
				РегОстатки = "ТоварыНаСкладах";
			Иначе
				РегОстатки = "ТоварыВРознице";
			КонецЕсли;
			
			// Катков А. 02.08.2016 >> изменим запрос, что бы не собирать для цены партии с минусовым остатком
			
			//ПостроительОтчета.Текст =
			//"ВЫБРАТЬ
			//|	ОстаткиТоваров.Номенклатура,
			//|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
			//|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			//+?(УчитыватьСерии, "
			//|	ОстаткиТоваров.СерияНоменклатуры,","") + "
			//|	ОстаткиТоваров.Качество,
			//|	СУММА(ОстаткиТоваров.КоличествоОстаток)                         КАК Количество,
			//|	ВЫБОР
			//|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
			//|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
			//|			0 
			//|		ИНАЧЕ
			//|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
			//|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
			//|	КОНЕЦ                                                           КАК Сумма
			//|ИЗ
			//|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, 
			////|	                Номенклатура в (ВЫБРАТЬ Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
			////|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
			////|                   Номенклатура в (&Списка)
			//|	              Склад = &Склад)
			//|КАК ОстаткиТоваров
			//|ЛЕВОЕ СОЕДИНЕНИЕ
			//|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
			////|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
			////|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
			////|                   Номенклатура в (&Списка)
			//|	              Склад = &ПартионныйСклад) КАК ОстаткиПартий
			//|ПО
			//|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
			//|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
			//+?(УчитыватьСерии, "
			//|	И ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры", "") + "
			//|	И ОстаткиТоваров.Качество = ОстаткиПартий.Качество
			//|
			//|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
			//|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ОстаткиТоваров.Номенклатура,
			//|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			//+?(УчитыватьСерии, "
			//|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
			//|	ОстаткиТоваров.Качество";
			
			ПостроительОтчета.Текст =
			"ВЫБРАТЬ
			|	ВрТаблПартииТоваров.Номенклатура,
			|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ВрТаблПартииТоваров.СерияНоменклатуры,","") + "
			|	ВрТаблПартииТоваров.Качество,
			|	СУММА(ВрТаблПартииТоваров.КоличествоОстаток) КАК КоличествоОстаток,
			|	СУММА(ВрТаблПартииТоваров.СтоимостьОстаток) КАК СтоимостьОстаток
			|ПОМЕСТИТЬ ВрТаблПартииСвернутые
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОстаткиПартий.Номенклатура КАК Номенклатура,
			|		ОстаткиПартий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|		ОстаткиПартий.СерияНоменклатуры КАК СерияНоменклатуры,","") + "
			|		ОстаткиПартий.Качество КАК Качество,
			|		ОстаткиПартий.ДокументОприходования КАК ДокументОприходования,
			|		ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
			|		ОстаткиПартий.СтоимостьОстаток КАК СтоимостьОстаток
			|	ИЗ
			|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, Склад = &ПартионныйСклад) КАК ОстаткиПартий
			|	ГДЕ
			|		ОстаткиПартий.СтоимостьОстаток > 0
			|		И ОстаткиПартий.КоличествоОстаток > 0) КАК ВрТаблПартииТоваров
			|
			|{ГДЕ
			|	ВрТаблПартииТоваров.Номенклатура КАК Номенклатура,
			|	ВрТаблПартииТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
			|
			|СГРУППИРОВАТЬ ПО
			|	ВрТаблПартииТоваров.Качество,
			|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ВрТаблПартииТоваров.СерияНоменклатуры,","") + "
			|	ВрТаблПартииТоваров.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстаткиТоваров.Номенклатура,
			|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ОстаткиТоваров.СерияНоменклатуры,","") + "
			|	ОстаткиТоваров.Качество,
			|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
			|	ВЫБОР
			|		КОГДА СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) = 0
			|				ИЛИ СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(ВрТаблПартииСвернутые.СтоимостьОстаток) * СУММА(ОстаткиТоваров.КоличествоОстаток) / СУММА(ВрТаблПартииСвернутые.КоличествоОстаток)
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад) КАК ОстаткиТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаблПартииСвернутые КАК ВрТаблПартииСвернутые
			|		ПО ОстаткиТоваров.Номенклатура = ВрТаблПартииСвернутые.Номенклатура
			|			И ОстаткиТоваров.ХарактеристикаНоменклатуры = ВрТаблПартииСвернутые.ХарактеристикаНоменклатуры"
			+?(УчитыватьСерии, "
			|			И (ОстаткиТоваров.СерияНоменклатуры = ВрТаблПартииСвернутые.СерияНоменклатуры
			|				ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
			//|			И ОстаткиТоваров.СерияНоменклатуры = ВрТаблПартииСвернутые.СерияНоменклатуры","") + "
			|			И ОстаткиТоваров.Качество = ВрТаблПартииСвернутые.Качество
			|{ГДЕ
			|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
			|	ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиТоваров.Номенклатура,
			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
			+?(УчитыватьСерии, "
			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
			|	ОстаткиТоваров.Качество";
			
			// Катков А. 02.08.2016 <<  
			
		КонецЕсли;
	Иначе

		ПостроительОтчета.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.ЦенаВРознице,
		|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
		|	ВЫБОР
		|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
		|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
		|			0 
		|		ИНАЧЕ
		|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
		|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
		|	КОНЕЦ                                                           КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыВНТТ.Остатки(&МоментДокумента,
		|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &Склад) КАК ОстаткиТоваров
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
		|	                Номенклатура в (Выбрать Номенклатура ИЗ Документ.ИнвентаризацияТоваровНаСкладе.Товары
		|	                                ГДЕ Документ.ИнвентаризацияТоваровНаСкладе.Товары.Ссылка = &ДокументСсылка)
		|	              И Склад = &ПартионныйСклад) КАК ОстаткиПартий
		|ПО
		|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
		|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
		+?(УчитыватьСерии, "
		|	И ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры", "") + "
		|
		|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
		|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
		|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
		|	ОстаткиТоваров.ЦенаВРознице";

	КонецЕсли;

	Запрос = ПостроительОтчета.ПолучитьЗапрос();

	Запрос.УстановитьПараметр("Склад",           Склад);
	Запрос.УстановитьПараметр("ПартионныйСклад", ВремСклад);
	//Запрос.УстановитьПараметр("ДокументСсылка",  Ссылка);
	Запрос.УстановитьПараметр("Списка",  СписокНом.ВыгрузитьЗначения());
	Если ЭтоНовый() Тогда
		Запрос.УстановитьПараметр("МоментДокумента", КонецДня(Дата));
	Иначе
		Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	КонецЕсли;

	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	СтрокаИндекса = "Номенклатура,ХарактеристикаНоменклатуры";
	Если УчитыватьСерии Тогда
		СтрокаИндекса = СтрокаИндекса + ",СерияНоменклатуры";
	КонецЕсли;
	Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда	
		СтрокаИндекса = СтрокаИндекса + ",ЦенаВРознице";
	Иначе
		СтрокаИндекса = СтрокаИндекса + ",Качество";
	КонецЕсли;
	ТаблицаОстатков.Индексы.Добавить(СтрокаИндекса);

	Для каждого СтрокаТабличнойЧасти ИЗ Товары Цикл

		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура",               СтрокаТабличнойЧасти.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
		Если УчитыватьСерии Тогда
			СтруктураПоиска.Вставить("СерияНоменклатуры",      СтрокаТабличнойЧасти.СерияНоменклатуры);
		КонецЕсли;
		Если Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда	
			СтруктураПоиска.Вставить("ЦенаВРознице", СтрокаТабличнойЧасти.ЦенаВРознице);
		Иначе
			СтруктураПоиска.Вставить("Качество",     СтрокаТабличнойЧасти.Качество);
		КонецЕсли;

		МассивСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);

		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТабличнойЧасти.КоличествоУчет = 0;
			СтрокаТабличнойЧасти.СуммаУчет      = 0;
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.КоличествоУчет = ?(СтрокаТабличнойЧасти.Коэффициент = 0, 0,
		МассивСтрок[0].Количество * МассивСтрок[0].КоэффициентЕдиницыХранения
		/ СтрокаТабличнойЧасти.Коэффициент);
		СтрокаТабличнойЧасти.СуммаУчет      = МассивСтрок[0].Сумма;
		СтрокаТабличнойЧасти.Цена           = ?(СтрокаТабличнойЧасти.КоличествоУчет = 0, 0,
		СтрокаТабличнойЧасти.СуммаУчет / СтрокаТабличнойЧасти.КоличествоУчет);
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		СтрокаТабличнойЧасти.СуммаРегл        = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТабличнойЧасти.Сумма, мВалютаУпрУчета, 
		мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
		
	КонецЦикла;
	Для Каждого ст из ТаблицаОстатков Цикл
		Если Товары.Найти(ст.Номенклатура,"Номенклатура") = Неопределено Тогда
			Если СписокНом.НайтиПоЗначению(ст.Номенклатура.Родитель)<>Неопределено Тогда
				продолжить;
			КонецЕсли;
			Нов = Товары.Добавить();
			Нов.Номенклатура = ст.Номенклатура;
			Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			Нов.Коэффициент=1;
			Нов.Качество = ст.Качество;
			Нов.КоличествоУчет = ст.Количество*ст.КоэффициентЕдиницыХранения;
			Нов.СуммаУчет = ст.Сумма;
			Нов.Цена = ?(Нов.КоличествоУчет = 0, 0, Нов.СуммаУчет / Нов.КоличествоУчет);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Нов, ЭтотОбъект);					
			Нов.СуммаРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Нов.Сумма, мВалютаУпрУчета, 
			мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
		ИначеЕсли Товары.Найти(ст.Номенклатура,"Номенклатура").Качество <> ст.Качество Тогда
		   Если СписокНом.НайтиПоЗначению(ст.Номенклатура.Родитель)<>Неопределено Тогда
				продолжить;
			КонецЕсли;
			Нов = Товары.Добавить();
			Нов.Номенклатура = ст.Номенклатура;
			Нов.ЕдиницаИзмерения = Нов.Номенклатура.ЕдиницаХраненияОстатков;
			Нов.Коэффициент=1;
			Нов.Качество = ст.Качество;
			Нов.КоличествоУчет = ст.Количество*ст.КоэффициентЕдиницыХранения;
			Нов.СуммаУчет = ст.Сумма;
			Нов.Цена = ?(Нов.КоличествоУчет = 0, 0, Нов.СуммаУчет / Нов.КоличествоУчет);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Нов, ЭтотОбъект);					
			Нов.СуммаРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Нов.Сумма, мВалютаУпрУчета, 
			мВалютаРегламентированногоУчета, мКурсУпрУчета, 1, мКратностьУпрУчета, 1);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры  // ПерезаполнитьУчетныеКоличества()

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	// Проверка заполнения единицы измерения мест и количества мест
	ОбработкаТабличныхЧастей.ПриЗаписиПроверитьЕдиницуИзмеренияМест(Товары);

	ОбработкаТабличныхЧастей.ЗаполнитьКачествоПоУмолчанию(Товары, Склад.ВидСклада = Перечисления.ВидыСкладов.НТТ);

КонецПроцедуры // ПередЗаписью()


///////////////////////////////////////////////////////////////////////////////////
// ЗАПРОСЫ ДЛЯ ПРОЦЕДУРЫ ЗАПОЛНЕНИЕ ПО ОСТАТКАМ НА СКЛАДЕ 

Функция ЗапросЗаполненияПоОстаткамНаСкладе_ВидСкладаНТТ(УчитыватьСерии)
	
	ТекстЗапроса =  "ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.ЦенаВРознице,
	|	ВЫБОР
	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	|			0 
	|		ИНАЧЕ
	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	|	КОНЕЦ                                   КАК Сумма,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыВНТТ.Остатки(&МоментДокумента,
	|	                                                   Склад = &Склад
	|//	                                                 И ЦенаВРознице > 0
	|) КАК ОстаткиТоваров
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|ПО
	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|
	|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.ЦенаВРознице";
	
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция ЗапросЗаполненияПоОстаткамНаСкладе_ВидСклада_Розничный_Оптовый(УчитыватьСерии, РегОстатки)
	
	// Катков А. 02.08.2016 >> изменим запрос, что бы не собирать для цены партии с минусовым остатком
	 
	//ТекстЗапроса = "ВЫБРАТЬ
	//	|	ОстаткиТоваров.Номенклатура,
	//	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//	+?(УчитыватьСерии, "
	//	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	//	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	//	|	ОстаткиТоваров.Качество,
	//	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	//	|	ВЫБОР
	//	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	//	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	//	|			0 
	//	|		ИНАЧЕ
	//	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	//	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	//	|	КОНЕЦ                                  КАК Сумма
	//	|ИЗ
	//	|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад)
	//	|КАК ОстаткиТоваров
	//	|
	//	|ЛЕВОЕ СОЕДИНЕНИЕ
	//	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	//	|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	//	|ПО
	//	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	//	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	//	+?(УчитыватьСерии, "
	//	|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	//	|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	//	|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
	//	|
	//	|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	//	|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ОстаткиТоваров.Номенклатура,
	//	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//	+?(УчитыватьСерии, "
	//	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//	|	ОстаткиТоваров.Качество";
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВрТаблПартииТоваров.Номенклатура,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,", "") + "
	|	ВрТаблПартииТоваров.Качество,
	|	СУММА(ВрТаблПартииТоваров.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВрТаблПартииТоваров.СтоимостьОстаток) КАК СтоимостьОстаток
	|ПОМЕСТИТЬ ВрТаблПартииСвернутые
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиПартий.Номенклатура КАК Номенклатура,
	|		ОстаткиПартий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|		ОстаткиПартий.СерияНоменклатуры КАК СерияНоменклатуры,", "") + "
	|		ОстаткиПартий.Качество КАК Качество,
	|		ОстаткиПартий.ДокументОприходования КАК ДокументОприходования,
	|		ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
	|		ОстаткиПартий.СтоимостьОстаток КАК СтоимостьОстаток
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|	ГДЕ
	|		ОстаткиПартий.СтоимостьОстаток > 0
	|		И ОстаткиПартий.КоличествоОстаток > 0) КАК ВрТаблПартииТоваров
	|{ГДЕ
	|	ВрТаблПартииТоваров.Номенклатура КАК Номенклатура,
	|	ВрТаблПартииТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаблПартииТоваров.Качество,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,", "") + "
	|	ВрТаблПартииТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) = 0
	|				ИЛИ СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВрТаблПартииСвернутые.СтоимостьОстаток) * СУММА(ОстаткиТоваров.КоличествоОстаток) / СУММА(ВрТаблПартииСвернутые.КоличествоОстаток)
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад) КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаблПартииСвернутые КАК ВрТаблПартииСвернутые
	|		ПО ОстаткиТоваров.Номенклатура = ВрТаблПартииСвернутые.Номенклатура
	|			И ОстаткиТоваров.ХарактеристикаНоменклатуры = ВрТаблПартииСвернутые.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|			И (ОстаткиТоваров.СерияНоменклатуры = ВрТаблПартииСвернутые.СерияНоменклатуры
	|				ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|			И ОстаткиТоваров.Качество = ВрТаблПартииСвернутые.Качество
	|{ГДЕ
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
		+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество";
	
	// Катков А. 02.08.2016 <<  
		
	Возврат ТекстЗапроса;	
	
КонецФункции

Функция ЗапросЗаполненияПоОстаткамНаСкладе_Основной_МетодНаПолке_ВыводитьНоменклатуруБезОстатков(УчитыватьСерии)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	тзНоменклатура.Ссылка КАК Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	тзНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	|			0 
	|		ИНАЧЕ
	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	|	КОНЕЦ                                  КАК Сумма
	|ПОМЕСТИТЬ тзОстатки
	|ИЗ	Справочник.Номенклатура Как тзНоменклатура		
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|			
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментДокумента, Склад = &Склад)
	|КАК ОстаткиТоваров
	|    ПО тзНоменклатура.Ссылка = ОстаткиТоваров.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|ПО
	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
	| ГДЕ НЕ тзНоменклатура.ЭтоГруппа
	|{ГДЕ тзНоменклатура.Ссылка КАК Номенклатура, 
	|     тзНоменклатура.Ссылка.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	тзНоменклатура.Ссылка,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество
	|   тзНоменклатура.ЕдиницаХраненияОстатков,
	|   тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаПолкеОстатки.Номенклатура,
	|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
	|	СУММА(ТоварыНаПолкеОстатки.КоличествоСобраноОстаток) КАК КоличествоСобраноОстаток
	|ПОМЕСТИТЬ тзТоварыНаПолке
	|ИЗ
	|	РегистрНакопления.ТоварыНаПолке.Остатки(&МоментДокумента, Склад = &Склад) КАК ТоварыНаПолкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаПолкеОстатки.Номенклатура,"
	+?(УчитыватьСерии, "
	|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
	|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзОстатки.Номенклатура,
	|	тзОстатки.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	тзОстатки.СерияНоменклатуры,", "") + "
	|	тзОстатки.ЕдиницаХранения,
	|	тзОстатки.КоэффициентЕдиницыХранения,
	|	тзОстатки.Качество,
	|	тзОстатки.Количество - ЕСТЬNULL(тзТоварыНаПолке.КоличествоСобраноОстаток,0) КАК Количество,
	|	тзОстатки.Сумма
	|ИЗ
	|	тзОстатки КАК тзОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзТоварыНаПолке КАК тзТоварыНаПолке
	|		ПО тзОстатки.Номенклатура = тзТоварыНаПолке.Номенклатура
	|			И тзОстатки.ХарактеристикаНоменклатуры = тзТоварыНаПолке.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|	И (тзОстатки.СерияНоменклатуры          = тзТоварыНаПолке.СерияНоменклатуры
	|		ИЛИ НЕ тзОстатки.Номенклатура.ВестиПартионныйУчетПоСериям)", "")+ "
	|";
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ЗапросЗаполненияПоОстаткамНаСкладе_Основной_МетодНаПолке_НеВыводитьНоменклатуруБезОстатков(УчитыватьСерии)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	|			0 
	|		ИНАЧЕ
	|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	|	КОНЕЦ                                  КАК Сумма
	|ПОМЕСТИТЬ тзОстатки
	|	ИЗ РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментДокумента, Склад = &Склад) КАК ОстаткиТоваров
	|        ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|ПО
	|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
	|
	|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаПолкеОстатки.Номенклатура,
	|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
	|	СУММА(ТоварыНаПолкеОстатки.КоличествоСобраноОстаток) КАК КоличествоСобраноОстаток
	|ПОМЕСТИТЬ тзТоварыНаПолке
	|ИЗ
	|	РегистрНакопления.ТоварыНаПолке.Остатки(&МоментДокумента, Склад = &Склад) КАК ТоварыНаПолкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаПолкеОстатки.Номенклатура,"
	+?(УчитыватьСерии, "
	|	ТоварыНаПолкеОстатки.СерияНоменклатуры,", "") + "
	|	ТоварыНаПолкеОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзОстатки.Номенклатура,
	|	тзОстатки.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	тзОстатки.СерияНоменклатуры,", "") + "
	|	тзОстатки.ЕдиницаХранения,
	|	тзОстатки.КоэффициентЕдиницыХранения,
	|	тзОстатки.Качество,
	|	тзОстатки.Количество - ЕСТЬNULL(тзТоварыНаПолке.КоличествоСобраноОстаток,0) КАК Количество,
	|	тзОстатки.Сумма
	|ИЗ
	|	тзОстатки КАК тзОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзТоварыНаПолке КАК тзТоварыНаПолке
	|		ПО тзОстатки.Номенклатура = тзТоварыНаПолке.Номенклатура
	|			И тзОстатки.ХарактеристикаНоменклатуры = тзТоварыНаПолке.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|	И (тзОстатки.СерияНоменклатуры          = тзТоварыНаПолке.СерияНоменклатуры
	|		ИЛИ НЕ тзОстатки.Номенклатура.ВестиПартионныйУчетПоСериям)", "")+ "
	|";	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросЗаполненияПоОстаткамНаСкладе_Основной_СтандартныйМетод_ВыводитьНоменклатуруБезОстатков(УчитыватьСерии, РегОстатки)
	
	// Катков А. 02.08.2016 >> изменим запрос, что бы не собирать для цены партии с минусовым остатком
		
	//текстЗапроса = "ВЫБРАТЬ
	//			|	тзНоменклатура.Ссылка КАК Номенклатура,
	//			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//			+?(УчитыватьСерии, "
	//			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//			|	тзНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	//			|	тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	//			|	ОстаткиТоваров.Качество,
	//			|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	//			|	ВЫБОР
	//			|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	//			|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	//			|			0 
	//			|		ИНАЧЕ
	//			|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	//			|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	//			|	КОНЕЦ                                  КАК Сумма
	//			|ИЗ
	//			|   Справочник.Номенклатура КАК тзНоменклатура
	//			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад)
	//			|КАК ОстаткиТоваров
	//			|    ПО тзНоменклатура.Ссылка = ОстаткиТоваров.Номенклатура
	//			|ЛЕВОЕ СОЕДИНЕНИЕ
	//			|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	//			|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	//			|ПО
	//			|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	//			|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	//			+?(УчитыватьСерии, "
	//			|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	//			|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	//			|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
	//			| ГДЕ НЕ тзНоменклатура.ЭтоГруппа
	//			|{ГДЕ тзНоменклатура.Ссылка КАК Номенклатура, 
	//			|     тзНоменклатура.Ссылка.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	тзНоменклатура.Ссылка,
	//			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//			+?(УчитыватьСерии, "
	//			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//			|	ОстаткиТоваров.Качество,
	//			|   тзНоменклатура.ЕдиницаХраненияОстатков,
	//            |   тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент";
	
	текстЗапроса = "ВЫБРАТЬ
	|	ВрТаблПартииТоваров.Номенклатура,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,","") + "
	|	ВрТаблПартииТоваров.Качество,
	|	СУММА(ВрТаблПартииТоваров.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВрТаблПартииТоваров.СтоимостьОстаток) КАК СтоимостьОстаток
	|ПОМЕСТИТЬ ВрТаблПартииСвернутые
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиПартий.Номенклатура КАК Номенклатура,
	|		ОстаткиПартий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|		ОстаткиПартий.СерияНоменклатуры КАК СерияНоменклатуры,","") + "
	|		ОстаткиПартий.Качество КАК Качество,
	|		ОстаткиПартий.ДокументОприходования КАК ДокументОприходования,
	|		ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
	|		ОстаткиПартий.СтоимостьОстаток КАК СтоимостьОстаток
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|	ГДЕ
	|		ОстаткиПартий.СтоимостьОстаток > 0
	|		И ОстаткиПартий.КоличествоОстаток > 0) КАК ВрТаблПартииТоваров
	|
	|{ГДЕ
	|	ВрТаблПартииТоваров.Номенклатура КАК Номенклатура,
	|	ВрТаблПартииТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаблПартииТоваров.Качество,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,","") + "
	|	ВрТаблПартииТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзНоменклатура.Ссылка КАК Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,","") + "
	|	тзНоменклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) = 0
	|				ИЛИ СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВрТаблПартииСвернутые.СтоимостьОстаток) * СУММА(ОстаткиТоваров.КоличествоОстаток) / СУММА(ВрТаблПартииСвернутые.КоличествоОстаток)
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Справочник.Номенклатура КАК тзНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад) КАК ОстаткиТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВрТаблПартииСвернутые КАК ВрТаблПартииСвернутые
	|			ПО ОстаткиТоваров.Номенклатура = ВрТаблПартииСвернутые.Номенклатура
	|				И ОстаткиТоваров.ХарактеристикаНоменклатуры = ВрТаблПартииСвернутые.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|				И (ОстаткиТоваров.СерияНоменклатуры = ВрТаблПартииСвернутые.СерияНоменклатуры
	|					ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|				И ОстаткиТоваров.Качество = ВрТаблПартииСвернутые.Качество
	|		ПО тзНоменклатура.Ссылка = ОстаткиТоваров.Номенклатура
	|ГДЕ
	|	НЕ тзНоменклатура.ЭтоГруппа
	|{ГДЕ
	|	тзНоменклатура.Ссылка КАК Номенклатура,
	|	тзНоменклатура.Ссылка.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	тзНоменклатура.Ссылка,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,","") + "
	|	ОстаткиТоваров.Качество,
	|	тзНоменклатура.ЕдиницаХраненияОстатков,
	|	тзНоменклатура.ЕдиницаХраненияОстатков.Коэффициент";
	
	// Катков А. 02.08.2016 <<  
	
	Возврат текстЗапроса;	
	
КонецФункции

Функция ЗапросЗаполненияПоОстаткамНаСкладе_Основной_СтандартныйМетод_НеВыводитьНоменклатуруБезОстатков(УчитыватьСерии, РегОстатки)
	
	// Катков А. 02.08.2016 >>
	
	//текстЗапроса = "ВЫБРАТЬ
	//			|	ОстаткиТоваров.Номенклатура,
	//			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//			+?(УчитыватьСерии, "
	//			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//			|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	//			|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	//			|	ОстаткиТоваров.Качество,
	//			|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	//			|	ВЫБОР
	//			|		КОГДА (СУММА(ОстаткиПартий.КоличествоОстаток) = 0)
	//			|		  ИЛИ (СУММА(ОстаткиПартий.КоличествоОстаток) ЕСТЬ NULL) ТОГДА
	//			|			0 
	//			|		ИНАЧЕ
	//			|			СУММА(ОстаткиПартий.СтоимостьОстаток)*СУММА(ОстаткиТоваров.КоличествоОстаток)
	//			|			/ СУММА(ОстаткиПартий.КоличествоОстаток)
	//			|	КОНЕЦ                                  КАК Сумма
	//			|ИЗ
	//			|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад)
	//			|КАК ОстаткиТоваров
	//			|
	//			|ЛЕВОЕ СОЕДИНЕНИЕ
	//			|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, 
	//			|	                                                  Склад = &ПартионныйСклад) КАК ОстаткиПартий
	//			|ПО
	//			|	ОстаткиТоваров.Номенклатура = ОстаткиПартий.Номенклатура
	//			|	И ОстаткиТоваров.ХарактеристикаНоменклатуры = ОстаткиПартий.ХарактеристикаНоменклатуры"
	//			+?(УчитыватьСерии, "
	//			|	И (ОстаткиТоваров.СерияНоменклатуры          = ОстаткиПартий.СерияНоменклатуры
	//			|		ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	//			|	И ОстаткиТоваров.Качество                   = ОстаткиПартий.Качество
	//			|
	//			|{ГДЕ ОстаткиТоваров.Номенклатура КАК Номенклатура, 
	//			|     ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	ОстаткиТоваров.Номенклатура,
	//			|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	//			+?(УчитыватьСерии, "
	//			|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	//			|	ОстаткиТоваров.Качество";
	
	текстЗапроса = "ВЫБРАТЬ
	|	ВрТаблПартииТоваров.Номенклатура,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,", "") + "
	|	ВрТаблПартииТоваров.Качество,
	|	СУММА(ВрТаблПартииТоваров.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВрТаблПартииТоваров.СтоимостьОстаток) КАК СтоимостьОстаток
	|ПОМЕСТИТЬ ВрТаблПартииСвернутые
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиПартий.Номенклатура КАК Номенклатура,
	|		ОстаткиПартий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|		ОстаткиПартий.СерияНоменклатуры КАК СерияНоменклатуры,", "") + "
	|		ОстаткиПартий.Качество КАК Качество,
	|		ОстаткиПартий.ДокументОприходования КАК ДокументОприходования,
	|		ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
	|		ОстаткиПартий.СтоимостьОстаток КАК СтоимостьОстаток
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментДокумента, Склад = &ПартионныйСклад) КАК ОстаткиПартий
	|	ГДЕ
	|		ОстаткиПартий.СтоимостьОстаток > 0
	|		И ОстаткиПартий.КоличествоОстаток > 0) КАК ВрТаблПартииТоваров
	|{ГДЕ
	|	ВрТаблПартииТоваров.Номенклатура КАК Номенклатура,
	|	ВрТаблПартииТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаблПартииТоваров.Качество,
	|	ВрТаблПартииТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ВрТаблПартииТоваров.СерияНоменклатуры,", "") + "
	|	ВрТаблПартииТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХранения,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентЕдиницыХранения,
	|	ОстаткиТоваров.Качество,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) = 0
	|				ИЛИ СУММА(ВрТаблПартииСвернутые.КоличествоОстаток) ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(ВрТаблПартииСвернутые.СтоимостьОстаток) * СУММА(ОстаткиТоваров.КоличествоОстаток) / СУММА(ВрТаблПартииСвернутые.КоличествоОстаток)
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	РегистрНакопления." + РегОстатки + ".Остатки(&МоментДокумента, Склад = &Склад) КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаблПартииСвернутые КАК ВрТаблПартииСвернутые
	|		ПО ОстаткиТоваров.Номенклатура = ВрТаблПартииСвернутые.Номенклатура
	|			И ОстаткиТоваров.ХарактеристикаНоменклатуры = ВрТаблПартииСвернутые.ХарактеристикаНоменклатуры"
	+?(УчитыватьСерии, "
	|			И (ОстаткиТоваров.СерияНоменклатуры = ВрТаблПартииСвернутые.СерияНоменклатуры
	|				ИЛИ НЕ ОстаткиТоваров.Номенклатура.ВестиПартионныйУчетПоСериям)", "") + "
	|			И ОстаткиТоваров.Качество = ВрТаблПартииСвернутые.Качество
	|{ГДЕ
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры,"
	+?(УчитыватьСерии, "
	|	ОстаткиТоваров.СерияНоменклатуры,", "") + "
	|	ОстаткиТоваров.Качество,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков,
	|	ОстаткиТоваров.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент";
	
	// Катков А. 02.08.2016 <<  
	
	Возврат текстЗапроса;	
	
КонецФункции


///////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУпрУчета                 = глЗначениеПеременной("ВалютаУправленческогоУчета");

мРазрешитьНулевыеЦеныВРознице = УправлениеДопПравамиПользователей.РазрешитьНулевыеЦеныВРознице();

