
// есть ли уже в регистре подобное сочетание номенклатура + характеристика
Функция ПроверкаУникальности()
	
	Рез = Истина;
	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	_СоответствияНоменклатуры.Номенклатура,
	//	|	_СоответствияНоменклатуры.Номенклатура_УТ11,
	//	|	_СоответствияНоменклатуры.Характеристика
	//	|ИЗ
	//	|	РегистрСведений._СоответствияНоменклатуры КАК _СоответствияНоменклатуры
	//	|ГДЕ
	//	|	_СоответствияНоменклатуры.Номенклатура_УТ11 = &Номенклатура_УТ11
	//	|	И _СоответствияНоменклатуры.Характеристика = &Характеристика";
	//
	//Запрос.УстановитьПараметр("Номенклатура_УТ11", ЭтотОбъект.Отбор);
	//Запрос.УстановитьПараметр("Характеристика", Характеристика);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат Рез;
	
КонецФункции



Процедура ПередЗаписью(Отказ, Замещение)
	
//	Отказ = НЕ ПроверкаУникальности();

КонецПроцедуры
