
///////////////////////////////////////////////////////
// СТАНДАРТНЫЕ СОБЫТИЯ ФОРМЫ 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КолонкаКодаНоменклатурыПоставщика = 1;
	КолонкаКоличества = 3;
	КолонкаНаименованияНоменклатурыПоставщика = 2;
	КолонкаСумма = 4;
	НачальнаяСтрока = 1;
	НомерЛиста = 1;
	КолонкаНомераГТДПоставщика = 5;
	
КонецПроцедуры


///////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ 

&НаКлиенте
Процедура ПродолжитьЗагрузку(Команда)
	
	// Проверим есть ли хотя бы один не заполненный реквизит	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		Закрыть(ЗаполнитьДополнительныеПараметры());
	Иначе
		Сообщить("Загрузка отменена!");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////
// ДОПОЛНИТЕЛЬНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ ФОРМЫ 

&НаСервере
Функция ПроверитьЗаполнениеРеквизитов()
	
	результатПроверки = Истина;
	Для Каждого реквизит Из ПолучитьРеквизиты() Цикл
		Если Не ЗначениеЗаполнено(ЭтаФорма[реквизит.Имя])
			И реквизит.Имя <> "КолонкаНомераГТДПоставщика" Тогда
			результатПроверки = Ложь;
			Сообщить("Не заполнен реквизит: " + реквизит.Имя);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат результатПроверки;
	
КонецФункции
	
&НаСервере
Функция ЗаполнитьДополнительныеПараметры()
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("КолонкаКодаНоменклатурыПоставщика", КолонкаКодаНоменклатурыПоставщика);
	ПараметрыДанных.Вставить("КолонкаКоличества", КолонкаКоличества);
	ПараметрыДанных.Вставить("КолонкаНаименованияНоменклатурыПоставщика", КолонкаНаименованияНоменклатурыПоставщика);
	ПараметрыДанных.Вставить("КолонкаСумма", КолонкаСумма);
	ПараметрыДанных.Вставить("НачальнаяСтрока", НачальнаяСтрока);
	ПараметрыДанных.Вставить("НомерЛиста", НомерЛиста);
	ПараметрыДанных.Вставить("КолонкаНомераГТДПоставщика", КолонкаНомераГТДПоставщика);
	
	Возврат ПараметрыДанных;
	
КонецФункции




