
///////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННЫЕ БАЗЫ ДЛЯ ОБМЕНА
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуВозможныхОбменов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "БП"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУправлениеТорговлейБухгалтерияКОРП"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = "Бухгалтерия предприятия, редакция 1.6";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Бухгалтерия 8 (начиная с версии 1.6)"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию = "БП"; // Префикс по умолчанию

	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуВозможныхОбменовСРознинойТорговлей() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации           = "РТ";                                                      // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена            = "ОбменУправлениеТорговлейРозничнаяТорговля";                // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации  = "Розница, редакция 1.0";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Розница 8 (начиная с версии 1.0)"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию        = "РТ";                                                      // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуВозможныхОбменовУТУПП() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "УПП"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУправлениеПредприятиемУправлениеТорговлей"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = "Управление производственным предприятием 1.2";
	СтрокаТаблицы.ПредставлениеКонфигурации = "Управление производственным предприятием 1.2"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию = "УПП"; // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазеУтУПП() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "УТ");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУправлениеПредприятиемУправлениеТорговлей");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "Управление торговлей, редакция 10.3");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "УТ");
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "УТ");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУправлениеТорговлейБухгалтерияКОРП");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "1С:Управление торговлей 8 (начиная с версии 10.3)");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "УТ");
	
	Возврат СтруктураДанных;
	
КонецФункции


Процедура ОткрытьФормуВыполненияОбменаСБухгалтерией() Экспорт
		
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаУТУПП() Экспорт
			
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУправлениеПредприятиемУправлениеТорговлей.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаРИБ() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.Полный.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаССайтом() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменССайтомТоварами.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаСРозничнойТорговлей() Экспорт
		
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУправлениеТорговлейРозничнаяТорговля.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаСБухгалтерией() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаУТУПП() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУправлениеПредприятиемУправлениеТорговлей.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаССайтом() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = Справочники.НастройкиОбменаССайтом.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБ() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаСРозничнойТорговлей() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУправлениеТорговлейРозничнаяТорговля.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаВсе() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

// Процедура открывает настройки обмена с ВЕБ-сайтом
//
Процедура НастроитьОбменДаннымиСВебСайтом() Экспорт

	ОбработкаПомощника = Обработки.ПомощникНастройкиОбменаДаннымиССайтом.Создать();
	ФормаНастройки = ОбработкаПомощника.ПолучитьФорму("Форма");
	ФормаНастройки.Открыть();	

КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБ() Экспорт
	
	ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
	ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаCписка.Открыть();
	
КонецПроцедуры



