
Процедура ЗаписатьКадровуюИсторию(Сотрудник, НаДату, 
	СтатусПродавца, Магазин=Неопределено, Содержание="") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

    ЗаписьКадроваяИстория = РегистрыСведений.КадроваяИстория.СоздатьМенеджерЗаписи();
	ЗаписьКадроваяИстория.Сотрудник	 		= Сотрудник;
	ЗаписьКадроваяИстория.Прочитать();
	
	ЗаписьКадроваяИстория.Период			= НаДату;
	ЗаписьКадроваяИстория.ДатаСобытия 		= НаДату;
	ЗаписьКадроваяИстория.Сотрудник	 		= Сотрудник;
	
	ЗаписьКадроваяИстория.СтатусПродавца 	= СтатусПродавца;
	
	Если Магазин <> Неопределено Тогда 
		ЗаписьКадроваяИстория.Магазин 		= Магазин;
	Иначе
		ЗаписьКадроваяИстория.Магазин   	= Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;	
	
	ЗаписьКадроваяИстория.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	
	Если Содержание <> "" Тогда 
		ЗаписьКадроваяИстория.Содержание 		= Содержание;	
	КонецЕсли;
	
	ЗаписьКадроваяИстория.Записать(Истина);					
			
	УстановитьПривилегированныйРежим(Ложь);	
			
КонецПроцедуры

