#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура  ЗаполнитьСтрокуТЧ(СтрокаТЗ) Экспорт
	
Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТ_Заказ
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыЗаказы.Штрихкод,
		|	ШтрихкодыЗаказы.Владелец
		|ПОМЕСТИТЬ ВТ_Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыЗаказы КАК ШтрихкодыЗаказы
		|ГДЕ
		|	ШтрихкодыЗаказы.Владелец = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы4Logistic.Заказ,
		|	ЕСТЬNULL(Заказы4Logistic.Вес, 0) КАК Вес
		|ПОМЕСТИТЬ ВТ_Вес
		|ИЗ
		|	РегистрСведений.Заказы4Logistic КАК Заказы4Logistic
		|ГДЕ
		|	Заказы4Logistic.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказ.Заказ,
		|	ВТ_Штрихкод.Штрихкод,
		|	ВТ_Вес.Вес
		|ИЗ
		|	ВТ_Заказ КАК ВТ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Штрихкод КАК ВТ_Штрихкод
		|		ПО ВТ_Заказ.Заказ = ВТ_Штрихкод.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Вес КАК ВТ_Вес
		|		ПО ВТ_Заказ.Заказ = ВТ_Вес.Заказ";
		
		Запрос.УстановитьПараметр("Заказ",СтрокаТЗ.Заказ.Ссылка);
		
		Рез=Запрос.Выполнить();
		
		Если НЕ Рез.Пустой() Тогда
			
			Выборка = Рез.Выбрать();
		    Выборка.Следующий();
			СтрокаТЗ.СтатусСборки = СтрокаТЗ.Заказ.СтатусыСборкиЗаказа;
			СтрокаТЗ.Сумма  = СтрокаТЗ.Заказ.СуммаДокумента;
			СтрокаТЗ.Штрихкод = Выборка.Штрихкод;
			СтрокаТЗ.ВесЗаказа  = Выборка.Вес;
			
		КонецЕсли;
		
КонецПроцедуры
//#КонецОбласти
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецЕсли
