//16.06.2017, Юра
Процедура ПриЗаписи(Отказ, Замещение)
	Если ЭтотОбъект.Количество() = 1  Тогда //то же самое, что "НЕ Замещение" (условие чтобы 2 раза проверку не делать при одной записи) и запись делается единичная
		Если НЕ ЭтотОбъект.Отбор.Склад.Значение.Родитель = Справочники.Склады.НайтиПоКоду("000000008")
			И НЕ ЭтотОбъект.Отбор.Склад.Значение.Наименование = "Основной" Тогда//21.09.2017, Юра
			Отказ = Истина;
			Сообщить("Склад (магазин) должен быть выбран из папки ""Магазины"".");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
