
// Получаем таблицу незавершенных сеансов текущего магазина 
Функция ПолучитьТаблицуНезавершенныхСеансовПродавцов(Пользователь) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияРаботыПродавцов.Период,
		|	ИсторияРаботыПродавцов.Пользователь,
		|	ИсторияРаботыПродавцов.Продавец,
		|	ИсторияРаботыПродавцов.НомерСеанса,
		|	ИсторияРаботыПродавцов.ДатаНачала,
		|	НастройкиПользователей.Значение КАК ОсновнойСклад,
		|	ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяНачалаРаботы, ДАТАВРЕМЯ(1, 1, 1, 10, 0, 0)) КАК ВремяНачалаРаботы,
		|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяНачалаРаботы, ДАТАВРЕМЯ(1, 1, 1, 10, 0, 0)), СЕКУНДА) КАК ВремяНачалаРаботыВСекундах,
		|	ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяОкончанияРаботы, ДАТАВРЕМЯ(1, 1, 1, 22, 0, 0)) КАК ВремяОкончанияРаботы,
		|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЕСТЬNULL(ПериодическиеСвойстваМагазинов.ВремяОкончанияРаботы, ДАТАВРЕМЯ(1, 1, 1, 22, 0, 0)), СЕКУНДА) КАК ВремяОкончанияРаботыВСекундах
		|ИЗ
		|	РегистрСведений.ИсторияРаботыПродавцов КАК ИсторияРаботыПродавцов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|		ПО ИсторияРаботыПродавцов.Пользователь = НастройкиПользователей.Пользователь
		|			И (НастройкиПользователей.Пользователь = &НастройкаОсновнойСклад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПериодическиеСвойстваМагазинов КАК ПериодическиеСвойстваМагазинов
		|		ПО (НастройкиПользователей.Значение = ПериодическиеСвойстваМагазинов.Магазин)
		|ГДЕ
		|	ИсторияРаботыПродавцов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|	И ИсторияРаботыПродавцов.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОсновнойСклад", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойСклад);
	
	РезультатЗапроса = Запрос.Выполнить();	

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции	