//***********************************************************************************************
//	 ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ ПОДСИСТЕМЫ УЧЕТА НДС

// Копирует общие реквизиты из строки источника в строку применик
//
//
Функция СкопироватьСтрокуВДругуюТаблицу(СтрокаИсточник, ТаблицаИсточник, СтрокаПриемник, ТаблицаПриемник) Экспорт
	
	Для Каждого ТекКол Из ТаблицаПриемник.Колонки Цикл
		Если ТаблицаИсточник.Колонки.Найти(ТекКол.Имя) <> Неопределено Тогда
			СтрокаПриемник[ТекКол.Имя] = СтрокаИсточник[ТекКол.Имя];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции // УчетнаяПолитикаНалоговыйУчет()

// Для переданного в качестве параметра счета-факутры выданного, получает для него
// ключевые сведения: Контрагент, Договор, Сумма и др., которые содержатся в 
// документе основнии.
//
// Параметры:
//  СчетФактура  - счет-фактура для которого нужно определить параметры
//  Результат - структура в которой возвращаются значения параметров
//
Процедура ПолучитьПараметрыСчетаФактуры(СчетФактура, мВалютаРегламентированногоУчета, Результат) Экспорт

	Результат = Новый Структура("Организация, Контрагент, Договор, СуммаДокумента, ВалютаДокумента");
	Результат.СуммаДокумента = 0;
	
	Если ТипЗнч(СчетФактура)= Тип("ДокументСсылка.СчетФактураПолученный")
		Или ТипЗнч(СчетФактура)= Тип("ДокументСсылка.СчетФактураВыданный")
		Тогда
		Ссылка = СчетФактура;
	Иначе
		Ссылка = СчетФактура.Ссылка;
	КонецЕсли; 
	
	ЭтоПолученныйСФ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") тогда
		ЭтоПолученныйСФ = Истина;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") и СчетФактура.НаАванс Тогда
		// Реквизиты заново не определяются, получаются из счета-фактуры
		Результат.Вставить("Организация"	, СчетФактура.Организация);
		Результат.Вставить("Контрагент"		, СчетФактура.Контрагент);
		Результат.Вставить("Договор"		, СчетФактура.ДоговорКонтрагента);
		Результат.Вставить("ВалютаДокумента", СчетФактура.ВалютаДокумента);
		Результат.Вставить("СуммаДокумента"	, СчетФактура.СуммаДокумента);
		Возврат;
	КонецЕслИ;
	
	ДокументыОснования = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(СчетФактура.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"), Истина);
	
	ТипыОснований = Новый Соответствие();
	Для каждого Основание Из ДокументыОснования Цикл
		Если не ЗначениеЗаполнено(Основание) Тогда
			Продолжить;			
		КонецЕсли; 

		МассивДокументов = ТипыОснований[ТипЗнч(Основание)];
		
		Если МассивДокументов = Неопределено Тогда
			МассивДокументов = новый Массив();
			ТипыОснований.Вставить(ТипЗнч(Основание),МассивДокументов);
		КонецЕсли; 
		
		МассивДокументов.Добавить(Основание);
	КонецЦикла; 
	
	Если ТипыОснований.Количество() = 0 Тогда
		// ТЧ оснований не заполнена, параметры определить нельзя
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
	
	Для каждого ТипОснования Из ТипыОснований Цикл
		ТипДокументаОснования	= ТипОснования.Ключ;
		ДокументыОснования		= ТипОснования.Значение;
	    ТекстЗапроса = "";
		Если ТипДокументаОснования = Тип("ДокументСсылка.ВводНачальныхОстатковНДС") Тогда
		// Для данного документа применяется специфический запрос для расчета параметров счета-фактуры
			Запрос.УстановитьПараметр("ДокументОснованиеВНО", ДокументыОснования);

			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка.Организация КАК Организация,
				|	ВводНачальныхОстатковНДСДанныеПоСФ.Контрагент,
				|	ВводНачальныхОстатковНДСДанныеПоСФ.ДоговорКонтрагента КАК Договор,
				|	СУММА(ВводНачальныхОстатковНДСДанныеПоСФ.СуммаБезНДС + ВводНачальныхОстатковНДСДанныеПоСФ.НДС) КАК СуммаДокумента,
				|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента
				|ИЗ
				|	Документ.ВводНачальныхОстатковНДС.ДанныеПоСФ КАК ВводНачальныхОстатковНДСДанныеПоСФ
				|ГДЕ
				|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка В(&ДокументОснованиеВНО)
				|	И ВводНачальныхОстатковНДСДанныеПоСФ.СчетФактура = &ТекущийДокумент
				|
				|СГРУППИРОВАТЬ ПО
				|	ВводНачальныхОстатковНДСДанныеПоСФ.Контрагент,
				|	ВводНачальныхОстатковНДСДанныеПоСФ.ДоговорКонтрагента,
				|	ВводНачальныхОстатковНДСДанныеПоСФ.Ссылка.Организация";
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		// Для данного документа применяется специфический запрос для расчета параметров счета-фактуры
		Запрос.УстановитьПараметр("ДокументОснованиеАО", ДокументыОснования);
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	АвансовыйОтчетПрочее.Ссылка.Организация КАК Организация,
			|	АвансовыйОтчетПрочее.Поставщик КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК Договор,
			|	СУММА(АвансовыйОтчетПрочее.Сумма) КАК СуммаДокумента,
			|	АвансовыйОтчетПрочее.Ссылка.ВалютаДокумента КАК ВалютаДокумента
			|ИЗ
			|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
			|ГДЕ
			|	АвансовыйОтчетПрочее.Ссылка В (&ДокументОснованиеАО)
			|	И АвансовыйОтчетПрочее.ПредъявленСФ
			|	И АвансовыйОтчетПрочее.СчетФактура = &ТекущийДокумент
			|
			|СГРУППИРОВАТЬ ПО
			|	АвансовыйОтчетПрочее.Поставщик,
			|	АвансовыйОтчетПрочее.Ссылка.ВалютаДокумента,
			|	АвансовыйОтчетПрочее.Ссылка.Организация
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	АвансовыйОтчетТовары.Ссылка.Организация,
			|	АвансовыйОтчетТовары.Поставщик,
			|	НЕОПРЕДЕЛЕНО,
			|	СУММА(АвансовыйОтчетТовары.Сумма),
			|	АвансовыйОтчетТовары.Ссылка.ВалютаДокумента
			|ИЗ
			|	Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
			|ГДЕ
			|	АвансовыйОтчетТовары.Ссылка В(&ДокументОснованиеАО)
			|	И АвансовыйОтчетТовары.СчетФактура = &ТекущийДокумент
			|	И АвансовыйОтчетТовары.ПредъявленСФ
			|
			|СГРУППИРОВАТЬ ПО
			|	АвансовыйОтчетТовары.Поставщик,
			|	АвансовыйОтчетТовары.Ссылка.ВалютаДокумента,
			|	АвансовыйОтчетТовары.Ссылка.Организация";
		
	Иначе
		
		Если ТипДокументаОснования = Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС") Тогда
			Запрос.УстановитьПараметр("ДокументОснование_ОтражениеРеализацииТоваровИУслугНДС", ДокументыОснования);
		
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОтражениеРеализацииТоваровИУслугНДС.Организация,
				|	ОтражениеРеализацииТоваровИУслугНДС.Контрагент,
				|	ОтражениеРеализацииТоваровИУслугНДС.ДоговорКонтрагента КАК Договор,
				|	ОтражениеРеализацииТоваровИУслугНДС.СуммаДокумента,
				|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента
				|ИЗ
				|	Документ.ОтражениеРеализацииТоваровИУслугНДС КАК ОтражениеРеализацииТоваровИУслугНДС
				|ГДЕ
				|	ОтражениеРеализацииТоваровИУслугНДС.Ссылка В(&ДокументОснование_ОтражениеРеализацииТоваровИУслугНДС)";
							
		ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ОтражениеПоступленияТоваровИУслугНДС") Тогда
			Запрос.УстановитьПараметр("ДокументОснование_ОтражениеПоступленияТоваровИУслугНДС", ДокументыОснования);
		
			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.Организация,
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.Контрагент,
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.ДоговорКонтрагента КАК Договор,
				|	СУММА(ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Сумма) КАК СуммаДокумента,
				|	&ВалютаРегламентированногоУчета КАК ВалютаДокумента
				|ИЗ
				|	Документ.ОтражениеПоступленияТоваровИУслугНДС.ТоварыИУслуги КАК ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги
				|ГДЕ
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка В(&ДокументОснование_ОтражениеПоступленияТоваровИУслугНДС)
				|
				|СГРУППИРОВАТЬ ПО
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.Контрагент,
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.ДоговорКонтрагента,
				|	ОтражениеПоступленияТоваровИУслугНДСТоварыИУслуги.Ссылка.Организация";
							
		ИначеЕсли (ТипДокументаОснования= Тип("ДокументСсылка.ПоступлениеТоваровУслуг"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПоступлениеДопРасходов"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровПоставщику"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ОтчетКомитентуОПродажах"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.АккредитивПолученный"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ИнкассовоеПоручениеПереданное"))
			или (ТипДокументаОснования= Тип("ДокументСсылка.ПриходныйКассовыйОрдер")) Тогда
			
			ИмяОбъекта = ДокументыОснования[0].Метаданные().Имя;
			Запрос.УстановитьПараметр("ДокументОснование_"+ИмяОбъекта, ДокументыОснования);
			
			Если (ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"))
			 или ((ТипДокументаОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")) И ЭтоПолученныйСФ) Тогда
				ИдРеквСумма = "СуммаВознаграждения";
			ИначеЕсли (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровПоставщику")) и ЭтоПолученныйСФ 
				ИЛИ (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ")) и ЭтоПолученныйСФ 
				ИЛИ (ТипДокументаОснования= Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")) и не ЭтоПолученныйСФ 
				тогда
				ИдРеквСумма = "СуммаДокумента*(-1)";
			Иначе
				ИдРеквСумма = "СуммаДокумента";
			КонецЕсли;
			
			ТекстЗапроса = "ВЫБРАТЬ
							|	" + ИмяОбъекта + ".Организация,
							|	" + ИмяОбъекта + ".Контрагент,
							|	" + ИмяОбъекта + ".ДоговорКонтрагента как Договор,
							|	" + ИмяОбъекта + "." + ИдРеквСумма + " Как СуммаДокумента,
							|	" + ИмяОбъекта + ".ВалютаДокумента Как ВалютаДокумента
							|ИЗ
							|	Документ." + ИмяОбъекта + " КАК " + ИмяОбъекта + "

							|ГДЕ
							|	" + ИмяОбъекта + ".Ссылка в (&ДокументОснование_"+ИмяОбъекта+")";
							
		КонецЕсли;
		
	КонецЕсли;
		Если не ПустаяСтрока(ТекстЗапроса) Тогда
			Запрос.Текст = ?(ПустаяСтрока(Запрос.Текст),"", Запрос.Текст + Символы.ПС+"Объединить Все "+Символы.ПС)+ТекстЗапроса;
		КонецЕсли; 
	КонецЦикла;
	
	Если ПустаяСтрока(Запрос.Текст) Тогда
	    Возврат;
	Иначе
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		ПерваяСтрока = Истина;
		РазныеОрганизации = ложь;
		РазныеКонтрагенты = ложь;
		РазныеДоговоры = ложь;
		РазныеВалюты = ложь;
		Пока Выборка.Следующий() Цикл
			Если ПерваяСтрока Тогда
				ПерваяСтрока = Ложь;
				ЗаполнитьЗначенияСвойств(Результат, Выборка);
			Иначе
				РазныеОрганизации	= РазныеОрганизации или не Результат.Организация= Выборка.Организация;
				РазныеКонтрагенты	= РазныеКонтрагенты или не Результат.Контрагент = Выборка.Контрагент;
				РазныеВалюты		= РазныеВалюты или не Результат.ВалютаДокумента	= Выборка.ВалютаДокумента;
				РазныеДоговоры		= ?(ЭтоПолученныйСФ, Ложь, РазныеДоговоры или не Результат.Договор = Выборка.Договор);
				Результат.СуммаДокумента = 	Результат.СуммаДокумента + Выборка.СуммаДокумента;
			КонецЕсли; 
		КонецЦикла; 
		Если РазныеОрганизации или РазныеКонтрагенты или РазныеВалюты Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Реквизиты документов, на основании которых зарегистрирован счет-фактура, не совпадают:"+
							?(РазныеОрганизации,Символы.ПС+" - не совпадает организация","")+
							?(РазныеКонтрагенты,Символы.ПС+" - не совпадает контрагент","")+
							?(РазныеДоговоры,Символы.ПС+" - не совпадает договор","")+
							?(РазныеВалюты,Символы.ПС+" - не совпадает валюта документа","")+
							Символы.ПС+"Необходимо изменить параметры документов-оснований или зарегистрировать по документам с расхождениями отдельные счета-фактуры.", Ложь, Строка(СчетФактура), СтатусСообщения.Внимание); 
			Если РазныеОрганизации Тогда
				 Результат.Организация = Неопределено;
			КонецЕсли; 				
			Если РазныеКонтрагенты Тогда
				 Результат.Контрагент = Неопределено;
			КонецЕсли; 				
			Если РазныеВалюты Тогда
				 Результат.ВалютаДокумента = Неопределено;
			КонецЕсли; 				
			Если РазныеДоговоры тогда
				 Результат.Договор = Неопределено;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры // ПолучитьПараметрыСчетаФактуры()

// Определяется список услуг, которые обрлагаются ЕНВД в указанной организации по регистру УслугиЕНВД
// Параметры
// 	Дата, Организация
// Возвращает список значений с услугами ЕНВД
Функция ПолучитьСписокУслугОблагаемыхЕНВД(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УслугиЕНВДСрезПоследних.Номенклатура
	|ИЗ
	|	РегистрСведений.УслугиЕНВД.СрезПоследних(&Дата, Организация = &Организация) КАК УслугиЕНВДСрезПоследних
	|ГДЕ
	|	УслугиЕНВДСрезПоследних.ОблагаетсяЕНВД";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Новый СписокЗначений();
	Результат.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("Номенклатура"));
	
	Возврат Результат;
	
КонецФункции 

// Процедура проверяет соответствие реквизитов счета-фактуры выданной и документа-основания.
// В случае несоответствия выдается сообщение пользователю.
//
// Параметры:
//		- ДокОбъект - документ-основание
//		- Сообщать  - флаг, если истина, то выводить сообщение пользователю, по умолчанию = Истина
//
// Возврат:
//		- Истина, если различий не найдено, Ложь в противном случае
//
Функция ПроверитьСоответствиеРеквизитовСчетаФактуры(ДокОбъект, ВидДокумента = "СчетФактураВыданный", Сообщать = Истина) Экспорт

	СчетФактура = НайтиПодчиненныйДокумент( ДокОбъект.Ссылка, ВидДокумента, Ложь);
	Если СчетФактура = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Текст = "";
	структураРеквизиты = новый Структура;
	Флаг  = Истина;
	МетаРекв = ДокОбъект.Метаданные().Реквизиты;
	МетаСФ   = Метаданные.Документы[ВидДокумента].Реквизиты;
	Если ДокОбъект.Ссылка.Дата <> ДокОбъект.Дата
	   И НачалоДня(ДокОбъект.Дата) <> НачалоДня(СчетФактура.Дата) Тогда
		Если Сообщать Тогда
			Сообщить("Изменена дата документа-основания. Возможно требуется внести изменения в счет-фактуру.", СтатусСообщения.Внимание);
		КонецЕсли;
		СтруктураРеквизиты.Вставить("Дата", ДокОбъект.Дата);
		Флаг = Ложь;
	КонецЕсли;
	Если МетаРекв.Найти("Организация") <> Неопределено И СчетФактура.Организация <> ДокОбъект.Организация Тогда
		Если Сообщать Тогда
			Текст = " - Не совпадает организация";
		КонецЕсли;
		СтруктураРеквизиты.Вставить("Организация", ДокОбъект.Организация);

		Флаг = Ложь;
	КонецЕсли;
	Если МетаРекв.Найти("ДоговорКонтрагента") <> Неопределено
	   И МетаСФ.Найти("ДоговорКонтрагента") <> Неопределено
	   И СчетФактура.ДоговорКонтрагента <> ДокОбъект.ДоговорКонтрагента Тогда
		Если Сообщать Тогда
			Текст = Текст + ?(ПустаяСтрока(Текст),"", Символы.ПС) + " - Не совпадает договор";
		КонецЕсли;
		СтруктураРеквизиты.Вставить("ДоговорКонтрагента", ДокОбъект.ДоговорКонтрагента);

		Флаг = Ложь;
	КонецЕсли;
	Если МетаРекв.Найти("Контрагент") <> Неопределено И СчетФактура.Контрагент <> ДокОбъект.Контрагент Тогда
		Если Сообщать Тогда
			Текст = Текст + ?(ПустаяСтрока(Текст),"", Символы.ПС) + " - Не совпадает контрагент";
		КонецЕсли;
		СтруктураРеквизиты.Вставить("Контрагент", ДокОбъект.Контрагент);

		Флаг = Ложь;
	КонецЕсли;
	Если МетаРекв.Найти("ВалютаДокумента") <> Неопределено И СчетФактура.ВалютаДокумента <> ДокОбъект.ВалютаДокумента Тогда
		Если Сообщать Тогда
			Текст = Текст + ?(ПустаяСтрока(Текст),"", Символы.ПС) + " - Не совпадает валюта документа";
		КонецЕсли;
		СтруктураРеквизиты.Вставить("ВалютаДокумента", ДокОбъект.ВалютаДокумента);

		Флаг = Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДокОбъект.Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") 
		И ВидДокумента = "СчетФактураПолученный" Тогда
		СуммаДокумента = 0;
		Для Каждого СтрокаТаблицы Из ДокОбъект.Товары Цикл
			Если СтрокаТаблицы.СчетФактура = СчетФактура Тогда
				СуммаДокумента = СуммаДокумента + СтрокаТаблицы.Сумма + ?(ДокОбъект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ДокОбъект.Прочее Цикл
			Если СтрокаТаблицы.СчетФактура = СчетФактура Тогда
				СуммаДокумента = СуммаДокумента + СтрокаТаблицы.Сумма + ?(ДокОбъект.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		СуммаДокументаСсылка = 0;
		Для Каждого СтрокаТаблицы Из ДокОбъект.Ссылка.Товары Цикл
			Если СтрокаТаблицы.СчетФактура = СчетФактура Тогда
				СуммаДокументаСсылка = СуммаДокументаСсылка + СтрокаТаблицы.Сумма + ?(ДокОбъект.Ссылка.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из ДокОбъект.Ссылка.Прочее Цикл
			Если СтрокаТаблицы.СчетФактура = СчетФактура Тогда
				СуммаДокументаСсылка = СуммаДокументаСсылка + СтрокаТаблицы.Сумма + ?(ДокОбъект.Ссылка.СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДС);
			КонецЕсли;
		КонецЦикла;
		Если СуммаДокумента <> СуммаДокументаСсылка Тогда
			Если Сообщать Тогда
				Текст = Текст + ?(ПустаяСтрока(Текст),"", Символы.ПС) + " - Изменилась сумма документа";
			КонецЕсли;
			
			СтруктураРеквизиты.Вставить("СуммаДокумента", СуммаДокумента);

			Флаг = Ложь;
		КонецЕсли;
	ИначеЕсли МетаРекв.Найти("СуммаДокумента") <> Неопределено 
		И не ДокОбъект.Ссылка.СуммаДокумента = ДокОбъект.СуммаДокумента 
		Тогда
		Если Сообщать Тогда
			Текст = Текст + ?(ПустаяСтрока(Текст),"", Символы.ПС) + " - Изменилась сумма документа";
		КонецЕсли;
 		НоваяСумма = Макс(0, СчетФактура.СуммаДокумента - ?(ЗначениеЗаполнено(ДокОбъект.Ссылка.СуммаДокумента),ДокОбъект.Ссылка.СуммаДокумента,0))+ДокОбъект.СуммаДокумента;
		
		СтруктураРеквизиты.Вставить("СуммаДокумента", НоваяСумма);

		Флаг = Ложь;
	КонецЕсли;
	
	Если Сообщать И НЕ ПустаяСтрока(Текст) Тогда
		Текст = "Обнаружены расхождения реквизитов в счете-фактуре: " + Строка(СчетФактура) + " и в документе-основании: " + Строка(ДокОбъект) + Символы.ПС + Текст;
		Если СчетФактура.ДокументыОснования.Количество()=1 Тогда
			флУдалосьПерезаполнить = ложь;
			Попытка
				СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
				Для каждого элемент из СтруктураРеквизиты цикл
					СчетФактураОбъект[элемент.Ключ]=Элемент.Значение;
				Конеццикла;
				СчетФактураОбъект.мОбновлятьРеквизитыПриЗаписи = Ложь;
				СчетФактураОбъект.Записать();
				флУдалосьПерезаполнить = истина;
			Исключение
			КонецПопытки;
			Если флУдалосьПерезаполнить Тогда
				Текст = Текст + Символы.ПС+"Реквизиты в счете-фактуре перезаполнены автоматически";
			Иначе
				Текст = Текст + Символы.ПС+"Не удалось автоматически перезаполнить реквизиты. Для перезаполнения реквизитов необходимо открыть счет-фактуру и записать ее";
			КонецЕсли;
		Иначе
			Текст = Текст + Символы.ПС+"Внимание! У данного счета-фактуры несколько документов-оснований. Нельзя автоматически перезаполнить реквизиты";
		КонецЕсли;
		
		Сообщить(Текст, СтатусСообщения.Внимание);
	КонецЕсли;
	
	Возврат Флаг;
	
КонецФункции // ПроверитьСоответствиеРеквизитовСчетаФактурыВыданной()

//Определяет применяется ли упрощенная система налогообложения
//
Функция ОрганизацияУчитываетНДС(Организация, Знач Дата) Экспорт //~

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	ОшибкаВПолучении = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, ОшибкаВПолучении, Организация, "Нал");
		
	Возврат ?(ОшибкаВПолучении, Ложь, Не УчетнаяПолитика.ОрганизацияНеЯвляетсяПлательщикомНДС);

КонецФункции

//Функция определения вида ценности по группе критериев.
//
Функция ОпределитьВидЦенности(Объект, ЭтоДопРасходы = Ложь, ЭтоАгентскийНДС = Ложь, ВидАгентскогоДоговора = Неопределено, ЭтоУслуга = Ложь) Экспорт

	Если ЭтоАгентскийНДС Тогда

		// Это агентский НДС - для него применяется специальный вид ценности.
		Если ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Аренда Тогда
			ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентАренда;
		ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.РеализацияИмущества Тогда
			ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества;
		Иначе
			ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы;
		КонецЕсли;
	ИначеЕсли ЭтоДопРасходы Тогда
		ВидЦенности = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") тогда
		Если НЕ ЗначениеЗаполнено(Объект) Или ЭтоУслуга = Истина Тогда
			ВидЦенности = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
		Иначе
			ВидЦенности = Перечисления.ВидыЦенностей.Товары;
		КонецЕсли;
	Иначе
		ВидЦенности = Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги;
	КонецЕсли;

	Возврат ВидЦенности;

КонецФункции // ОпределитьВидЦенности()

// Функция определяет объект учета (ценность) в строке табличной части.
// Сама табличная часть задается в параметре ТаблицаЗначений. В результате 
// анализа этой табличной части определяется из какой именно колонки нужно 
// взять объект учета.
Функция ОпределитьЦенностьИзСтрокиТабличнойЧасти(СтрокаТаблицы, ТаблицаЗначений) Экспорт

	Ценность = "";

	Если ТаблицаЗначений.Колонки.Найти("Номенклатура") <> Неопределено Тогда
		Ценность = СтрокаТаблицы.Номенклатура;

	КонецЕсли;

	Возврат Ценность;

КонецФункции // ОпределитьЦенностьИзСтрокиТабличнойЧасти()

// Функция для выбора подчиненных счетов-фактур на аванс по ссылке на документ оплаты
// Помимо списка документов получает дополнительные реквизиты (договор, ставка НДС)
Функция ВыбратьПодчиненныеСФНаАванс(ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда

		Запрос = Новый Запрос;

		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка,
		|	СчетФактураВыданный.ДоговорКонтрагента,
		|	СчетФактураВыданный.СтавкаНДС
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументСсылка И
		|	(СчетФактураВыданный.НаАванс = ИСТИНА)";

		Результат = Запрос.Выполнить().Выгрузить();

	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции // НайтиПодчиненныйДокумент()

// Процедура арифметически распределяет заданную сумму
// по столбцу таблицы значений пропрционально колонке базы распределения
// при этом размерность таблицы и базы распределения должны совпадать.
// Как правило база распределения - просто одна из колонок таблицы
Процедура РаспределитьСуммуПоСтолбцу(МассивБазыРаспределения, РаспределяемаяСумма, ТаблицаРезультата, ИдКолонкиРезультата) Экспорт

	// Определяем сумму базы
	СуммаБазы = 0;

	Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл
		СуммаБазы = СуммаБазы + МассивБазыРаспределения[Индекс];
	КонецЦикла;

	Если СуммаБазы > 0 Тогда
		// Выполняем распределение
		УчтеноБазыРаспределения = 0;
		УжеРаспределено = 0;

		Для Индекс = 0 По МассивБазыРаспределения.Количество() - 1 Цикл

			// Рассчитываем шаг распределения
			ШагРаспределения = Окр(РаспределяемаяСумма * (УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс])/СуммаБазы, 2) - УжеРаспределено;

			// Записываем результат
			ТаблицаРезультата[Индекс][ИдКолонкиРезультата] = ШагРаспределения;

			// Учитываем полученный результат для вычисления последующих шагов распределения
			УчтеноБазыРаспределения = УчтеноБазыРаспределения + МассивБазыРаспределения[Индекс];
			УжеРаспределено         = УжеРаспределено + ШагРаспределения;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // РаспределитьСуммуПоСтолбцу()

// Процедура подготовки таблицы значений для целей формирования движений
// по подсистеме НДС. Доопределяет дополнительные колонки "ВидЦенности" и "Ценность"
// в таблице значений, переданной в качестве параметра
Процедура ОпределениеДополнительныхПараметровТаблицыПартийДляПодсистемыУчетаНДС(СтруктураШапкиДокумента, ТаблицаЗначений) Экспорт

	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		ЭтоУслуга = Ложь;

		Если ТаблицаЗначений.Колонки.Найти("Номенклатура") <> Неопределено Тогда
			Ценность = ОпределитьЦенностьИзСтрокиТабличнойЧасти(СтрокаТаблицы, ТаблицаЗначений);
			ЭтоУслуга = СтрокаТаблицы.Услуга;
		КонецЕсли;

		ЭтоДопРасходы         = (СтруктураШапкиДокумента.ВидДокумента = "ПоступлениеДопРасходов");
		УчетАгентскогоНДС     = Ложь;
		ВидАгентскогоДоговора = "";

		Если СтруктураШапкиДокумента.Свойство("УчетАгентскогоНДС") и ЗначениеЗаполнено(СтруктураШапкиДокумента.УчетАгентскогоНДС) тогда
			УчетАгентскогоНДС = СтруктураШапкиДокумента.УчетАгентскогоНДС;
		КонецЕсли;
		Если СтруктураШапкиДокумента.Свойство("ВидАгентскогоДоговора") тогда
			ВидАгентскогоДоговора = СтруктураШапкиДокумента.ВидАгентскогоДоговора;
		КонецЕсли;
		
		СтрокаТаблицы.ВидЦенности = ОпределитьВидЦенности(Ценность, ЭтоДопРасходы, УчетАгентскогоНДС, ВидАгентскогоДоговора, ЭтоУслуга);
		СтрокаТаблицы.Ценность    = Ценность;

	КонецЦикла;

КонецПроцедуры // ОпределениеДополнительныхПараметровТаблицыПартийДляПодсистемыУчетаНДС()

// Процедура вызывается по кнопке "Рассчитать" из формы диалога документа.
// Выполняется расчет объемов реализации в текущем периоде по данным
// регистра НДСНачисленный в разрезе различных ставок НДС.
//
Процедура РассчитатьВыручкуДляНДС(Организация, НачалоПериода, КонецПериода, ВыручкаЕНВД, ВыручкаБезНДС, ВыручкаНДС0, ВыручкаНДС) Экспорт

	ВыручкаЕНВД   = 0;
	ВыручкаБезНДС = 0;
	ВыручкаНДС0   = 0;
	ВыручкаНДС    = 0;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(КонецПериода));
	
	ВидыНачисленияРеализация = Новый СписокЗначений;
	ВидыНачисленияРеализация.Добавить(Перечисления.НДСВидНачисления.РеализацияСНДС);
	ВидыНачисленияРеализация.Добавить(Перечисления.НДСВидНачисления.РеализацияБезНДС);
	ВидыНачисленияРеализация.Добавить(Перечисления.НДСВидНачисления.Реализация0);
	ВидыНачисленияРеализация.Добавить(Перечисления.НДСВидНачисления.РеализацияЕНВД);
	
	Запрос.УстановитьПараметр("ВидыНачисленияРеализация", ВидыНачисленияРеализация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НДСНачисленныйОбороты.ВидНачисления,
	               |	СУММА(НДСНачисленныйОбороты.СуммаБезНДСПриход) КАК СуммаБезНДС
	               |ИЗ
	               |	РегистрНакопления.НДСНачисленный.Обороты(
	               |		НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	               |		КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	               |		,
	               |		Организация = &Организация
	               |		    И (СчетФактура.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ))
	               |		    И ВидНачисления В (&ВидыНачисленияРеализация)) КАК НДСНачисленныйОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДСНачисленныйОбороты.ВидНачисления";
			
				   
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		
		Если СтрокаРезультата.ВидНачисления = Перечисления.НДСВидНачисления.РеализацияСНДС Тогда
		    ВыручкаНДС = ВыручкаНДС + СтрокаРезультата.СуммаБезНДС;
			
		ИначеЕсли СтрокаРезультата.ВидНачисления = Перечисления.НДСВидНачисления.РеализацияБезНДС Тогда	
			ВыручкаБезНДС = ВыручкаБезНДС + СтрокаРезультата.СуммаБезНДС;
			
		ИначеЕсли СтрокаРезультата.ВидНачисления = Перечисления.НДСВидНачисления.РеализацияЕНВД Тогда	
			ВыручкаЕНВД = ВыручкаЕНВД + СтрокаРезультата.СуммаБезНДС;
			
		ИначеЕсли СтрокаРезультата.ВидНачисления = Перечисления.НДСВидНачисления.Реализация0 Тогда	
			ВыручкаНДС0 = ВыручкаНДС0 + СтрокаРезультата.СуммаБезНДС;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РассчитатьВыручкуДляНДС()

// Функция определеяет наличие счетов-фактур, полученных по документам,
// которые могут являться основаниями для ввода счетов-фактур полученных.
//
// Применяется для контроля за наличием в ИБ информации о наличии счетов-фактур.
// 
// Параметры:
//  НачПериода       - Дата - Начальная дата выборки (включительно, с 00:00:00)
//  КонПериода       - Дата - Конечная дата выборки (включительно, по 23:59:59)
//  Организация      - Справочник.Ссылка - Организация, по которой
//                     осуществляется отбор. Необязательный параметр. Если не
//                     задан, отбор осуществляется по всем организациям.
//  Фильтр           - Документ.Ссылка, Массив - Документ или список документов, 
//                     по которым осуществляется отбор. Необязательный параметр. 
//                     Если не задан, отбор осуществляется по всем документам, 
//                     которые могут являться основаниями для ввода счетов-фактур 
//                     полученных.
//  ВсеКромеФильтра  - Булево - Признак отбора документов, не входящих в Фильтр. 
//                     Необязательный параметр. Значение по умолчаню - Ложь.
//                     Если не задан, отбираются документы, заданные в Фильтре.
//  НаличиеСчетаФактуры - Булево - Признак отбора документов:
//                        Истина - Отбирать документы, по которым существуют
//                        счета-фактуры.
//                        Ложь - Отбирать документы, по которым счета-фактуры
//                        отсутствуют.
//                        Необязательный параметр. Если не задан, осуществляется
//                        отбор всех документов.
// СчетФактураПроведен - Булево - Признак отбора счетов-фактур:
//                        Истина - Отбирать проведенные счета-фактуры
//                        Ложь - Отбирать непроведенные счета-фактуры
//                        Необязательный параметр. Если не задан, осуществляется
//                        отбор всех счетов-фактур.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений - Состав колонок:
//                    Документ - Документ.Ссылка - Документ, по которому
//                               производился поиск счета-фактуры полученного
//                    СчетФактура - Документ.Ссылка - Ссылка на счет-фактуру
//                                  полученный, либо Неопределено
//
Функция ОпределитьНаличиеСчетовФактурПолученных(НачПериода=Неопределено, КонПериода= Неопределено,Организация, Фильтр = Неопределено,ВсеКромеФильтра = Ложь, НаличиеСчетаФактуры = Неопределено, СчетФактураПроведен = Неопределено, ДатаСФНеБолее = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачПериода",  НачПериода);
	Запрос.УстановитьПараметр("КонПериода",  ?(Не ЗначениеЗаполнено(КонПериода),'00010101',КонецДня(КонПериода)));
	Запрос.УстановитьПараметр("ДатаСФНеБолее",  ?(Не ЗначениеЗаполнено(ДатаСФНеБолее),Неопределено,КонецДня(ДатаСФНеБолее)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Фильтр",      Фильтр);
	
	// Дополняем условие запроса отбором по периоду
	Если (ЗначениеЗаполнено(НачПериода)) И (ЗначениеЗаполнено(КонПериода)) Тогда
		Условие_Основание = "СчетФактура.Дата МЕЖДУ &НачПериода И &КонПериода
		                 |";
	ИначеЕсли (ЗначениеЗаполнено(НачПериода)) И (Не ЗначениеЗаполнено(КонПериода)) Тогда
		Условие_Основание = "СчетФактура.Дата >= &НачПериода
		                 |";
	ИначеЕсли (Не ЗначениеЗаполнено(НачПериода)) И (ЗначениеЗаполнено(КонПериода)) Тогда
		Условие_Основание = "СчетФактура.Дата <= &КонПериода
		                 |";
	Иначе
		Условие_Основание = "";
	КонецЕсли;
	
	// Дополняем условие запроса отбором по организации
	Условие_Основание = Условие_Основание 
	               + ?(Не ЗначениеЗаполнено(Организация), "", ?(Не ЗначениеЗаполнено(Условие_Основание), "", " И ") + "Организация = &Организация ");
	
	// Дополняем условие запроса отбором по документу-основанию или списку документов-оснований
	Условие_Основание = Условие_Основание
	               + ?(Не ЗначениеЗаполнено(Фильтр), "", ?(Не ЗначениеЗаполнено(Условие_Основание), "", " И ") + "СчетФактура " + ?(ВсеКромеФильтра, " НЕ ", "") + " В (&Фильтр) ");
	
	// Дополняем условие запроса отбором по признаку наличия/отсутствия счета-фактуры
	УсловиеЗапроса = ?(НаличиеСчетаФактуры = Неопределено, "", ?(Не ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + ?(НаличиеСчетаФактуры, "НЕ (", "(") + "
					|	ВЫБОР
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
					|			ТОГДА НДСПредъявленныйОбороты.СчетФактура
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
					|			ТОГДА СчетФактураПолученный.Ссылка
					|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка, СчетФактураВыданный.Ссылка)
					|	КОНЕЦ ЕСТЬ NULL) ");
	// Дополняем условие запроса отбором по признаку проведения счета-фактуры
	УсловиеЗапроса = УсловиеЗапроса
	               + ?(СчетФактураПроведен = Неопределено, "", ?(Не ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + "
					|	ВЫБОР
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
					|			ТОГДА НДСПредъявленныйОбороты.СчетФактура.Проведен
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
					|			ТОГДА СчетФактураПолученный.Ссылка.Проведен
					|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен, СчетФактураВыданный.Ссылка.Проведен)
					|	КОНЕЦ = " + ?(СчетФактураПроведен, "ИСТИНА", "ЛОЖЬ") + " ");
				   
	// Дополняем условие запроса отбором по дате СФ	
	УсловиеЗапроса = УсловиеЗапроса
	               + ?(Не ЗначениеЗаполнено(ДатаСФНеБолее), "", ?(Не ЗначениеЗаполнено(УсловиеЗапроса), "", " И ") + "
					|	ВЫБОР
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
					|			ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
					|			ТОГДА НДСПредъявленныйОбороты.СчетФактура.Дата
					|		КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
					|			ТОГДА СчетФактураПолученный.Ссылка.Дата
					|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка.Дата, СчетФактураВыданный.Ссылка.Дата)
					|	КОНЕЦ <= &ДатаСФНеБолее ");
	
	// Дополняем условие запроса ключевым словом "ГДЕ"
	УсловиеЗапроса = ?(Не ЗначениеЗаполнено(УсловиеЗапроса), "", "ГДЕ " + УсловиеЗапроса);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(НДСПредъявленныйОбороты.СчетФактура, НЕОПРЕДЕЛЕНО) КАК Документ,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|				ТОГДА СчетФактураПолученный.ДокументОснование
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|				ТОГДА НДСПредъявленныйОбороты.СчетФактура.ДокументОснование
	|			ИНАЧЕ НДСПредъявленныйОбороты.СчетФактура
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК ДокументОснование,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				ТОГДА НДСПредъявленныйОбороты.СчетФактура
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				ТОГДА СчетФактураПолученный.Ссылка
	|			ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка, СчетФактураВыданный.Ссылка)
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК СчетФактура,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				ТОГДА НДСПредъявленныйОбороты.СчетФактура.Проведен
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				ТОГДА СчетФактураПолученный.Ссылка.Проведен
	|			ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен, СчетФактураВыданный.Ссылка.Проведен)
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК СчетФактураПроведен,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ГТДИмпорт
	|					ИЛИ НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				ТОГДА НДСПредъявленныйОбороты.СчетФактура.Дата
	|			КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|				ТОГДА СчетФактураПолученный.Ссылка.Дата
	|			ИНАЧЕ ЕСТЬNULL(СчетФактураПолученный.Ссылка.Дата, СчетФактураВыданный.Ссылка.Дата)
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК СчетФактураДата
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный.Обороты(, , Период, Организация = &Организация) КАК НДСПредъявленныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (ВЫБОР
	|				КОГДА НДСПредъявленныйОбороты.СчетФактура ССЫЛКА Документ.АвансовыйОтчет
	|					ТОГДА СчетФактураПолученный.Ссылка.НаАванс = ИСТИНА
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (НДСПредъявленныйОбороты.СчетФактура = СчетФактураПолученный.ДокументОснование
	|				ИЛИ НДСПредъявленныйОбороты.СчетФактура = СчетФактураПолученный.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ПО (НДСПредъявленныйОбороты.СчетФактура = СчетФактураВыданный.ДокументОснование
	|				ИЛИ НДСПредъявленныйОбороты.СчетФактура = СчетФактураВыданный.Ссылка)
	|			И (СчетФактураВыданный.Ссылка.НаАванс = ЛОЖЬ)";
		
	Запрос.Текст =  Запрос.Текст + УсловиеЗапроса;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Организация = &Организация",Условие_Основание);
	
	Запрос.Текст =  Запрос.Текст + Символы.ПС+ "Упорядочить по НДСПредъявленныйОбороты.СчетФактура.Дата";
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ОпределитьНаличиеСчетовФактурПолученных()

// Определяет дату начала налогового периода для НДС по учетной политике
Функция ПолучитьНачалоПериодаПоУчетнойПолитике(Организация, Дата, Отказ = Ложь, УчетнаяПолитикаНУ = Неопределено) Экспорт
	
	Если УчетнаяПолитикаНУ = неопределено Тогда
		УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	ИначеЕсли не УчетнаяПолитикаНУ.Свойство("НДСНалоговыйПериод") тогда
		 Отказ = Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат ?(Дата >= '20080101', НачалоКвартала(Дата), НачалоМесяца(Дата));
	КонецЕсли;
	
	Если УчетнаяПолитикаНУ.НДСНалоговыйПериод = Перечисления.Периодичность.Квартал Или Дата >= '20080101' Тогда
		Результат = НачалоКвартала(Дата);
	Иначе
		Результат = НачалоМесяца(Дата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет дату окончания налогового периода для НДС по учетной политике
Функция ПолучитьКонецПериодаПоУчетнойПолитике(Организация, Дата, Отказ = Ложь, УчетнаяПолитикаНУ = Неопределено) Экспорт
	
	Если УчетнаяПолитикаНУ = неопределено Тогда
		УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	ИначеЕсли не УчетнаяПолитикаНУ.Свойство("НДСНалоговыйПериод") тогда
		 Отказ = Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат ?(Дата >= '20080101', КонецКвартала(Дата), КонецМесяца(Дата));
	КонецЕсли;
	
	Если УчетнаяПолитикаНУ.НДСНалоговыйПериод = Перечисления.Периодичность.Квартал Или Дата >= '20080101' Тогда
		Результат = КонецКвартала(Дата);
	Иначе
		Результат = КонецМесяца(Дата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция производит поиск документа заданного вида (счета-фактуры), имеющего в табличной части "ДокументыОснования" значение,
// равное переданной ссылке.
//
// Параметры:
//  ДокументСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидСчетаФактуры - строка, вид документа, по умолчанию "СчетФактураВыданный"
//
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено
//
Функция НайтиПодчиненныйДокумент(ДокументСсылка, ВидДокумента = "СчетФактураВыданный", РазрешитьВыборСФНаАванс = Истина, ФлагТолькоПроведенные = Ложь, РазрешитьВыборТолькоСФНаАванс = Ложь, СтавкаНДСсАванса = Неопределено,  ДоговорАванса = Неопределено) Экспорт
	НайденныйДокумент = Неопределено;
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда

		Запрос = Новый Запрос;

		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ различные
		|	Ссылка 
		|ИЗ
		|	Документ." + ВидДокумента + ".ДокументыОснования Как ТЧ_Документов
		|
		|ГДЕ
		|	ТЧ_Документов.ДокументОснование = &ДокументСсылка";
		Если ФлагТолькоПроведенные Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И ТЧ_Документов.Ссылка.Проведен И НЕ ТЧ_Документов.Ссылка.ПометкаУдаления
				|";
		КонецЕсли;
		Если Не РазрешитьВыборСФНаАванс Тогда
			Запрос.Текст = Запрос.Текст + " И Не Ссылка.НаАванс";
		ИначеЕсли ВидДокумента = "СчетФактураВыданный" И РазрешитьВыборСФНаАванс и РазрешитьВыборТолькоСФНаАванс Тогда
			Запрос.Текст = Запрос.Текст + " И Ссылка.НаАванс";
			Если ЗначениеЗаполнено(СтавкаНДСсАванса) Тогда
				Запрос.Текст = Запрос.Текст + " И Ссылка.СтавкаНДС = &СтавкаНДСсАванса";
				Запрос.УстановитьПараметр("СтавкаНДСсАванса", СтавкаНДСсАванса);
			КонецЕсли; 
			Если ЗначениеЗаполнено(ДоговорАванса) Тогда
				Запрос.Текст = Запрос.Текст + " И Ссылка.ДоговорКонтрагента = &ДоговорАванса";
				Запрос.УстановитьПараметр("ДоговорАванса", ДоговорАванса);
			КонецЕсли; 
		КонецЕсли;
		
		// Упорядочивание результатов
		Запрос.Текст = Запрос.Текст + "
			|	Упорядочить По";
		Если не ФлагТолькоПроведенные Тогда
			Запрос.Текст = Запрос.Текст + "
				|	Ссылка.Проведен убыв,
				|	Ссылка.ПометкаУдаления,
				|";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
			|	Ссылка.Дата,Ссылка.Номер
			|";

		Попытка //После обновления платформы не всегда срабатывает запрос 11.10.2017, Юра
		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

		Если ВыборкаИзЗапроса.Следующий() Тогда
			НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;
		Исключение
		КонецПопытки;

	КонецЕсли;

	Возврат НайденныйДокумент;
	
КонецФункции // НайтиПодчиненныйДокумент()

// Функция производит поиск счета-фактуры (полученного или выданного), у которого в качестве документа-основания указана
// переданная ссылка.
//
// Параметры:
//  ДокументСсылка  - ссылка на документ, для которого надо найти подчиненный документ,
//  ВидСчетаФактуры - строка, вид документа, по умолчанию "СчетФактураВыданный"
//  Отбор 			- структура с именами и значениями реквизитов СФ для дополнительного отбора
//	
// Возвращаемое значение:
//  Если нашли, то возвращаем ссылку, не нашли - Неопределено
//
Функция НайтиПодчиненныйСчетФактуру(Знач ДокументСсылка, ВидДокумента = "СчетФактураВыданный", Отбор = Неопределено, ИсключитьИзВыборкиСФ = Неопределено, МетаданныеОснования = Неопределено) Экспорт

	Если не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;
	Иначе
		
		Если МетаданныеОснования = Неопределено Тогда
			МетаданныеОснования = ДокументСсылка.Метаданные();
		КонецЕсли; 
		
		Если МетаданныеОснования.Реквизиты.Найти("ИспользоватьДокументРасчетовКакСчетФактуру") <> Неопределено
			И МетаданныеОснования.Реквизиты.Найти("РасчетныйДокумент") <> Неопределено 
			И ДокументСсылка.ИспользоватьДокументРасчетовКакСчетФактуру Тогда
			Если не ЗначениеЗаполнено(ДокументСсылка.РасчетныйДокумент) Тогда
				Возврат Неопределено;
			Иначе
				Если ТипЗнч(ДокументСсылка.РасчетныйДокумент) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
					И Не ДокументСсылка.РасчетныйДокумент.ПокупателемВыставляетсяСчетФактураНаВозврат Тогда
					ДокументСсылка = ДокументСсылка.РасчетныйДокумент.Сделка;
					МетаданныеОснования = ДокументСсылка.Метаданные();
					Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
						Возврат Неопределено;
					КонецЕсли;
				Иначе
					ДокументСсылка = ДокументСсылка.РасчетныйДокумент;
					МетаданныеОснования = ДокументСсылка.Метаданные();
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
		Если ВидДокумента = "СчетФактураПолученный" 
			И МетаданныеОснования.Реквизиты.Найти("ПредъявленСчетФактура") <> Неопределено 
			И ДокументСсылка.ПредъявленСчетФактура 
			И Не ?(ТипЗнч(ИсключитьИзВыборкиСФ) = Тип("Массив"), ИсключитьИзВыборкиСФ.Найти(ДокументСсылка) <> Неопределено, ДокументСсылка = ИсключитьИзВыборкиСФ)
			Тогда
			Возврат ДокументСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	НайденныйДокумент = Неопределено;

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СФ.Ссылка
	|ПОМЕСТИТЬ ВрмТбл
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ПО СФ.Ссылка = Авансы.Ссылка
	|ГДЕ
	|	СФ.ДокументОснование = &ДокументСсылка";
	
	Если не ВидДокумента = "СчетФактураВыданный" Тогда
		Запрос.Текст = СтрЗаменитЬ(Запрос.Текст,"СчетФактураВыданный",ВидДокумента);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ИсключитьИзВыборкиСФ) Тогда
		Запрос.УстановитьПараметр("ИсключитьИзВыборкиСФ", ИсключитьИзВыборкиСФ);
		Если ТипЗнч(ИсключитьИзВыборкиСФ) = Тип("Массив") Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И НЕ СФ.Ссылка В (&ИсключитьИзВыборкиСФ)
				|";
		Иначе
			Запрос.Текст = Запрос.Текст + "
				|	И НЕ СФ.Ссылка = &ИсключитьИзВыборкиСФ
				|";
		КонецЕсли;
	КонецЕсли; 
	Если не Отбор = Неопределено Тогда
		Для каждого ЭлементОтбора Из Отбор Цикл
			Если ТипЗнч(ЭлементОтбора.Значение) = Тип("Булево") Тогда
			
				Запрос.Текст = Запрос.Текст + "
					|	И "+?(ЭлементОтбора.Значение," "," НЕ ")+" СФ.Ссылка."+ЭлементОтбора.Ключ;
			ИначеЕсли ЭлементОтбора.Ключ = "СтавкиНДС" Тогда
			
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				Запрос.Текст = Запрос.Текст + "
					|	И Авансы.СтавкаНДС В (&"+ЭлементОтбора.Ключ+")";
			ИначеЕсли ЭлементОтбора.Ключ = "СчетНаОплату" 
						И ВидДокумента = "СчетФактураВыданный" Тогда
			
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				Запрос.Текст = Запрос.Текст + "
					|	И Авансы.СчетНаОплату В (&"+ЭлементОтбора.Ключ+")";
			Иначе
				
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				Запрос.Текст = Запрос.Текст + "
					|	И СФ.Ссылка."+ЭлементОтбора.Ключ+" = &"+ЭлементОтбора.Ключ;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст + ";";
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ Ссылка
	| ИЗ ВрмТбл
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.ПометкаУдаления,
	|	Ссылка.Проведен УБЫВ,
	|	Ссылка.Дата";
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	КонецЕсли;

	Возврат НайденныйДокумент;

КонецФункции // НайтиПодчиненныйСчетФактуру()

//Определяет налоговый периода по НДС
//
Функция ПолучитьУПНДСНалоговыйПериод(Организация, Знач Дата, УчетнаяПолитика = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ?(Дата < '20080101', Перечисления.Периодичность.Месяц, Перечисления.Периодичность.Квартал);
	КонецЕсли;
	
	Если УчетнаяПолитика <> Неопределено
		и УчетнаяПолитика.Количество() > 0
		И УчетнаяПолитика.Организация = Организация
		И УчетнаяПолитика.Период = НачалоМесяца(Дата)
		И УчетнаяПолитика.Свойство("НДСНалоговыйПериод") Тогда
		Возврат УчетнаяПолитика.НДСНалоговыйПериод;
	КонецЕсли;
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиНалоговыйУчет(Дата, Неопределено, Организация);
		
	Возврат ?(НЕ ЗначениеЗаполнено(УчетнаяПолитика), 
				?(Дата < '20080101', Перечисления.Периодичность.Месяц, Перечисления.Периодичность.Квартал),
				УчетнаяПолитика.НДСНалоговыйПериод);

КонецФункции

Функция ПолучитьУППорядокРегистрацииСчетовФактурНаАванс(Организация, Знач Дата, УчетнаяПолитика = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.НаВсеАвансы;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	Если УчетнаяПолитика <> Неопределено
		и УчетнаяПолитика.Количество() > 0
		И УчетнаяПолитика.Организация = Организация
		И УчетнаяПолитика.Период = НачалоМесяца(Дата)
		И УчетнаяПолитика.Свойство("ПорядокРегистрацииСчетовФактурНаАванс") Тогда
		Возврат УчетнаяПолитика.ПорядокРегистрацииСчетовФактурНаАванс;
	КонецЕсли;
	
	ОшибкаВПолучении = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, ОшибкаВПолучении, Организация, "Нал" ,Ложь);
		
	Возврат ?(ОшибкаВПолучении, Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.НаВсеАвансы, УчетнаяПолитика.ПорядокРегистрацииСчетовФактурНаАванс);

КонецФункции

//***********************************************************************************************
//Преобразование промежуточных таблиц для НДС

// Преобразует таблицу значений в дерево значений, группируя значения по колонкам, формирование итога по строкам
Функция ТаблицуЗначенийВДеревоСГруппировкой(ТаблицаРезультатов, знач ГруппировочныеКолонки= "",знач КолонкиИтогов = "") Экспорт
	
	ДеревоРезультатов  = Новый ДеревоЗначений();
	Для каждого Колонка из ТаблицаРезультатов.Колонки Цикл
		ДеревоРезультатов.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения,Колонка.Заголовок,Колонка.Ширина);
	КонецЦикла; 
	
	Если ПустаяСтрока(ГруппировочныеКолонки) Тогда
		Для каждого СтрокаТаблицы Из ТаблицаРезультатов Цикл
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();

			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);

		КонецЦикла; 
		
		Возврат ДеревоРезультатов;
	КонецЕсли;
	
	ТаблицаГруппировок = ТаблицаРезультатов.Скопировать();
	ТаблицаГруппировок.Свернуть(ГруппировочныеКолонки,КолонкиИтогов);

	Для каждого СтрокаТаблицы Из ТаблицаГруппировок Цикл
		СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);
		
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ГруппировочныеКолонки) Тогда
		ТаблицаРезультатов.Индексы.Добавить(ГруппировочныеКолонки);
	КонецЕсли;
	
	ЗначенияОтбора = Новый Структура(ГруппировочныеКолонки);
	Для каждого СтрокаДерева из  ДеревоРезультатов.Строки Цикл
		//Формирование структуры отбора
		Для каждого ПараметрОтбора Из ЗначенияОтбора Цикл
			ЗначенияОтбора.Вставить(ПараметрОтбора.Ключ, СтрокаДерева[ПараметрОтбора.Ключ]);
		КонецЦикла; 
		
		//Поиск и заполнение подчиненными колонками
		МассивПодчиненныйхСтрок = ТаблицаРезультатов.НайтиСтроки(ЗначенияОтбора);
		Для каждого СтрокаТаблицы Из МассивПодчиненныйхСтрок Цикл
			ПодчиненнаяСтрокаДерева = СтрокаДерева.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрокаДерева, СтрокаТаблицы);
			
		КонецЦикла; 
	КонецЦикла;
		
	Возврат ДеревоРезультатов;
КонецФункции




Функция ОпределитьПартииСписанияПоРегиструНДСПартии(СтруктураШапкиДокумента, ТаблицаВыручки,Отказ, Заголовок, ЭтоВозврат = Ложь, ЭтоВозвратОтПокупателя = Ложь, СтруктураПараметров) Экспорт
	
	ВидДокумента = "";
	СтруктураШапкиДокумента.Свойство("ВидДокумента",ВидДокумента);
	
	ВестиСуммовойУчетПоСкладамБУ = СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам;
	
	Если не СтруктураШапкиДокумента.Свойство("СложныйУчетНДС") Тогда
		СтруктураПолейУчетнойПолитикиНУ = Новый Структура("СложныйУчетНДС");
		ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал", СтруктураПолейУчетнойПолитикиНУ);
	КонецЕсли; 
	
	ДополнитьПараметрамиПартионногоУчетаНДС(СтруктураШапкиДокумента, Отказ);
	
	ТаблицаСписанияНДСПоСтрокам = РегистрыНакопления.НДСПартииТоваров.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаСписанияНДСПоСтрокам.Колонки.Добавить("ДействияНДСПокупки_ВключитьВСтоимость", Новый ОписаниеТипов("Булево"));
	ТаблицаСписанияНДСПоСтрокам.Колонки.Добавить("ДействияНДСПокупки_ИсключитьИзСтоимости", Новый ОписаниеТипов("Булево"));
	ТаблицаСписанияНДСПоСтрокам.Колонки.Добавить("ДействияНДСПокупки_ПредположениеСтавки0", Новый ОписаниеТипов("Булево"));
	
	Для Каждого Кол Из ТаблицаВыручки.Колонки Цикл
		Если ТаблицаСписанияНДСПоСтрокам.Колонки.Найти(Кол.Имя) = Неопределено Тогда
			ТаблицаСписанияНДСПоСтрокам.Колонки.Добавить(Кол.Имя, Кол.ТипЗначения); 
		КонецЕсли; 
	КонецЦикла;
		
	ТаблицаВыручки.Колонки.Добавить("НДСВСтоимостиТоваров", Новый описаниеТипов("ПеречислениеСсылка.ДействиеНДСВСтоимостиТоваров"));
	
	ЕстьСтавкаНДС = не (ТаблицаВыручки.Колонки.Найти("СтавкаНДС") = неопределено) И Не СтруктураШапкиДокумента.Свойство("НДСВСтоимостиТоваров");
	Если СтруктураШапкиДокумента.Свойство("НДСВСтоимостиТоваров") Тогда
		ТаблицаВыручки.ЗаполнитьЗначения(СтруктураШапкиДокумента.НДСВСтоимостиТоваров,"НДСВСтоимостиТоваров")	
	КонецЕсли; 
	
	//************************************************************************
	// Определяем партии к списанию по регистру по ключевым наборам реквизитов.
	ТаблицаВыручки.Колонки.Добавить("СписыватьПоПартиямНДС", новый описаниеТипов("Булево"));
	ЕстьСкладВТЧ = не (ТаблицаВыручки.Колонки.Найти("Склад") = Неопределено);
	ВыданоСообщениеБезНДС = Ложь;
	ВыданоСообщение0 = Ложь;
	
	Для каждого СтрокаСписания Из ТаблицаВыручки Цикл
		Если СтрокаСписания.Комиссионный Тогда
		//	Для комиссионных товаров учет НДС по партиям не ведется.
			СтрокаСписания.СписыватьПоПартиямНДС = Ложь;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСписания.Количество) Тогда
			// Строки с пустым количеством игнорируем
			СтрокаСписания.СписыватьПоПартиямНДС = Ложь;
			
		ИначеЕсли СтруктураШапкиДокумента.СложныйУчетНДС Тогда
			//Все партии приобретенных ТМЦ учтены в регистре, все надо списывать.
			СтрокаСписания.СписыватьПоПартиямНДС = Истина;

		Иначе 
			 Если ЕстьСтавкаНДС Тогда
			     Если СтрокаСписания.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС и не ВыданоСообщениеБезНДС Тогда
					 ОбщегоНазначения.СообщитьОбОшибке("При реализации без НДС, НДС по приобретенным ценностям необходимо включать в стоимость реализуемой партии товаров (ст. 170 НК РФ).
					 |Для автоматического контроля включения НДС в стоимость в учетной политике по налоговому учету необходимо установить флаг ""Наличие операций без НДС или с НДС 0%""
					 | и выполнить все связанные с этим действия!",ВыданоСообщениеБезНДС ,Заголовок,СтатусСообщения.Информация);
				 ИначеЕсли СтрокаСписания.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 и не ВыданоСообщение0 Тогда
					 ОбщегоНазначения.СообщитьОбОшибке("При реализации с НДС 0%, вычет НДС по приобретенным ценностям возможен только после подтверждения ставки НДС 0% (п.3 ст. 172 НК РФ).
					 |До этого момента вычет должен быть заблокирован.
					 |Для автоматической блокировки вычета НДС в учетной политике по налоговому учету необходимо установить флаг ""Наличие операций без НДС или с НДС 0%""
					 |и выполнить все связанные с этим действия!", ВыданоСообщение0,Заголовок,СтатусСообщения.Информация);
				 КонецЕсли;
			 ИначеЕсли СтрокаСписания.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость
				 или СтрокаСписания.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости
				 тогда
				 Если не ВыданоСообщениеБезНДС Тогда
					 Если ВидДокумента = "СписаниеТоваров" тогда
						 ОбщегоНазначения.СообщитьОбОшибке("При списании ТМЦ в результате инвентаризации на счет 94 <Недостачи и потери от порчи ценностей>,
						 	 | НДС по приобретенным ценностям необходимо включать в стоимость списываемой партии товаров.
						 	 | Для автоматического контроля включения НДС в стоимость в учетной политике по налоговому учету необходимо установить флаг ""Наличие операций без НДС или с НДС 0%""
							 | и выполнить все связанные с этим действия!",ВыданоСообщениеБезНДС ,Заголовок,СтатусСообщения.Информация);
					 Иначе
						 ОбщегоНазначения.СообщитьОбОшибке("Для автоматического контроля включения НДС в стоимость (исключения из стоимости) в учетной политике по налоговому учету необходимо установить флаг ""Наличие операций без НДС или с НДС 0%""
							 | и выполнить все связанные с этим действия!",ВыданоСообщениеБезНДС ,Заголовок,СтатусСообщения.Информация);
					 КонецЕсли; 
				 КонецЕсли; 
			 КонецЕсли;
			
			СтрокаСписания.СписыватьПоПартиямНДС = Ложь;
		КонецЕсли;
		
		Если ЕстьСтавкаНДС Тогда
			Если ЭтоВозврат тогда 
				СтрокаСписания.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;	 
			ИначеЕсли СтрокаСписания.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				СтрокаСписания.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость;
			ИначеЕсли ЗначениеЗаполнено(СтрокаСписания.СтавкаНДС) Тогда
   				СтрокаСписания.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости;
			КонецЕсли; 
		 КонецЕсли;
		 Если ЕстьСкладВТЧ тогда
			 Если НЕ ЗначениеЗаполнено(СтрокаСписания.Склад)  Тогда
				 СтрокаСписания.Склад = справочники.Склады.ПустаяСсылка();
			 КонецЕсли; 
		 КонецЕсли;
	КонецЦикла; 
	
	КолвоЭлементовКоллекции = ТаблицаВыручки.Количество(); 
	
	Для ОбратныйИндекс = 1 По КолвоЭлементовКоллекции Цикл 
		ЭлементКоллекции = ТаблицаВыручки[КолвоЭлементовКоллекции - ОбратныйИндекс]; 
		Если НЕ ЭлементКоллекции.СписыватьПоПартиямНДС Тогда 
			ТаблицаВыручки.Удалить(ЭлементКоллекции); 
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ТаблицаВыручки.Колонки.Найти("Склад") = Неопределено Тогда
	    ТаблицаВыручки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	КонецЕсли; 
	
	
	Если ТаблицаВыручки.Количество() = 0 Тогда
		//Возвращаем пустую таблицу списаний. Все прошло удачно, но движения по партиям не требуются.
		Возврат ТаблицаСписанияНДСПоСтрокам;
	КонецЕсли; 

	Запрос = Новый Запрос;
	
	ЕстьОтборПоСкладу = СтруктураШапкиДокумента.ПартионныйУчетНДСВРазрезеСкладов И Не СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
	Если не ЭтоВозвратОтПокупателя Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПартииТоваровОстатки.Склад КАК Склад,
		|	НДСПартииТоваровОстатки.Номенклатура КАК Номенклатура,
		|	НДСПартииТоваровОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НДСПартииТоваровОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	НДСПартииТоваровОстатки.Партия.Дата КАК ДатаПартии,
		|	НДСПартииТоваровОстатки.Партия КАК Партия,
		|	НДСПартииТоваровОстатки.СчетФактура.Дата КАК ДатаСФ,
		|	НДСПартииТоваровОстатки.СчетФактура КАК СчетФактура,
		|	НДСПартииТоваровОстатки.НДСВключенВСтоимость,
		|	НДСПартииТоваровОстатки.КоличествоОстаток,
		|	НДСПартииТоваровОстатки.СтоимостьОстаток,
		|	ВЫБОР
		|		КОГДА НДСПартииТоваровОстатки.КоличествоОстаток > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьКоличество,
		|	НДСПартииТоваровОстатки.ВидЦенности,
		|	НДСПартииТоваровОстатки.СтавкаНДС,
		|	НДСПартииТоваровОстатки.НДСОстаток
		|ИЗ
		|	РегистрНакопления.НДСПартииТоваров.Остатки(
		|			&МоментСписания,
		|			Организация = &Организация
		|				И Номенклатура В (&СписокНоменклатуры)
		|				И ВЫБОР
		|					КОГДА &ЕстьОтборПоСкладу = ИСТИНА
		|						ТОГДА Склад В (&СписокСкладов)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ЭтоВозврат  = ИСТИНА
		|						ТОГДА Партия.Контрагент = &Поставщик
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК НДСПартииТоваровОстатки
		|ГДЕ
		|	(НЕ НДСПартииТоваровОстатки.СтоимостьОстаток < 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПартии,
		|	ДатаСФ";
		
		Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
		Запрос.УстановитьПараметр("ЕстьОтборПоСкладу", ЕстьОтборПоСкладу);
		Запрос.УстановитьПараметр("Поставщик", ?(ЭтоВозврат, СтруктураШапкиДокумента.Контрагент, Неопределено));
		
		Если ЭтоВозврат Тогда
			// Дополняет фильтр конкретным поставщиком
			//Запрос.Текст = СтрЗаменить(Запрос.Текст,"Номенклатура В (&СписокНоменклатуры)","Номенклатура В (&СписокНоменклатуры) " +символы.ПС+
			//										"И Партия.Контрагент = &Поставщик");
			// Дополняет фильтр конкретным документом партии
			ПартионныйУчетБУ = ложь;
		КонецЕсли; 
	Иначе
		
		СписокДокументовРеализации = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаВыручки.ВыгрузитьКолонку("ДокументПартии"),Истина);
		СписокДокументовПартий  = Новый массив;
		
		//Разделим документы на поступление и реализацию
		Для ИндексДокумента = 0 По СписокДокументовРеализации.Количество()-1 Цикл
			
			Если НЕ ЗначениеЗаполнено(СписокДокументовРеализации[ИндексДокумента]) Тогда
				СписокДокументовРеализации[ИндексДокумента] = Неопределено;
			Иначе
				ТипДокументаПартии = ТипЗнч(СписокДокументовРеализации[ИндексДокумента]);
				Если ТипДокументаПартии =  Тип("ДокументСсылка.РеализацияТоваровУслуг") 
					или ТипДокументаПартии =  Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС")
					или ТипДокументаПартии =  Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
					или ТипДокументаПартии =  Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
					тогда
					
				Иначе
					СписокДокументовПартий.Добавить(СписокДокументовРеализации[ИндексДокумента]);
					СписокДокументовРеализации[ИндексДокумента] = Неопределено;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
		
		СписокДокументовРеализации = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(СписокДокументовРеализации,Истина);
		
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("СписокДокументовРеализации", СписокДокументовРеализации);
		Запрос.УстановитьПараметр("СписокДокументовПартий", СписокДокументовПартий);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПартииТоваров.Склад КАК Склад,
		|	НДСПартииТоваров.Номенклатура КАК Номенклатура,
		|	НДСПартииТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НДСПартииТоваров.СерияНоменклатуры КАК СерияНоменклатуры,
		|	НДСПартииТоваров.Партия.Дата КАК ДатаПартии,
		|	НДСПартииТоваров.Партия КАК Партия,
		|	НДСПартииТоваров.СчетФактура.Дата КАК ДатаСФ,
		|	НДСПартииТоваров.СчетФактура КАК СчетФактура,
		|	НДСПартииТоваров.НДСВключенВСтоимость,
		|	НДСПартииТоваров.Количество КАК КоличествоОстаток,
		|	НДСПартииТоваров.Стоимость КАК СтоимостьОстаток,
		|	ВЫБОР
		|		КОГДА НДСПартииТоваров.Количество > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьКоличество,
		|	НДСПартииТоваров.ВидЦенности,
		|	НДСПартииТоваров.СтавкаНДС,
		|	НДСПартииТоваров.НДС КАК НДСОстаток,
		|	НДСПартииТоваров.Регистратор КАК ДокументРеализации
		|ИЗ
		|	РегистрНакопления.НДСПартииТоваров КАК НДСПартииТоваров
		|ГДЕ
		|	НДСПартииТоваров.Регистратор В(&СписокДокументовРеализации)
		|	И НДСПартииТоваров.Номенклатура В(&СписокНоменклатуры)
		|	И НДСПартииТоваров.ВидДвижения = &ВидДвиженияРасход
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НДСПартииТоваровОбороты.Склад,
		|	НДСПартииТоваровОбороты.Номенклатура,
		|	НДСПартииТоваровОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	НДСПартииТоваровОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		|	НДСПартииТоваровОбороты.Партия.Дата,
		|	НДСПартииТоваровОбороты.Партия,
		|	НДСПартииТоваровОбороты.СчетФактура.Дата,
		|	НДСПартииТоваровОбороты.СчетФактура,
		|	НДСПартииТоваровОбороты.НДСВключенВСтоимость,
		|	НДСПартииТоваровОбороты.КоличествоРасход,
		|	НДСПартииТоваровОбороты.СтоимостьРасход,
		|	ВЫБОР
		|		КОГДА НДСПартииТоваровОбороты.КоличествоРасход > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	НДСПартииТоваровОбороты.ВидЦенности,
		|	НДСПартииТоваровОбороты.СтавкаНДС,
		|	НДСПартииТоваровОбороты.НДСРасход,
		|	НДСПартииТоваровОбороты.Партия
		|ИЗ
		|	РегистрНакопления.НДСПартииТоваров.Обороты КАК НДСПартииТоваровОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НДСПартииТоваровОбороты.Партия КАК Партия
		|		ИЗ
		|			РегистрНакопления.НДСПартииТоваров.Обороты(
		|				,
		|				&МоментСписания,
		|				Период,
		|				Организация = &Организация
		|					И Номенклатура В (&СписокНоменклатуры)
		|					И Партия В (&СписокДокументовПартий)) КАК НДСПартииТоваровОбороты
		|		ГДЕ
		|			НДСПартииТоваровОбороты.КоличествоРасход > 0) КАК СписанныеПартии
		|		ПО НДСПартииТоваровОбороты.Партия = СписанныеПартии.Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПартии УБЫВ,
		|	ДатаСФ УБЫВ";
			
	КонецЕсли; 

	Запрос.УстановитьПараметр("МоментСписания", 		Новый Граница(СтруктураШапкиДокумента.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", 			СтруктураШапкидокумента.Организация);
	
	Запрос.УстановитьПараметр("СписокСкладов", 			ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаВыручки.выгрузитьКолонку("Склад")));
	Запрос.УстановитьПараметр("СписокНоменклатуры", 	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаВыручки.выгрузитьКолонку("Номенклатура")));
	
	ТаблицаПартий = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаКСписанию Из ТаблицаВыручки Цикл
		
		//Установим отбор таблицы запроса
		Отбор = Новый Структура("Номенклатура, ЕстьКоличество", СтрокаКСписанию.Номенклатура, Истина);
		Если ЕстьОтборПоСкладу и Не ЭтоВозвратОтПокупателя Тогда
			Отбор.Вставить("Склад", СтрокаКСписанию.Склад);
		КонецЕсли;
		Если СтруктураШапкиДокумента.ПартионныйУчетНДСвРазрезеСерийИХарактеристик Тогда
			Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаКСписанию.ХарактеристикаНоменклатуры);
			Если СтрокаКСписанию.Номенклатура.ВестиПартионныйУчетПоСериям Тогда
				Отбор.Вставить("СерияНоменклатуры", СтрокаКСписанию.СерияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоВозвратОтПокупателя Тогда
			Отбор.Вставить("ДокументРеализации", СтрокаКСписанию.ДокументПартии);
		ИначеЕсли ЭтоВозврат и ЗначениеЗаполнено(СтрокаКСписанию.ДокументПартии) тогда
			Отбор.Вставить("Партия", СтрокаКСписанию.ДокументПартии);
		КонецЕсли;
		
		ОтборТаблицыПартийПоКлючу = ТаблицаПартий.НайтиСтроки(Отбор);
		СписатьПоКлючу = СтрокаКСписанию.Количество;
		
		// Найденные строки перенесем в таблицу значений, которую нужно отсортировать в соответствии со стратегией списания
		ТаблицаОстатки  = Новый ТаблицаЗначений;
		// Добавим колонку с индексом
		ТаблицаОстатки.Колонки.Добавить("ИндексНайденнойСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
		
		Для Каждого Кол Из ТаблицаПартий.Колонки Цикл
			ТаблицаОстатки.Колонки.Добавить(Кол.Имя, Кол.ТипЗначения);
		КонецЦикла;
		Индекс = 0;
		Для Каждого СтрокаТЧ Из ОтборТаблицыПартийПоКлючу Цикл
			НоваяСтрока = ТаблицаОстатки.Добавить();
			НоваяСтрока.ИндексНайденнойСтроки = Индекс;
			Для Каждого Колонка Из ТаблицаПартий.Колонки Цикл
				Если ПустаяСтрока(Колонка.Имя) ИЛИ Колонка.Имя = "QuieryId" Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока[Колонка.Имя] = СтрокаТЧ[Колонка.Имя];
			КонецЦикла;
			Индекс = Индекс + 1;
		КонецЦикла;
		
		НаправлениеСортировкиДляНДС = ?(СтрокаКСписанию.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость, "Убыв", "Возр");
		НаправлениеСортировкиПартий = ?(ЭтоВозврат,"убыв","Возр");
		ТаблицаОстатки.Сортировать("ДатаПартии "+НаправлениеСортировкиПартий+", Партия "+НаправлениеСортировкиПартий+", ДатаСФ "+НаправлениеСортировкиПартий+", СчетФактура "+НаправлениеСортировкиПартий+", НДСВключенВСтоимость "+НаправлениеСортировкиДляНДС);
		
		ТаблицаСписанияПоСтроке = Новый ТаблицаЗначений;
		ТаблицаСписанияПоСтроке.Колонки.Добавить("Партия");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("ДействияНДСПокупки_ВключитьВСтоимость");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("ДействияНДСПокупки_ИсключитьИзСтоимости");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("ДействияНДСПокупки_ПредположениеСтавки0");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("НДСВключенВСтоимость");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("ВидЦенности");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("СтавкаНДС");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("СчетФактура");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
		ТаблицаСписанияПоСтроке.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСписанияПоСтроке.Колонки.Добавить("НДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСписанияПоСтроке.Колонки.Добавить("Склад");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("СерияНоменклатуры");
		ТаблицаСписанияПоСтроке.Колонки.Добавить("ХарактеристикаНоменклатуры");
		
		Для каждого СтрокаТаблицыПартийНДС Из ТаблицаОстатки Цикл
			
			Если НЕ СтрокаТаблицыПартийНДС.ЕстьКоличество Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицыПартийНДС.КоличествоОстаток=0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаТаблицыСписания 						= ТаблицаСписанияПоСтроке.Добавить();
			СтрокаТаблицыСписания.Партия 				= СтрокаТаблицыПартийНДС.Партия;
			СтрокаТаблицыСписания.СчетФактура 			= СтрокаТаблицыПартийНДС.СчетФактура;
			СтрокаТаблицыСписания.Количество 			= Мин(СписатьПоКлючу, СтрокаТаблицыПартийНДС.КоличествоОстаток);
			СтрокаТаблицыСписания.Стоимость 			= ?(СтрокаТаблицыПартийНДС.КоличествоОстаток = 0, 0, СтрокаТаблицыПартийНДС.СтоимостьОстаток * СтрокаТаблицыСписания.Количество / СтрокаТаблицыПартийНДС.КоличествоОстаток) ;
			СтрокаТаблицыСписания.НДС 					= ?(СтрокаТаблицыПартийНДС.КоличествоОстаток = 0, 0, СтрокаТаблицыПартийНДС.НДСОстаток * СтрокаТаблицыСписания.Количество / СтрокаТаблицыПартийНДС.КоличествоОстаток) ;
			
			СтрокаТаблицыСписания.ВидЦенности 			= СтрокаТаблицыПартийНДС.ВидЦенности;
			СтрокаТаблицыСписания.НДСВключенВСтоимость 	= СтрокаТаблицыПартийНДС.НДСВключенВСтоимость;
			СтрокаТаблицыСписания.СтавкаНДС				= СтрокаТаблицыПартийНДС.СтавкаНДС;
			Если ЭтоВозвратОтПокупателя И Не СтруктураШапкиДокумента.ПартионныйУчетНДСВРазрезеСкладов 
				Тогда
			    СтрокаТаблицыСписания.Склад 			= Справочники.Склады.ПустаяСсылка();
			Иначе
				СтрокаТаблицыСписания.Склад				= СтрокаТаблицыПартийНДС.Склад;	
			КонецЕсли; 
				Если СтруктураШапкиДокумента.ПартионныйУчетНДСвРазрезеСерийИХарактеристик Тогда
					СтрокаТаблицыСписания.ХарактеристикаНоменклатуры = СтрокаТаблицыПартийНДС.ХарактеристикаНоменклатуры;
					Если СтрокаТаблицыПартийНДС.Номенклатура.ВестиПартионныйУчетПоСериям Тогда
						СтрокаТаблицыСписания.СерияНоменклатуры = СтрокаТаблицыПартийНДС.СерияНоменклатуры;
					КонецЕсли;
				КонецЕсли;
			
			Если (СтрокаКСписанию.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость) И (НЕ СтрокаТаблицыПартийНДС.НДСВключенВСтоимость) Тогда
				СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Истина;
				СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Ложь;
			ИначеЕсли (СтрокаКСписанию.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости) И (СтрокаТаблицыПартийНДС.НДСВключенВСтоимость) Тогда
				СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Ложь;
				СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Истина;
			Иначе
				СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Ложь;
				СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Ложь;
			КонецЕсли;
			
			СтрокаТаблицыСписания.ДействияНДСПокупки_ПредположениеСтавки0 = Ложь;
			
			Если ЕстьСтавкаНДС  и не ЭтоВозврат Тогда
				Если СтрокаКСписанию.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
					СтрокаТаблицыСписания.ДействияНДСПокупки_ПредположениеСтавки0 = Истина;
				КонецЕсли;
			КонецЕсли;
						
			СписатьПоКлючу = СписатьПоКлючу - СтрокаТаблицыСписания.Количество;
			
			СтрокаТаблицыПартийНДС.КоличествоОстаток = СтрокаТаблицыПартийНДС.КоличествоОстаток - СтрокаТаблицыСписания.Количество;
			СтрокаТаблицыПартийНДС.СтоимостьОстаток = СтрокаТаблицыПартийНДС.СтоимостьОстаток - СтрокаТаблицыСписания.Стоимость;
			СтрокаТаблицыПартийНДС.НДСОстаток = СтрокаТаблицыПартийНДС.НДСОстаток - СтрокаТаблицыСписания.НДС;
			
			Если СписатьПоКлючу<=0 Тогда
				прервать;
			КонецЕсли; 
			
		КонецЦикла;
		
		//Распределение доп. расходов
		ПартииКСписнию = ТаблицаСписанияПоСтроке.Скопировать();
		ПартииКСписнию.Свернуть("Партия", "Количество, Стоимость");
		
		Для Каждого Партия Из ПартииКСписнию Цикл
			//Установим отбор таблицы запроса
			Отбор = Новый Структура("Номенклатура, Партия", СтрокаКСписанию.Номенклатура, Партия.Партия);
			Если ЕстьОтборПоСкладу Тогда
				Отбор.Вставить("Склад", СтрокаКСписанию.Склад);
			КонецЕсли;
			Если СтруктураШапкиДокумента.ПартионныйУчетНДСвРазрезеСерийИХарактеристик Тогда
				Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаКСписанию.ХарактеристикаНоменклатуры);
				Если СтрокаКСписанию.Номенклатура.ВестиПартионныйУчетПоСериям Тогда
					Отбор.Вставить("СерияНоменклатуры", СтрокаКСписанию.СерияНоменклатуры);
				КонецЕсли;
			КонецЕсли;

			ОтборДляДопРасходов = ТаблицаПартий.НайтиСтроки(Отбор);
			
			//Определим коэффициент доп. расходов
			СуммаПоПартии = 0;
			Для Каждого СтрокаПартии Из ОтборДляДопРасходов Цикл
				Если СтрокаПартии.ЕстьКоличество Тогда
					СуммаПоПартии = СуммаПоПартии + СтрокаПартии.СтоимостьОстаток;
				КонецЕсли;
			КонецЦикла;
			
			// Если в партии нулевая сумма, то списание доп. расходов производим пропорционально количеству.
			Если СуммаПоПартии = 0 Тогда
				КоличествоПоПартии = 0;
				Для Каждого СтрокаПартии Из ОтборДляДопРасходов Цикл
					Если СтрокаПартии.ЕстьКоличество Тогда
						КоличествоПоПартии = КоличествоПоПартии + СтрокаПартии.КоличествоОстаток;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Проверим наличие доп расходов
			Если СуммаПоПартии = 0 И КоличествоПоПартии = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СуммаПоПартии <> 0 Тогда
				К = Партия.Стоимость / СуммаПоПартии;
			Иначе
				К = Партия.Количество / КоличествоПоПартии;
			КонецЕсли;
			
			//Спишем доп. расходы
			Для Каждого СтрокаПартии Из ОтборДляДопРасходов Цикл
				
				Если СтрокаПартии.ЕстьКоличество ИЛИ Окр(СтрокаПартии.СтоимостьОстаток*К,2,1) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаТаблицыСписания = ТаблицаСписанияПоСтроке.Добавить();
				СтрокаТаблицыСписания.Партия = СтрокаПартии.Партия;
				СтрокаТаблицыСписания.СчетФактура = СтрокаПартии.СчетФактура;
				СтрокаТаблицыСписания.Стоимость = СтрокаПартии.СтоимостьОстаток * К;
				СтрокаТаблицыСписания.НДС = СтрокаПартии.НДСОстаток * К;
					
				Если ЭтоВозвратОтПокупателя И Не СтруктураШапкиДокумента.ПартионныйУчетНДСВРазрезеСкладов 
					Тогда
				    СтрокаТаблицыСписания.Склад = Справочники.Склады.ПустаяСсылка();
				Иначе
					СтрокаТаблицыСписания.Склад					= СтрокаПартии.Склад;	
				КонецЕсли; 
				Если СтруктураШапкиДокумента.ПартионныйУчетНДСвРазрезеСерийИХарактеристик Тогда
					СтрокаТаблицыСписания.ХарактеристикаНоменклатуры = СтрокаПартии.ХарактеристикаНоменклатуры;
					Если СтрокаТаблицыПартийНДС.Номенклатура.ВестиПартионныйУчетПоСериям Тогда
						СтрокаТаблицыСписания.СерияНоменклатуры = СтрокаПартии.СерияНоменклатуры;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаТаблицыСписания.ВидЦенности = СтрокаПартии.ВидЦенности;
				СтрокаТаблицыСписания.НДСВключенВСтоимость = СтрокаПартии.НДСВключенВСтоимость;
				СтрокаТаблицыСписания.СтавкаНДС				= СтрокаПартии.СтавкаНДС;
			
				Если (СтрокаКСписанию.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость) И (НЕ СтрокаПартии.НДСВключенВСтоимость) Тогда
					СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Истина;
					СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Ложь;
				ИначеЕсли (СтрокаКСписанию.НДСВСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ИсключитьИзСтоимости) И (СтрокаПартии.НДСВключенВСтоимость) Тогда
					СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Ложь;
					СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Истина;
				Иначе
					СтрокаТаблицыСписания.ДействияНДСПокупки_ВключитьВСтоимость = Ложь;
					СтрокаТаблицыСписания.ДействияНДСПокупки_ИсключитьИзСтоимости = Ложь;
				КонецЕсли;
				
				СтрокаТаблицыСписания.ДействияНДСПокупки_ПредположениеСтавки0 = Ложь;
				
				Если ЕстьСтавкаНДС и не ЭтоВозврат Тогда
					Если СтрокаКСписанию.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
						СтрокаТаблицыСписания.ДействияНДСПокупки_ПредположениеСтавки0 = Истина;
					КонецЕсли;
				КонецЕсли;
			    				
				СтрокаПартии.СтоимостьОстаток = СтрокаПартии.СтоимостьОстаток - СтрокаТаблицыСписания.Стоимость;
				СтрокаПартии.НДСОстаток = СтрокаПартии.НДСОстаток - СтрокаТаблицыСписания.НДС;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//Перенесем данные в итоговую таблицу движений
		Для Каждого СтрокаСписания ИЗ ТаблицаСписанияПоСтроке Цикл
			
			СтрокаТаблицыСписанияНДС = ТаблицаСписанияНДСПоСтрокам.Добавить();
			
			Для Каждого Кол Из ТаблицаСписанияНДСПоСтрокам.Колонки Цикл
				Если НЕ ТаблицаСписанияПоСтроке.Колонки.Найти(Кол.Имя) = Неопределено Тогда
					СтрокаТаблицыСписанияНДС[Кол.Имя] = СтрокаСписания[Кол.Имя];
				ИначеЕсли НЕ ТаблицаВыручки.Колонки.Найти(Кол.Имя) = Неопределено Тогда 
					СтрокаТаблицыСписанияНДС[Кол.Имя] = СтрокаКСписанию[Кол.Имя];
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Таблицу значений перенесем в найденные строки
		Для Каждого СтрокаТЧ Из ТаблицаОстатки Цикл
			Для Каждого Колонка Из ТаблицаПартий.Колонки Цикл
				Если ПустаяСтрока(Колонка.Имя) ИЛИ Колонка.Имя = "QuieryId" Тогда
					Продолжить;
				КонецЕсли; 
				ОтборТаблицыПартийПоКлючу[СтрокаТЧ.ИндексНайденнойСтроки][Колонка.Имя] = СтрокаТЧ[Колонка.Имя];
			КонецЦикла;
		КонецЦикла;
		
		Если СписатьПоКлючу>0 тогда
			ТекстСообщения = "Для целей учета НДС не списано " + Формат(СписатьПоКлючу, "ЧЦ=15; ЧДЦ=3") + " товара " + СтрокаКСписанию.Номенклатура + ?(НЕ ЗначениеЗаполнено(СтрокаКСписанию.Склад),"",", склад "+строка(СтрокаКСписанию.Склад));
			Если СтруктураШапкиДокумента.ПартионныйУчетНДСвРазрезеСерийИХарактеристик Тогда 
				Если ЗначениеЗаполнено(СтрокаКСписанию.ХарактеристикаНоменклатуры) Тогда
					ТекстСообщения = ТекстСообщения + ", х-ка: " + СтрокаКСписанию.ХарактеристикаНоменклатуры;
				КонецЕсли;
				Если СтрокаКСписанию.Номенклатура.ВестиПартионныйУчетПоСериям И ЗначениеЗаполнено(СтрокаКСписанию.СерияНоменклатуры) Тогда
					ТекстСообщения = ТекстСообщения + ", серия: " + СтрокаКСписанию.СерияНоменклатуры;
				КонецЕсли;
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, ,Заголовок);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаСписанияНДСПоСтрокам.ЗаполнитьЗначения(СтруктураШапкиДокумента.Организация,"Организация"); 
	Если ТаблицаСписанияНДСПоСтрокам.Колонки.Найти("QuieryId") = Неопределено Тогда
		ТаблицаСписанияНДСПоСтрокам.Колонки.Добавить("QuieryId");
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("СоответствиеКодовОперацийСтрокамНДСПартий", Новый Соответствие);

	QuieryId = 0;
	
	Для каждого СтрокаСписания Из ТаблицаСписанияНДСПоСтрокам Цикл
		QuieryId = QuieryId + 1;
		СтрокаСписания.QuieryId = QuieryId;
		
		// Для ускорения поиска добавим строку в соответствие
		МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаСписания.КодОперацииПартииТоваров];
		Если МассивСтрокПоКоду = Неопределено Тогда
			СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий.Вставить(СтрокаСписания.КодОперацииПартииТоваров, Новый Массив);
			МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаСписания.КодОперацииПартииТоваров];
		КонецЕсли;
		МассивСтрокПоКоду.Добавить(СтрокаСписания);
		
	КонецЦикла;
	
	Возврат ТаблицаСписанияНДСПоСтрокам;
	
КонецФункции



//***********************************************************************************************
//  РЕГИСТРАЦИЯ ОПЛАТ В ПОДСИСТЕМЕ НДС

//Преименование колонок таблицы значений по данным соответствия
Процедура ПереименованиеКолонок(ТаблицаЗначений, СоответствиеНазваний, Обратное = Ложь, СообщатьОбОшибке = Истина) Экспорт
	
	Колонки = ТаблицаЗначений.Колонки;
	
	Для каждого Колонка Из СоответствиеНазваний Цикл
		Если Обратное Тогда
			СтароеНазвание = Колонка.Значение;
			НовоеНазвание =  Колонка.Ключ;
		Иначе
			СтароеНазвание = Колонка.Ключ;
			НовоеНазвание =  Колонка.Значение;
		КонецЕсли;
		Если Колонки.Найти(СтароеНазвание) = неопределено тогда
			Если СообщатьОбОшибке Тогда
			    ОбщегоНазначения.СообщитьОбОшибке("При переименовании колонок таблицы не обнаружена колонка с именем """+СтароеНазвание+"""! Переименование колонки не произведено.");
			КонецЕсли; 
		ИначеЕсли не Колонки.Найти(НовоеНазвание) = неопределено тогда
			Если СообщатьОбОшибке Тогда
			    ОбщегоНазначения.СообщитьОбОшибке("При переименовании колонок таблицы обнаружена колонка с именем """+НовоеНазвание+""", переименование существующей колонки """+СтароеНазвание+""" невозможно! Переименование колонки не произведено.");
			КонецЕсли; 
		Иначе
			Колонки[СтароеНазвание].Имя = НовоеНазвание;
		КонецЕсли;
	КонецЦикла; 
	

КонецПроцедуры

// Подготовка сокращенной структуры шапки для регистрации движений денежных средств по НДС
Функция СформироватьСокращеннуюСтруктуруШапкиДокументаДляДвиженияДенег(Ссылка, ВалютаРегламентированногоУчета, Отказ = Ложь) Экспорт
	
	МетаданныеДокумента = Ссылка.Метаданные();
	
	ВидДокумента = МетаданныеДокумента.Имя;
	СтруктураПараметров = Новый Структура("Дата, Организация,ОтражатьВБухгалтерскомУчете,ОтражатьВНалоговомУчете,ДатаОплаты,Дата,ВидОперации
										  |, ВалютаДокумента, КурсДокумента, КратностьДокумента
										  |,"+?(ВидДокумента="АвансовыйОтчет","ФизЛицо","Контрагент"));
	 
	Если БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(ВидДокумента).Направление = Неопределено тогда
		//Документ не обрабатывается в блоке расчета с контрагентами по регламентированному учету
		Отказ = Истина;
		Возврат СтруктураПараметров;
	Конецесли;
	
	//Получение реквизитов шапки
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Ссылка, Дата ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Для Каждого Реквизит из СтруктураПараметров Цикл
		Если не МетаданныеДокумента.Реквизиты.Найти(Реквизит.Ключ) = Неопределено Тогда
		    Запрос.Текст =  Запрос.Текст + ", "+Реквизит.Ключ;
		КонецЕсли; 
	КонецЦикла;
	 
	Запрос.Текст = Запрос.Текст+ " из Документ."+ВидДокумента+" как Док где Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров,Выборка); 
	КонецЕсли;
	
	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	
	Если СтруктураПараметров.КурсДокумента = Неопределено Тогда
		СтруктураПараметров.Вставить("КурсДокумента",1);
	КонецЕсли; 
	Если СтруктураПараметров.КратностьДокумента = Неопределено Тогда
		СтруктураПараметров.Вставить("КратностьДокумента",1);
	КонецЕсли; 
	
	// Дополнение данными, не содержащимися в структуре шапки документа
	ВидОперацииСтр = "";
	Если не СтруктураПараметров.ВидОперации = неопределено Тогда
		ВидОперацииСтр = " (" + СтруктураПараметров.ВидОперации + ")";
	КонецЕсли;
	Заголовок = "Проведение документа: " + СокрЛП(Ссылка) + ВидОперацииСтр;
	СтруктураПараметров.Вставить("Заголовок",Заголовок);
	
	СтруктураПараметров.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	СтруктураПараметров.Вставить("ВидДокумента",ВидДокумента);
	СтруктураПараметров.Вставить("Регистратор",Ссылка);
	СтруктураПараметров.Вставить("Ссылка",Ссылка);
	СтруктураПараметров.Вставить("ВидДвиженияПоРасчетам","Оплата");
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров["ДатаОплаты"]) тогда
		СтруктураПараметров.Вставить("Период",СтруктураПараметров.Дата);
	Иначе
		СтруктураПараметров.Вставить("Период",КонецДня(СтруктураПараметров.ДатаОплаты));
	Конецесли;
	
	НаправлениеДвиженияДенежныхСредств = БухгалтерскийУчетРасчетовСКонтрагентами.ОпределениеНаправленияДвиженияДляДокументаДвиженияДенежныхСредств(СтруктураПараметров.ВидДокумента,СтруктураПараметров.ВидОперации); 
	
	СтруктураПараметров.Вставить("НаправлениеДвижения",НаправлениеДвиженияДенежныхСредств.Направление);
	Если НаправлениеДвиженияДенежныхСредств.РасчетыВозврат=Неопределено тогда
		// Установим вид расчетов по умолчанию
		СтруктураПараметров.Вставить("РасчетыВозврат", Перечисления.РасчетыВозврат.Расчеты);
	Иначе
		СтруктураПараметров.Вставить("РасчетыВозврат", НаправлениеДвиженияДенежныхСредств.РасчетыВозврат);
	КонецЕсли;
	
	ДанныеОВалюте = МодульВалютногоУчета.ПолучитьКурсВалюты(СтруктураПараметров.ВалютаРегламентированногоУчета, СтруктураПараметров.Период);
	СтруктураПараметров.Вставить("КурсВалютыРегламентированногоУчета", ?(ДанныеОВалюте.Курс = 0, 1,ДанныеОВалюте.Курс));
	СтруктураПараметров.Вставить("КратностьВалютыРегламентированногоУчета", ?(ДанныеОВалюте.Кратность = 0, 1,ДанныеОВалюте.Кратность));
	//Зачистка промежуточных данных
	СтруктураПараметров.Удалить("ДатаОплаты");

	Возврат СтруктураПараметров;
	
 КонецФункции // СформироватьСокращеннуюСтруктуруШапкиДокументаДляДвиженияДенег()

// Подготовка таблицу документа оплаты для регистрации движений денежных средств по НДС
Процедура ПодготовитьТаблицуОплатДляДвиженияДенег(СтруктураПараметров) Экспорт
	
	ВВалюте = (Не СтруктураПараметров.ВалютаДокумента = СтруктураПараметров.ВалютаРегламентированногоУчета);
	
	//Получение данных таблицы расшифровки платежа
	// Выгрузка нужных колонок табличной части в таблицу значений с переименованием названий счетов
	СтруктураТаблицы = Новый Структура();
	Если СтруктураПараметров.ВидДокумента="АвансовыйОтчет" Тогда
		СтруктураТаблицы.Вставить("Контрагент"			, "Контрагент");
		СтруктураТаблицы.Вставить("СуммаСНДС"			, "Сумма");
		СтруктураТаблицы.Вставить("РублеваяСумма"		, "Сумма");
	Иначе	
		СтруктураТаблицы.Вставить("Контрагент"			, "ДоговорКонтрагента.Владелец");
		СтруктураТаблицы.Вставить("СуммаСНДС"			, "СуммаПлатежа");
		СтруктураТаблицы.Вставить("РублеваяСумма"		, "СуммаПлатежа");
	КонецЕсли;
	
	Если ВВалюте Тогда
		СтруктураТаблицы.Вставить("РублеваяСумма"		, "СуммаВзаиморасчетов");
	КонецЕсли; 
	
	СтруктураТаблицы.Вставить("ВалютнаяСумма"			, "СуммаВзаиморасчетов");

	СтруктураТаблицы.Вставить("СуммаВзаиморасчетов"		, "СуммаВзаиморасчетов");
	
	СтруктураТаблицы.Вставить("ДоговорКонтрагента"		, "ДоговорКонтрагента");
	СтруктураТаблицы.Вставить("КурсВзаиморасчетов"		, "КурсВзаиморасчетов");
	СтруктураТаблицы.Вставить("КратностьВзаиморасчетов"	, "КратностьВзаиморасчетов");
	СтруктураТаблицы.Вставить("ВидДоговора"				, "ДоговорКонтрагента.ВидДоговора");
	СтруктураТаблицы.Вставить("ВалютаВзаиморасчетов"	, "ДоговорКонтрагента.ВалютаВзаиморасчетов");
	СтруктураТаблицы.Вставить("РасчетыВУсловныхЕдиницах", "ДоговорКонтрагента.РасчетыВУсловныхЕдиницах");
	СтруктураТаблицы.Вставить("ВедениеВзаиморасчетов"	, "ДоговорКонтрагента.ВедениеВзаиморасчетов");
	СтруктураТаблицы.Вставить("ВестиПоДокументамРасчетовСКонтрагентом"	, "ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом");
	
	СтруктураТаблицы.Вставить("Сделка"					, "Сделка");
	СтруктураТаблицы.Вставить("ДокументРасчетовСКонтрагентом", "ДокументРасчетовСКонтрагентом");
	                          
	
	ИмяТЧ = ?(СтруктураПараметров.ВидДокумента="АвансовыйОтчет","ОплатаПоставщикам","РасшифровкаПлатежа");
	

	РеестрПлатежей = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(СтруктураПараметров.Ссылка, ИмяТЧ, СтруктураТаблицы).Выгрузить();
	
	//Определим наличие расчетов в условных единицах
	ЕстьРасчетыВУсловныхЕдиницах = ложь;

	Для Каждого СтрокаТаблицы из РеестрПлатежей Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
			Если СтрокаТаблицы.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
				СтрокаТаблицы.Сделка			= Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если ВВалюте Тогда
			СтрокаТаблицы.РублеваяСумма = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.РублеваяСумма, СтруктураПараметров.ВалютаДокумента, СтруктураПараметров.ВалютаРегламентированногоУчета,
														 СтрокаТаблицы.КурсВзаиморасчетов,      СтруктураПараметров.КурсВалютыРегламентированногоУчета, 
														 СтрокаТаблицы.КратностьВзаиморасчетов, СтруктураПараметров.КратностьВалютыРегламентированногоУчета);
			СтрокаТаблицы.СуммаСНДС = СтрокаТаблицы.РублеваяСумма;
		КонецЕсли;
		Если СтрокаТаблицы.РасчетыВУсловныхЕдиницах тогда
			ЕстьРасчетыВУсловныхЕдиницах = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	СтруктураПараметров.Вставить("ЕстьРасчетыВУсловныхЕдиницах",ЕстьРасчетыВУсловныхЕдиницах);
	
	СтруктураПараметров.Вставить("Таблица",РеестрПлатежей);
	
 КонецПроцедуры // ПодготовитьТаблицуОплатДляДвиженияДенег()

//  РЕГИСТРАЦИЯ ОПЛАТ В ПОДСИСТЕМЕ НДС
//***********************************************************************************************



Процедура СнятиеРезерваНДСПартииПоЗаказамПокупателя(ТаблицаПартий,СтруктураПараметров) Экспорт
КонецПроцедуры

// Доподняет структуру шапки документа параметрами ПартионныйУчетНДСвРазрезеСкладов и
// ПартионныйУчетНДСвРазрезеСерийИХарактеристик
//
Процедура ДополнитьПараметрамиПартионногоУчетаНДС(СтруктураШапкиДокумента, Отказ) Экспорт
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиНалоговыйУчет(СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация);
	
	Если Не СтруктураШапкиДокумента.Свойство("ПартионныйУчетНДСвРазрезеСкладов") Тогда
		Если Не УчетнаяПолитика.Свойство("ПартионныйУчетНДСвРазрезеСкладов") Тогда
			СтруктураШапкиДокумента.Вставить("ПартионныйУчетНДСвРазрезеСкладов", Ложь);
		Иначе
			СтруктураШапкиДокумента.Вставить("ПартионныйУчетНДСвРазрезеСкладов", УчетнаяПолитика.ПартионныйУчетНДСвРазрезеСкладов);
		КонецЕсли;
	КонецЕсли;
	Если Не СтруктураШапкиДокумента.Свойство("ПартионныйУчетНДСвРазрезеСерийИХарактеристик") Тогда
		Если Не УчетнаяПолитика.Свойство("ПартионныйУчетНДСвРазрезеСерийИХарактеристик") Тогда
			СтруктураШапкиДокумента.Вставить("ПартионныйУчетНДСвРазрезеСерийИХарактеристик", Ложь);
		Иначе
			СтруктураШапкиДокумента.Вставить("ПартионныйУчетНДСвРазрезеСерийИХарактеристик", УчетнаяПолитика.ПартионныйУчетНДСвРазрезеСерийИХарактеристик);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значение параметра учетной политики (налоговый учет) ПартионныйУчетНДСвРазрезеСкладов
//
Функция ВедетсяПартионныйУчетНДСВРазрезеСкладов(СтруктураШапкиДокумента, Отказ) Экспорт
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиНалоговыйУчет(СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация);
	
	Если Не УчетнаяПолитика.Свойство("ПартионныйУчетНДСвРазрезеСкладов") Тогда
		Возврат Ложь;
	Иначе
		Возврат УчетнаяПолитика.ПартионныйУчетНДСвРазрезеСкладов;
	КонецЕсли;
		
	
КонецФункции

// Возвращает значение параметра учетной политики (налоговый учет) ПартионныйУчетНДСвРазрезеСерийИХарактеристик
//
Функция ВедетсяПартионныйУчетНДСвРазрезеСерийИХарактеристик(СтруктураШапкиДокумента, Отказ) Экспорт
	
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиНалоговыйУчет(СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация);
	
	Если Не УчетнаяПолитика.Свойство("ПартионныйУчетНДСвРазрезеСерийИХарактеристик") Тогда
		Возврат Ложь;
	Иначе
		Возврат УчетнаяПолитика.ПартионныйУчетНДСвРазрезеСерийИХарактеристик;
	КонецЕсли;
	
КонецФункции


// Рассчитываем сумму документа со всеми налогами
//
// Параметры: 
//  ДокументОбъект    - объект документа, сумму которого надо рассчитать
//  ИмяТабличнойЧасти - строка, имя табличной части, сумму которой надо рассчитать.
//                      Если она не заполнена, считаем по всем табличным частям, в которых есть "Сумма"
//  НеУчитыватьТару   - булево, если Истина и ИмяТабличнойЧасти неопределено, то в расчете сумм тару не учитываем
//
// Возвращаемое значение:
//  Сумма документа со всеми налогами.
//
Функция ПолучитьСуммуДокументаСНДС(ДокументОбъект, ИмяТабличнойЧасти = Неопределено, НеУчитыватьТару = Истина) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	СуммаДокумента = 0;
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("Сумма");
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
		   И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
		   И ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ИмяТабличнойЧасти)
		   И ДокументОбъект.УчитыватьНДС
		   И Не ДокументОбъект.СуммаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + ДокументОбъект[ИмяТабличнойЧасти].Итог("СуммаНДС");
		КонецЕсли; 
	Иначе
		Для каждого ТЧОбъекта Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			Если НеУчитыватьТару и ТЧОбъекта.Имя = "ВозвратнаяТара" Тогда
				Продолжить;
			КонецЕсли;
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Сумма", МетаданныеДокумента, ТЧОбъекта.Имя) Тогда
				СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("Сумма");
				Если ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента)
					И ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента)
					И ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ТЧОбъекта.Имя)
					И ДокументОбъект.УчитыватьНДС
					И Не ДокументОбъект.СуммаВключаетНДС Тогда
					СуммаДокумента = СуммаДокумента + ДокументОбъект[ТЧОбъекта.Имя].Итог("СуммаНДС");
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат СуммаДокумента;

КонецФункции // ПолучитьСуммуДокументаСНДС()

// Рассчитываем сумму НДС документа
//
// Параметры: 
//  ДокументОбъект    - объект документа, сумму которого надо рассчитать
//  ИмяТабличнойЧасти - строка, имя табличной части, сумму которой надо рассчитать.
//                      Если она не заполнена, считаем по всем табличным частям, в которых есть "Сумма"
//
// Возвращаемое значение:
//  НДС документа
//
Функция ПолучитьНДСДокумента(ДокументОбъект, ИмяТабличнойЧасти = Неопределено) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	СуммаНДС = 0;
	Если ИмяТабличнойЧасти <> Неопределено Тогда
		СуммаНДС = СуммаНДС + ДокументОбъект[ИмяТабличнойЧасти].Итог("СуммаНДС");
	Иначе
		Для каждого ТЧОбъекта Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", МетаданныеДокумента, ТЧОбъекта.Имя) Тогда
				СуммаНДС = СуммаНДС + ДокументОбъект[ТЧОбъекта.Имя].Итог("СуммаНДС");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // ПолучитьСуммуДокументаСНДС()

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС) Экспорт

	Если (УчитыватьНДС) И (СуммаВключаетНДС) Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если УчитыватьНДС Тогда 
		Если НЕ СуммаВключаетНДС Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()

// Функция возвращает ставку НДС.
//
// Параметры:
//  СтавкаНДС - Ставка НДС.
//
// Возвращаемое значение:
//  Число.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат 18;
	КонецЕсли;

	Возврат 0;

КонецФункции // ПолучитьСтавкуНДС()

////////////////////////////////////////////////////////////////////////////////
// ДВИЖЕНИЯ ПО НДС

// Процедура используется для проведения документов по регистрам подсистемы НДС
// Вызывается из обработки "Проведение документов по регистрам НДС" и из 
// документа "Расчет НДС по продукции"
Процедура ДвижениеНДС(ТаблицаДокументов,НДСПродукции = Истина) Экспорт
	
	Для Каждого Строка из ТаблицаДокументов Цикл
		
		ТаблицаСписания = УправлениеЗапасамиПартионныйУчет.ПолучитьТаблицуСтрокДокументов(Строка.Регистратор);
		Если ТаблицаСписания.Количество()>0 Тогда
			
			#Если Клиент Тогда
				Состояние("Проведение по НДС документа " + ТаблицаСписания[0].Регистратор);
			#КонецЕсли
			
			СтруктураПараметров = Новый Структура;
			
			// Приведение таблицы списания к требуемому виду
			УправлениеЗапасамиПартионныйУчет.ПодготовитьТаблицуСписания(СтруктураПараметров,ТаблицаСписания, Ложь, Истина, Истина);
			
			МоментКон = Новый МоментВремени(ТаблицаСписания[0].Период, ТаблицаСписания[0].Регистратор);
			
			СтруктураПараметров.Вставить("УчетнаяПолитика", УправлениеЗапасамиПартионныйУчет.ПолучитьУчетнуюПолитику(МоментКон));
			
			СтруктураПараметров.Вставить("ТолькоДвиженияНДС");
			
			Организация = ТаблицаСписания[0].Организация;
			
			СтруктураПараметров.Вставить("ЕстьСтрокиОтражатьВБухгалтерскомУчете", 	ТаблицаСписания.Найти(Истина, "ОтражатьВБухгалтерскомУчете")<>Неопределено);
			СтруктураПараметров.Вставить("ЕстьСтрокиОтражатьВУправленческомУчете", 	Ложь);
			СтруктураПараметров.Вставить("ЕстьСтрокиОтражатьВНалоговомУчете", 	ТаблицаСписания.Найти(Истина, "ОтражатьВНалоговомУчете")<>Неопределено);
			
			// Движения - наборы записей по регистрам
			УправлениеЗапасамиПартионныйУчет.СоздатьНаборыЗаписей(СтруктураПараметров, ТаблицаСписания, ТаблицаСписания[0].Регистратор);
			
			// Подготовка наборов записей
			УправлениеЗапасамиПартионныйУчет.ПодготовитьНаборыЗаписей(СтруктураПараметров, ТаблицаСписания, ТаблицаСписания[0].Период, ТаблицаСписания[0].Регистратор, Истина, Ложь);
			
			//Сохраним партионные регистры Упр
			СтруктураПараметров.ДвиженияПартииТоваровНаСкладахУпр.Прочитать();
			ТаблицаДвижений = СтруктураПараметров.ДвиженияПартииТоваровНаСкладахУпр.Выгрузить();
			ЗагрузитьВТаблицуЗначенийСписанныеПартии(ТаблицаДвижений,СтруктураПараметров.ТаблицаДвиженийПартииТоваровНаСкладахУпр);
			
			СтруктураПараметров.ДвиженияПартииТоваровПереданныеУпр.Прочитать();
			ТаблицаДвижений = СтруктураПараметров.ДвиженияПартииТоваровПереданныеУпр.Выгрузить();
			ЗагрузитьВТаблицуЗначенийСписанныеПартии(ТаблицаДвижений,СтруктураПараметров.ТаблицаДвиженийПартииТоваровПереданныеУпр);
			ВыполнитьДвиженияПоНДС(СтруктураПараметров, ТаблицаСписания);
			
			УправлениеЗапасамиПартионныйУчет.ЗаписатьДвиженияДокумента(СтруктураПараметров, ТаблицаСписания, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоНДС(СтруктураПараметров, ТаблицаСписания, МассивНоменклатуры, Организация = Неопределено)
	
	Отказ = Ложь;
	
	СтруктураШапкиДокумента = ПолучитьСтруктуруШапкиДокументаПоСсылке(СтруктураПараметров.Регистратор);
	
	Если СтруктураПараметров.Свойство("СдвигГраницыПоследовательностиРасчетыПоРеализацииОрганизации") тогда
		
		Если НЕ СтруктураШапкиДокумента.Свойство("РасчетыВУсловныхЕдиницах") тогда
			СтруктураПараметров.Удалить("СдвигГраницыПоследовательностиРасчетыПоРеализацииОрганизации");
		ИначеЕсли НЕ СтруктураШапкиДокумента.РасчетыВУсловныхЕдиницах тогда
			СтруктураПараметров.Удалить("СдвигГраницыПоследовательностиРасчетыПоРеализацииОрганизации");
		КонецЕсли;

	КонецЕсли;
	
	Если Не СтруктураШапкиДокумента.УчитыватьНДС тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.ОрганизацияНеЯвляетсяПлательщикомНДС Тогда
		Возврат;
	КонецЕсли;
	
	Если Организация <> Неопределено тогда
		СтруктураШапкиДокумента.Вставить("Организация",Организация);
	КонецЕсли;
	
	Если ТипЗнч(СтруктураПараметров.Регистратор)= Тип("ДокументСсылка.ПриходныйОрдерНаТовары") тогда
		
		ТаблицаСписания = УправлениеЗапасамиПартионныйУчет.ПолучитьТаблицуСписанияРасходнымОрдером(ТаблицаСписания[0], СтруктураПараметров);
		
		Если ТаблицаСписания = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;

	СтруктураПолейУчетнойПолитикиНУ = Новый Структура("СложныйУчетНДС");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал", СтруктураПолейУчетнойПолитикиНУ);
	СтруктураПолейУчетнойПолитикиУУ = Новый Структура("ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Упр", СтруктураПолейУчетнойПолитикиУУ);
	
	// Если не указаны параметры учетной политики - движения по НДС не выполняем
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	//Если сложный учет НДС не ведется - затрем параметры сложного учета ндс
	Если НЕ СтруктураШапкиДокумента.СложныйУчетНДС тогда 
		СтруктураШапкиДокумента.Вставить("НДСвСтоимостиТоваров",Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять);
	КонецЕсли;
	
	ЭтоВозврат = СтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровПоставщику" 
				   или СтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровПоставщикуИзНТТ";
				   
	ЭтоВозвратОтПокупателя = СтруктураШапкиДокумента.ВидДокумента = "ВозвратТоваровОтПокупателя";
	
	ТаблицаПартий = ПолучитьТаблицуПартийДляСписанияНДС(СтруктураПараметров);
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Особые случаи списания партий НДС
	Если ЭтоВозврат тогда
	
		УчетНДСФормированиеДвижений.ДвиженияВозвратаТоваровПоставщикуПоРегистрамПодсистемыНДС(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаПартий, ТаблицаСписания, Отказ, Заголовок);
		Возврат;
	ИначеЕсли ЭтоВозвратОтПокупателя тогда
		
		ЗапросРасходныхОрдеров = Новый Запрос;
		ЗапросРасходныхОрдеров.Текст = "ВЫБРАТЬ
		                               |	ВЫБОР
		                               |		КОГДА ПартииТоваровНаСкладах.ДокументДвижения <> НЕОПРЕДЕЛЕНО
		                               |			ТОГДА ПартииТоваровНаСкладах.ДокументДвижения
		                               |		ИНАЧЕ ПартииТоваровНаСкладах.Регистратор
		                               |	КОНЕЦ КАК Регистратор,
		                               |	ВЫБОР
		                               |		КОГДА ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		                               |			ТОГДА ПартииТоваровНаСкладах.Регистратор
		                               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		                               |	КОНЕЦ КАК РасходныйОрдерНаТовары
		                               |ИЗ
		                               |	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
		                               |ГДЕ
		                               |	ПартииТоваровНаСкладах.ВидДвижения = &ВидДвиженияРасход
		                               |	И ПартииТоваровНаСкладах.КодОперации В(&КодыСписание)
		                               |	И (ПартииТоваровНаСкладах.Регистратор В (&МассивРегистраторов)
		                               |			ИЛИ ПартииТоваровНаСкладах.ДокументДвижения В (&МассивРегистраторов))
		                               |	И ПартииТоваровНаСкладах.Период < &Период
		                               |
		                               |СГРУППИРОВАТЬ ПО
		                               |	ВЫБОР
		                               |		КОГДА ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		                               |			ТОГДА ПартииТоваровНаСкладах.Регистратор
		                               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		                               |	КОНЕЦ,
		                               |	ВЫБОР
		                               |		КОГДА ПартииТоваровНаСкладах.ДокументДвижения <> НЕОПРЕДЕЛЕНО
		                               |			ТОГДА ПартииТоваровНаСкладах.ДокументДвижения
		                               |		ИНАЧЕ ПартииТоваровНаСкладах.Регистратор
		                               |	КОНЕЦ
		                               |ИТОГИ ПО
		                               |	Регистратор";
		
		МассивРеализация = Новый Массив;
		КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
		МассивРеализация.Добавить(КодыОпераций.ПередачаТарыКонтрагенту);
		МассивРеализация.Добавить(КодыОпераций.Реализация);
		МассивРеализация.Добавить(КодыОпераций.РеализацияКомиссия);
		МассивРеализация.Добавить(КодыОпераций.РеализацияРозница);
		
		ЗапросРасходныхОрдеров.УстановитьПараметр("КодыСписание",МассивРеализация);
		
		МассивРегистраторов = ТаблицаСписания.ВыгрузитьКолонку("ДокументПередачи");
		ЗапросРасходныхОрдеров.УстановитьПараметр("МассивРегистраторов",МассивРегистраторов);
		// Возврат не может быть раньше реализации
		ЗапросРасходныхОрдеров.УстановитьПараметр("Период",СтруктураПараметров.Период);
		ЗапросРасходныхОрдеров.УстановитьПараметр("ВидДвиженияРасход",ВидДвиженияНакопления.Расход);
		
		ДеревоРасходныхОрдеров = ЗапросРасходныхОрдеров.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		СтруктураПараметров.Вставить("ДеревоРасходныхОрдеров",ДеревоРасходныхОрдеров);
		
		РаспределеннаяТаблицаСписания = РаспределитьПартииПоТаблицеСписания(ТаблицаПартий, ТаблицаСписания, СтруктураШапкиДокумента, СтруктураПараметров);
		УчетНДСФормированиеДвижений.ДвиженияВозвратаТоваровОтПокупателяПоРегистрамПодсистемыНДС(СтруктураШапкиДокумента, СтруктураПараметров, РаспределеннаяТаблицаСписания, Отказ, Заголовок);
		Возврат;
	// Закрытие заказов покупателя
	ИначеЕсли Организация <> Неопределено тогда
		ТаблицаПартий.Колонки.Добавить("Партия");
		МассивПартий = ТаблицаПартий.ВыгрузитьКолонку(ТаблицаПартий.Колонки.ДокументОприходования);
		ТаблицаПартий.ЗагрузитьКолонку(МассивПартий,ТаблицаПартий.Колонки.Партия);
		
		ТаблицаПартий.Колонки.Добавить("ЗаказПартии");
		МассивЗаказов = ТаблицаПартий.ВыгрузитьКолонку(ТаблицаПартий.Колонки.Заказ);
		ТаблицаПартий.ЗагрузитьКолонку(МассивЗаказов,ТаблицаПартий.Колонки.ЗаказПартии);
		
		ТаблицаПартий.Колонки.Добавить("ОбособленныйУчетТоваровПоЗаказамПокупателей");
		Для Каждого ТекСтрокаПартии Из ТаблицаПартий Цикл
			Если (ЗначениеЗаполнено(ТекСтрокаПартии.ЗаказПартии)) И (ТипЗНЧ(ТекСтрокаПартии.ЗаказПартии) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда 
				ТекСтрокаПартии.ОбособленныйУчетТоваровПоЗаказамПокупателей = ТекСтрокаПартии.ЗаказПартии.ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей;
			КонецЕсли;
		КонецЦикла;	
		
		ТаблицаПартий.Колонки.КодОперации.Имя = "КодОперацииПартииТоваров";
		ТаблицаНДСПартииСписания = ОпределитьПартииСписанияПоРегиструНДСПартии(СтруктураШапкиДокумента, ТаблицаПартий,Отказ, Заголовок, ЭтоВозврат, ЭтоВозвратОтПокупателя,СтруктураПараметров);
		СнятиеРезерваНДСПартииПоЗаказамПокупателя(ТаблицаНДСПартииСписания, СтруктураПараметров);
		Возврат;
	КонецЕсли;
	
	РаспределеннаяТаблицаСписания = РаспределитьПартииПоТаблицеСписания(ТаблицаПартий, ТаблицаСписания, СтруктураШапкиДокумента, СтруктураПараметров);

	Для каждого СтрокаРаспределеннойТаблицы из РаспределеннаяТаблицаСписания Цикл
		ОтражатьНДСКомитента = СтруктураШапкиДокумента.Дата >= '20060101000000' И (СтрокаРаспределеннойТаблицы.Комиссионный 
							   И СтрокаРаспределеннойТаблицы.УчетАгентскогоНДС);
		Если ОтражатьНДСКомитента Тогда 
			СтрокаРаспределеннойТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентКомитент;
		КонецЕсли;
	КонецЦикла;
	
	ВыполнитьДвиженияПоРегиструНДСНачисленныйОтражениеРеализации(СтруктураШапкиДокумента, РаспределеннаяТаблицаСписания, СтруктураПараметров, Отказ);
	
	// Получим таблицу НДС партий
	ТаблицаНДСПартииСписания = ОпределитьПартииСписанияПоРегиструНДСПартии(СтруктураШапкиДокумента, РаспределеннаяТаблицаСписания,Отказ, Заголовок, ЭтоВозврат, ЭтоВозвратОтПокупателя, СтруктураПараметров);
	
	Если ТаблицаНДСПартииСписания.Количество() = 0 Тогда
		//Партии не найдены или отражение в партионном учете НДС не производится.
		//Дальнейшая обработка не требуется
		Возврат;
	КонецЕсли;
	
	ВыполнитьДвиженияСписанияНДС(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Заголовок);
	
	МассивОрганизаций = ТаблицаНДСПартииСписания.ВыгрузитьКолонку("Организация");
	
	МассивОрганизаций = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивОрганизаций);
	
	УправлениеЗапасамиПартионныйУчет.УдалитьПустыеЭлементы(МассивОрганизаций);
	
	МассивПартий = ТаблицаНДСПартииСписания.ВыгрузитьКолонку("Партия");
	МассивПартий = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивПартий);
	
	ВыполнитьДвиженияПоОтражениюПредположенияСтавки0(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Заголовок);
	
	ВыполнитьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаНДСПартииСписания, Отказ);

	ВыполнитьДвиженияПоРегиструНДСКосвенныеРасходы_СписаниеМатериаловНаКосвенныеРасходы(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Отказ);	
	
КонецПроцедуры//СформироватьДвиженияПоНДС

// Процедура - вход для движений по НДС
// Параметры 
// СтруктураПараметров - структура, хранящая основные параметры модуля УправлениеЗапасамиПартионныйУчет 
// ТаблицаСписания - 	 таблица значений содержащая информацию о том что и в каком количестве нужно списывать,
// 						 обычно получается из регистра "СписанныеТовары"
Процедура ВыполнитьДвиженияПоНДС(СтруктураПараметров, ТаблицаСписания) Экспорт
	
	МассивНоменклатуры = ТаблицаСписания.ВыгрузитьКолонку("Номенклатура");
	
	МассивНоменклатуры = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивНоменклатуры);
	
	Если ТипЗнч(СтруктураПараметров.Регистратор)= Тип("ДокументСсылка.ЗакрытиеЗаказовПокупателей") тогда
		МассивОрганизаций = ТаблицаСписания.ВыгрузитьКолонку(ТаблицаСписания.Колонки.Организация);
		МассивОрганизаций = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивОрганизаций);
		Для каждого Организация из МассивОрганизаций цикл
			СформироватьДвиженияПоНДС(СтруктураПараметров, ТаблицаСписания, МассивНоменклатуры, Организация);
		КонецЦикла;
	Иначе
		СформироватьДвиженияПоНДС(СтруктураПараметров, ТаблицаСписания, МассивНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры//ВыполнитьДвиженияПоНДС

// Добавляет в таблицу значений строки из другой таблицы значений и 
// в них значения колонок с совпадающими наименованиями.
//
// Параметры:
//  ТаблицаИсточник - таблица значений, откуда берутся значения.
//  ТаблицаПриемник - таблица значений, куда добавляются строки.
//
Процедура ЗагрузитьВТаблицуЗначенийСписанныеПартии(ТаблицаИсточник, ТаблицаПриемник)

	// Заполним значения в совпадающих колонках.
	Для каждого СтрокаТаблицыИсточника Из ТаблицаИсточник Цикл
		Если СтрокаТаблицыИсточника.СписаниеПартий Тогда
			СтрокаТаблицыПриемника = ТаблицаПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьВТаблицуЗначений()

////////////////////////////////////////////////////////////////////////////////
// ОБОЛОЧКИ ДЛЯ ВЫЗОВА СООТВЕТСТВУЮЩИХ ПРОЦЕДУР И ФУНКЦИЙ ИЗ МОДУЛЯ УЧЕТ НДС

Процедура ВыполнитьДвиженияПоРегиструНДСКосвенныеРасходы_СписаниеМатериаловНаКосвенныеРасходы(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Отказ);	
	
	Строка = "СписаниеНаЗатраты";
	
	ДанныеДляОбработки = ОтобратьСтрокиПартийПоКодамОпераций(Строка, ТаблицаНДСПартииСписания,СтруктураПараметров);
	
	Если ДанныеДляОбработки = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСКосвенныеРасходы_СписаниеМатериаловНаКосвенныеРасходы(СтруктураШапкиДокумента, ДанныеДляОбработки, СтруктураПараметров, Отказ);	

КонецПроцедуры

// НДС по партиям - отразить поступление на склад-получатель
//
Процедура ВыполнитьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, СтруктураПараметров, ТаблицаНДСПартииСписания, Отказ)
	
	Если ТаблицаНДСПартииСписания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Строка = "ВозвратОтКомиссионера, ВозвратОтПокупателя, 
			 |Комплектация, КорректировкаСерийИХарактеристик, ПередачаНаКомиссию, ПеремещениеМеждуСкладами,
			 |РезервированиеПодЗаказ, СнятиеРезерваПодЗаказ";
	ДанныеДляОбработки = ОтобратьСтрокиПартийПоКодамОпераций(Строка, ТаблицаНДСПартииСписания, СтруктураПараметров);
	
	ВыполнятьПоступление = Ложь;

	Если СтруктураШапкиДокумента.ВидДокумента = "РеализацияТоваровУслуг" тогда
	   Если  СтруктураШапкиДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером 
		   И СтруктураШапкиДокумента.СложныйУчетНДС Тогда
		   
				ВыполнятьПоступление = Истина;
		КонецЕсли;
	Иначе
		ВыполнятьПоступление = Истина;
	КонецЕсли;
	
	Если ВыполнятьПоступление тогда
		ТаблицаДвиженийПартии = СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров.Скопировать();
		ТаблицаДвиженийПартии.Очистить();
		
		КолНДСПартииТоваров = СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров.Количество();
		
		ДанныеДляОбработки.Колонки.ЗаказСписания.Имя="ЗаказПокупателя";
		
		// Утановка признака ОбособленныйУчетТоваровПоЗаказамПокупателей для движений поступления при резервировании товаров
		Если СтруктураПараметров.Свойство("СоответствиеКодовОперацийСтрокамНДСПартий") 
			и СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[Перечисления.КодыОперацийПартииТоваров.РезервированиеПодЗаказ] <> Неопределено 
			Тогда
			СоответствиеЗаказов = Новый Соответствие();
			Для Каждого СтрокаТаблицы ИЗ ДанныеДляОбработки Цикл
				Если СтрокаТаблицы.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.РезервированиеПодЗаказ Тогда
					
					ОбособленныйУчетТоваровПоЗаказамПокупателей = СоответствиеЗаказов[СтрокаТаблицы.ЗаказПокупателя];
				
					Если ОбособленныйУчетТоваровПоЗаказамПокупателей = Неопределено Тогда
							
						СтруктураЗаказа = Новый Структура("ДоговорКонтрагента");
						УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтрокаТаблицы.ЗаказПокупателя, СтруктураЗаказа);
							
						СтруктураДоговора = Новый Структура("ОбособленныйУчетТоваровПоЗаказамПокупателей");
						УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтруктураЗаказа.ДоговорКонтрагента, СтруктураДоговора);
							
						СтрокаТаблицы.ОбособленныйУчетТоваровПоЗаказамПокупателей = СтруктураДоговора.ОбособленныйУчетТоваровПоЗаказамПокупателей;
							
					Иначе
						СтрокаТаблицы.ОбособленныйУчетТоваровПоЗаказамПокупателей = ОбособленныйУчетТоваровПоЗаказамПокупателей;
					КонецЕсли;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		// Добавим колонки для обработки заказа покупателя.
		Если ТаблицаДвиженийПартии.Колонки.Найти("ОбособленныйУчетТоваровПоЗаказамПокупателей")= Неопределено Тогда
			ТаблицаДвиженийПартии.Колонки.Добавить("ОбособленныйУчетТоваровПоЗаказамПокупателей");
			ТаблицаДвиженийПартии.ЗаполнитьЗначения(Ложь,"ОбособленныйУчетТоваровПоЗаказамПокупателей");
		КонецЕсли;
			
		Если ТаблицаДвиженийПартии.Колонки.Найти("ЗаказПокупателя")= Неопределено Тогда
			ТаблицаДвиженийПартии.Колонки.Добавить("ЗаказПокупателя");
			ТаблицаДвиженийПартии.ЗаполнитьЗначения(Неопределено,"ЗаказПокупателя");
		КонецЕсли;
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ДанныеДляОбработки, ТаблицаДвиженийПартии);
		
		ТаблицаДвиженийПартии.Колонки.Добавить("Услуга",Новый ОписаниеТипов("Булево"));
		ТаблицаДвиженийПартии.ЗаполнитьЗначения(Ложь,"Услуга");
		
		УчетНДСФормированиеДвижений.СформироватьДвиженияПоступленияПоРегиструНДСПартииТоваров(СтруктураШапкиДокумента, ТаблицаДвиженийПартии, СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров, Отказ);

		// Устанавливаем флаги модификации
		СтруктураПараметров.ИзмененыДвиженияНДСПартииТоваров = СтруктураПараметров.ИзмененыДвиженияНДСПартииТоваров 
									ИЛИ (КолНДСПартииТоваров <> СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров.Количество());
	КонецЕсли;
	
КонецПроцедуры//ВыполнитьДвиженияПоступленияПоРегиструНДСПартииТоваров

Процедура ВыполнитьДвиженияПоРегиструНДСНачисленныйОтражениеРеализации(СтруктураШапкиДокумента, РаспределеннаяТаблицаСписания, СтруктураПараметров, Отказ)
	
	СтрокаКодовОпераций = "Реализация, РеализацияКомиссия, РеализацияРозница";
	
	ДанныеДляОбработки = ОтобратьСтрокиПостроителемЗапроса(СтрокаКодовОпераций, РаспределеннаяТаблицаСписания);
	
	Если ДанныеДляОбработки = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураШапкиДокумента.УчитыватьНДС Тогда
		
		УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента.Дата, Отказ, СтруктураШапкиДокумента.Организация, "Нал");
		
		Если НЕ Отказ Тогда
		
			УчетНДСФормированиеДвижений.СформироватьДвиженияПоРегиструНДСНачисленный_ОтражениеРеализации(СтруктураШапкиДокумента, ДанныеДляОбработки, СтруктураПараметров, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоОтражениюПредположенияСтавки0(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Заголовок)
	
	
	СтрокаКодовОпераций = "Реализация, РеализацияКомиссия, РеализацияРозница";
	
	ДанныеДляОбработки = ОтобратьСтрокиПартийПоКодамОпераций(СтрокаКодовОпераций, ТаблицаНДСПартииСписания, СтруктураПараметров);
	
	Если Не ДанныеДляОбработки = Неопределено тогда
		КолНДСПредъявленныйРеализация0 = СтруктураПараметров.ТаблицаДвиженийНДСПредъявленныйРеализация0.Количество();
		
		УчетНДСФормированиеДвижений.ОтразитьПредположениеСтавки0(СтруктураШапкиДокумента, ДанныеДляОбработки, СтруктураПараметров, Заголовок);
		
		СтруктураПараметров.ИзмененыДвиженияНДСПредъявленныйРеализация0  = СтруктураПараметров.ИзмененыДвиженияНДСПредъявленныйРеализация0 
						ИЛИ (КолНДСПредъявленныйРеализация0 <> СтруктураПараметров.ТаблицаДвиженийНДСПредъявленныйРеализация0.Количество());
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет списание НДС и включение в стоимость - исключение НДС из стоимости
//
Процедура ВыполнитьДвиженияСписанияНДС(СтруктураШапкиДокумента, ТаблицаНДСПартииСписания, СтруктураПараметров, Заголовок)
	
	КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
	
	// НДС в стоимости товаров - отработка включения и исключения НДС из стоимости.
	// Включение НДС в стоимость может происходить только для строк с перечисленными ниже кодами операций
	СтрокаКодовОпераций = "Комплектация, ПередачаНаКомиссию, ПеремещениеМеждуСкладами, Реализация, 
						  |РеализацияРозница, РеализацияКомиссия, СписаниеНаЗатраты, СписаниеПоИнвентаризации, СписаниеПоОрдеру";

	ДанныеДляОбработки = ОтобратьСтрокиПартийПоКодамОпераций(СтрокаКодовОпераций, ТаблицаНДСПартииСписания, СтруктураПараметров);
	
	КолНДСПартииТоваров = СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров.Количество();
	КолНДСВключенныйВСтоимость = СтруктураПараметров.ТаблицаДвиженийНДСВключенныйВСтоимость.Количество();
	КолНДСПредъявленный = СтруктураПараметров.ТаблицаДвиженийНДСПредъявленный.Количество();
	
	Если ДанныеДляОбработки.Количество()>0 тогда
			
		ТаблицаДвиженийПартии = СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров;
			
		// Включение НДС в стоимость
		УчетНДСФормированиеДвижений.ОтразитьВключениеИсключениеНДСВСтоимость(СтруктураШапкиДокумента, ДанныеДляОбработки, ТаблицаДвиженийПартии, Истина, СтруктураПараметров, Заголовок);
		// Исключение НДС из стоимости
		УчетНДСФормированиеДвижений.ОтразитьВключениеИсключениеНДСВСтоимость(СтруктураШапкиДокумента, ДанныеДляОбработки, ТаблицаДвиженийПартии, Ложь, СтруктураПараметров, Заголовок);
			
		Если ТаблицаДвиженийПартии.Количество() > 0 тогда
				
			ТаблицаДвиженийПартии.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход,"ВидДвижения");
				
		КонецЕсли;
			
	Иначе
		
		// партии у которых не произошло включение - исключение НДС из стоимости
		СтрокаКодовОпераций = "КорректировкаСерийИхарактеристик, РезервированиеПодЗаказ, СнятиеРезерваПодЗаказ,
							  |ВозвратОтКомиссионера";

		ДанныеДляОбработки = ОтобратьСтрокиПартийПоКодамОпераций(СтрокаКодовОпераций, ТаблицаНДСПартииСписания, СтруктураПараметров);
		
	КонецЕсли;//Если ДанныеДляОбработки.Количество()>0 тогда
	
	ТаблицаНДСПартииСписания = ДанныеДляОбработки;
	
	СтруктураПараметров.Вставить("СоответствиеКодовОперацийСтрокамНДСПартий", Новый Соответствие);
	
	// НДС по партиям - отразить непосредственое списание.
	КолСтрокНДС = ТаблицаНДСПартииСписания.Количество();
	
	СтрокаПоступленияКомплектации = Неопределено;
	
	Для ИндексТекСтроки = 0 по КолСтрокНДС-1 цикл
		
		СтрокаТаблицыНДСПартииСписания = ТаблицаНДСПартииСписания[ИндексТекСтроки];
		
		// Для ускорения поиска добавим строку в соответствие
		Если СтруктураПараметров.Свойство("СоответствиеКодовОперацийСтрокамНДСПартий") тогда
			МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаТаблицыНДСПартииСписания.КодОперацииПартииТоваров];
			Если МассивСтрокПоКоду = Неопределено Тогда
				СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий.Вставить(СтрокаТаблицыНДСПартииСписания.КодОперацииПартииТоваров, Новый Массив);
				МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаТаблицыНДСПартииСписания.КодОперацииПартииТоваров];
			КонецЕсли;
			МассивСтрокПоКоду.Добавить(СтрокаТаблицыНДСПартииСписания);
		КонецЕсли;
		
		Движение = УправлениеЗапасамиПартионныйУчет.ДобавитьДвижениеВСтруктуруПараметров("НДСПартииТоваров", СтруктураПараметров);
		ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицыНДСПартииСписания);
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		// Для того, чтобы правильно отразить поступление партий НДС нужно изменить таблицу ТаблицаНДСПартииСписания
		Если ЗначениеЗаполнено(СтрокаТаблицыНДСПартииСписания.СкладПолучатель) тогда
			СтрокаТаблицыНДСПартииСписания.Склад = СтрокаТаблицыНДСПартииСписания.СкладПолучатель;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицыНДСПартииСписания.НоменклатураНовая) тогда
			СтрокаТаблицыНДСПартииСписания.Номенклатура = СтрокаТаблицыНДСПартииСписания.НоменклатураНовая;
			СтрокаТаблицыНДСПартииСписания.ХарактеристикаНоменклатуры = СтрокаТаблицыНДСПартииСписания.ХарактеристикаНоменклатурыНовая;
			СтрокаТаблицыНДСПартииСписания.СерияНоменклатуры = СтрокаТаблицыНДСПартииСписания.СерияНоменклатурыНовая;
		Иначе	
			Если ЗначениеЗаполнено(СтрокаТаблицыНДСПартииСписания.ХарактеристикаНоменклатурыНовая) 
				или СтрокаТаблицыНДСПартииСписания.ИзменитьХарактеристику тогда
				СтрокаТаблицыНДСПартииСписания.ХарактеристикаНоменклатуры = СтрокаТаблицыНДСПартииСписания.ХарактеристикаНоменклатурыНовая;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицыНДСПартииСписания.СерияНоменклатурыНовая) 
				или СтрокаТаблицыНДСПартииСписания.ИзменитьСерию тогда
				СтрокаТаблицыНДСПартииСписания.СерияНоменклатуры = СтрокаТаблицыНДСПартииСписания.СерияНоменклатурыНовая;
			КонецЕсли;
		КонецЕсли;
		
		// Если это комплектация - поступление партий НДС выполняется особым способом
		Если СтрокаТаблицыНДСПартииСписания.КодОперацииПартииТоваров = КодыОпераций.Комплектация Тогда
			
			СтрокаТаблицыНДСПартииСписания.Партия = СтрокаТаблицыНДСПартииСписания.ДокументОприходованияНовый;
			
			Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.КомплектацияНоменклатуры")
				и СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Разукомплектация 
				и СтрокаТаблицыНДСПартииСписания.Количество <>0
				Тогда
				//Строка поступления для каждой комплектующей своя
			    СтрокаПоступленияКомплектации = Неопределено;
			КонецЕсли; 
			
			Если СтрокаПоступленияКомплектации = Неопределено Тогда
				СтрокаПоступленияКомплектации = ТаблицаНДСПартииСписания.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПоступленияКомплектации,СтрокаТаблицыНДСПартииСписания);
				СтрокаПоступленияКомплектации.НДС = 0;
				СтрокаПоступленияКомплектации.Стоимость = 0;
				Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.КомплектацияНоменклатуры")
					и СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Комплектация
					Тогда
				    СтрокаПоступленияКомплектации.Количество = СтруктураШапкиДокумента.Количество;
				ИначеЕсли СтрокаТаблицыНДСПартииСписания.Количество <>0 тогда
					СтрокаПоступленияКомплектации.Количество = СтрокаТаблицыНДСПартииСписания.КоличествоПоступление;
				КонецЕсли;
				СтрокаПоступленияКомплектации.СчетФактура = Неопределено;
				СтрокаПоступленияКомплектации.ВидЦенности = Перечисления.ВидыЦенностей.Товары;
				СтрокаПоступленияКомплектации.СтавкаНДС   = Перечисления.СтавкиНДС.БезНДС;
				
				// Для ускорения поиска добавим строку в соответствие
				Если СтруктураПараметров.Свойство("СоответствиеКодовОперацийСтрокамНДСПартий") тогда
					МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаПоступленияКомплектации.КодОперацииПартииТоваров];
					Если МассивСтрокПоКоду = Неопределено Тогда
						СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий.Вставить(СтрокаПоступленияКомплектации.КодОперацииПартииТоваров, Новый Массив);
						МассивСтрокПоКоду = СтруктураПараметров.СоответствиеКодовОперацийСтрокамНДСПартий[СтрокаПоступленияКомплектации.КодОперацииПартииТоваров];
					КонецЕсли;
					МассивСтрокПоКоду.Добавить(СтрокаПоступленияКомплектации);
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.КомплектацияНоменклатуры")
				и СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийКомплектацияНоменклатуры.Комплектация
				тогда
				//Строка с полным количеством поступления уже создна. Дополнение количества не требуется 
            Иначе
				Если СтрокаТаблицыНДСПартииСписания.Количество <>0 тогда
					СтрокаПоступленияКомплектации.Количество = СтрокаПоступленияКомплектации.Количество + 
															   СтрокаТаблицыНДСПартииСписания.КоличествоПоступление;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТаблицыНДСПартииСписания.Количество = 0;
			
		КонецЕсли;//Если СтрокаТаблицыНДСПартииСписания.КодОперацииПартииТоваров = КодыОпераций.Комплектация Тогда 

	КонецЦикла;//	Для каждого СтрокаТаблицыНДСПартииСписания из ТаблицаНДСПартииСписания цикл

	СтруктураПараметров.ИзмененыДвиженияНДСПартииТоваров = СтруктураПараметров.ИзмененыДвиженияНДСПартииТоваров 
								ИЛИ (КолНДСПартииТоваров <> СтруктураПараметров.ТаблицаДвиженийНДСПартииТоваров.Количество());
										
	СтруктураПараметров.ИзмененыДвиженияНДСВключенныйВСтоимость = СтруктураПараметров.ИзмененыДвиженияНДСВключенныйВСтоимость
								ИЛИ (КолНДСВключенныйВСтоимость <> СтруктураПараметров.ТаблицаДвиженийНДСВключенныйВСтоимость.Количество());
										
	СтруктураПараметров.ИзмененыДвиженияНДСПредъявленный = СтруктураПараметров.ИзмененыДвиженияНДСПредъявленный
								ИЛИ (КолНДСПредъявленный <> СтруктураПараметров.ТаблицаДвиженийНДСПредъявленный.Количество());
										

КонецПроцедуры//ВыполнитьДвиженияСписанияНДС

// ОБОЛОЧКИ ДЛЯ ВЫЗОВА СООТВЕТСТВУЮЩИХ ПРОЦЕДУР И ФУНКЦИЙ ИЗ МОДУЛЯ УЧЕТ НДС
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ ДЛЯ СОВМЕСТИМОСТИ С БП

Функция РаспределитьПартииПоТаблицеСписания(ТаблицаПартий, ТаблицаСписания, СтруктураШапкиДокумента, СтруктураПараметров) Экспорт
	
	КопияТаблицыСписания = ТаблицаСписания.Скопировать();
	
	РаспределеннаяТаблица = КопияТаблицыСписания.Скопировать();

	РаспределеннаяТаблица.Очистить();
	
	// Дополнительные колонки, используемые подсистемой НДС
	СтрокаНазванийКолонок = "Ценность, ВидЦенности, ДоговорПоставщика, Комиссионный, Партия,
							|НДС, СуммаБезНДС, ДокументОприходования,
							|ДокументОприходованияДата, НомерКорСтроки,
							|ДоговорКомиссии, УчетАгентскогоНДС,
							|Подразделение";

	СтруктураКолонокРаспределеннойТаблицы = Новый Структура(СтрокаНазванийКолонок);
	
	Для Каждого Элемент из СтруктураКолонокРаспределеннойТаблицы цикл
		Если РаспределеннаяТаблица.Колонки.Найти(Элемент.Ключ) = Неопределено тогда
			РаспределеннаяТаблица.Колонки.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
	
	Для каждого СтрокаТаблицыСписания из КопияТаблицыСписания цикл
		
		РегистрУчета = "НаСкладах";
		
		МассивСтрокПартий = УправлениеЗапасамиПартионныйУчет.ОтобратьСтрокиПартий(ТаблицаПартий, СтрокаТаблицыСписания, РегистрУчета);
		
		Для Каждого СтрокаПартии из МассивСтрокПартий цикл
		
			Если СтрокаПартии.ВидДвижения = ВидДвиженияНакопления.Приход 
			   И  Не СтрокаПартии.КодОперации = КодыОпераций.ВозвратОтПокупателя тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаПартии.Количество <= 0 тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицыСписания.Количество <= 0 тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ УправлениеЗапасамиПартионныйУчет.ПроверитьПартиюНаСкладеУпр(СтрокаПартии, СтрокаТаблицыСписания, СтруктураПараметров) тогда
				Продолжить;
			КонецЕсли;
			
			// НДС по таре не учитывается
			Если СтрокаПартии.СтатусПартии = Перечисления.СтатусыПартийТоваров.ВозвратнаяТара тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицыСписания.Количество > СтрокаПартии.Количество тогда
				КоэффСписания = СтрокаПартии.Количество/СтрокаТаблицыСписания.Количество;
			Иначе
				КоэффСписания = 1;
			КонецЕсли;
			
			СтрокаРаспределеннойТаблицы = РаспределеннаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРаспределеннойТаблицы,СтрокаТаблицыСписания);
			
			СтрокаРаспределеннойТаблицы.НДС   = Окр(СтрокаТаблицыСписания.СуммаНДС * КоэффСписания,2,1);
			
			СуммаЗадолженностиБУ = Окр(СтрокаТаблицыСписания.СуммаЗадолженностиБУ * КоэффСписания,2,1);
			СтрокаРаспределеннойТаблицы.СуммаБезНДС = СуммаЗадолженностиБУ - СтрокаРаспределеннойТаблицы.НДС;
			
			СтрокаРаспределеннойТаблицы.КорВалютнаяСуммаЗадолженностиБУ = Окр(СтрокаТаблицыСписания.КорВалютнаяСуммаЗадолженностиБУ* КоэффСписания,2,1);
			
			СтрокаТаблицыСписания.КорВалютнаяСуммаЗадолженностиБУ = СтрокаТаблицыСписания.КорВалютнаяСуммаЗадолженностиБУ - СтрокаРаспределеннойТаблицы.КорВалютнаяСуммаЗадолженностиБУ;
			
			СтрокаТаблицыСписания.СуммаЗадолженностиБУ = СтрокаТаблицыСписания.СуммаЗадолженностиБУ - СуммаЗадолженностиБУ;
			СтрокаТаблицыСписания.СуммаНДС = СтрокаТаблицыСписания.СуммаНДС - СтрокаРаспределеннойТаблицы.НДС;
			СтрокаТаблицыСписания.Количество = СтрокаТаблицыСписания.Количество - СтрокаПартии.Количество;
				
			СтрокаРаспределеннойТаблицы.Количество = СтрокаПартии.Количество;
			СтрокаРаспределеннойТаблицы.КоличествоПоступление = Окр(СтрокаТаблицыСписания.КоличествоПоступление * КоэффСписания,3,1);
			СтрокаРаспределеннойТаблицы.Партия = СтрокаПартии.ДокументОприходования;
			СтрокаРаспределеннойТаблицы.ДокументОприходования = СтрокаПартии.ДокументОприходования;
			СтрокаРаспределеннойТаблицы.КодОперацииПартииТоваров = СтрокаПартии.КодОперации;
			
			Если СтрокаПартии.КодОперации = Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя тогда
				СтрокаРаспределеннойТаблицы.СкладПолучатель = СтрокаРаспределеннойТаблицы.Склад;
			КонецЕсли;
			
			СтрокаПартии.Количество = 0;
			СтрокаТаблицыСписания.КоличествоПоступление = СтрокаТаблицыСписания.КоличествоПоступление - СтрокаРаспределеннойТаблицы.КоличествоПоступление;
			
			СтрокаРаспределеннойТаблицы.Ценность = СтрокаРаспределеннойТаблицы.Номенклатура;
			
			СтрокаРаспределеннойТаблицы.Комиссионный = СтрокаПартии.СтатусПартии = Перечисления.СтатусыПартийТоваров.НаКомиссию;
			
			Если СтрокаРаспределеннойТаблицы.Комиссионный тогда
				
				Если ЗначениеЗаполнено(СтрокаПартии.ДокументОприходования) тогда
					
					СтруктураРеквизитовДокумента = Новый Структура("Контрагент,ДоговорКонтрагента");
					УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтрокаПартии.ДокументОприходования, СтруктураРеквизитовДокумента);
					СтрокаРаспределеннойТаблицы.ДоговорКомиссии = СтруктураРеквизитовДокумента.ДоговорКонтрагента;
					СтруктураРеквизитовДоговора = Новый Структура("УчетАгентскогоНДС");
					УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтруктураРеквизитовДокумента.ДоговорКонтрагента, СтруктураРеквизитовДоговора);

					СтрокаРаспределеннойТаблицы.УчетАгентскогоНДС = СтруктураРеквизитовДоговора.УчетАгентскогоНДС;
				Иначе
					СтрокаРаспределеннойТаблицы.УчетАгентскогоНДС = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаРаспределеннойТаблицы.ВидЦенности	= Перечисления.ВидыЦенностей.Товары;
			
		КонецЦикла;//Для Каждого СтрокаПартии из МассивСтрокПартий цикл
		
		Если СтрокаТаблицыСписания.Количество > 0 И 
		   НЕ СтрокаТаблицыСписания.ДопустимыйСтатус1 = Перечисления.СтатусыПартийТоваров.ВозвратнаяТара Тогда
			
			СтрокаРаспределеннойТаблицы = РаспределеннаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРаспределеннойТаблицы,СтрокаТаблицыСписания);
			
			Если СтрокаРаспределеннойТаблицы.КодОперацииПартииТоваров = Перечисления.КодыОперацийПартииТоваров.ВозвратОтПокупателя тогда
				СтрокаРаспределеннойТаблицы.СкладПолучатель = СтрокаРаспределеннойТаблицы.Склад;
			КонецЕсли;
			
			СтрокаРаспределеннойТаблицы.Ценность = СтрокаРаспределеннойТаблицы.Номенклатура;
			
			СтрокаРаспределеннойТаблицы.ВидЦенности	= Перечисления.ВидыЦенностей.Товары;
			
			СтрокаРаспределеннойТаблицы.НДС   = СтрокаТаблицыСписания.СуммаНДС;
			
			СтрокаРаспределеннойТаблицы.СуммаБезНДС = СтрокаТаблицыСписания.СуммаЗадолженностиБУ - СтрокаТаблицыСписания.СуммаНДС;
			
			СтрокаРаспределеннойТаблицы.Комиссионный = Ложь;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат РаспределеннаяТаблица;
	
КонецФункции//РаспределитьПартииПоТаблицеСписания

Функция ПолучитьСтруктуруШапкиДокументаПоСсылке(Знач Ссылка)

	Перем СтруктураКорректировкиЗаказа;
	
	МетаданныеДокумента = Ссылка.Метаданные();

	Если МетаданныеДокумента.Имя = "РасходныйОрдерНаТовары" Тогда

		СтруктураДокументаПередачи = Новый Структура("ДокументПередачи");
		УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(Ссылка,СтруктураДокументаПередачи);
		МетаданныеДокумента = СтруктураДокументаПередачи.ДокументПередачи.Метаданные();
		Ссылка = СтруктураДокументаПередачи.ДокументПередачи;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПриходныйОрдерНаТовары" Тогда

		СтруктураДокументаПеремещения = Новый Структура("ДокументПеремещения");
		УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(Ссылка,СтруктураДокументаПеремещения);
		МетаданныеДокумента = СтруктураДокументаПеремещения.ДокументПеремещения.Метаданные();
		Ссылка = СтруктураДокументаПеремещения.ДокументПеремещения;
		
	ИначеЕсли МетаданныеДокумента.Имя = "КорректировкаЗаказаПокупателя" тогда
		
		СтруктураКорректировкиЗаказа = Новый Структура("ЗаказПокупателя, Ссылка, Дата, Номер");
		УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(Ссылка,СтруктураКорректировкиЗаказа);
		МетаданныеДокумента = СтруктураКорректировкиЗаказа.ЗаказПокупателя.Метаданные();
		Ссылка = СтруктураКорректировкиЗаказа.ЗаказПокупателя;

	КонецЕсли;

	СтруктураШапкиДокумента = Новый Структура;

	СтруктураШапкиДокумента.Вставить("Ссылка");
	СтруктураШапкиДокумента.Вставить("Дата");
	СтруктураШапкиДокумента.Вставить("Номер");

	Для каждого Реквизит из МетаданныеДокумента.Реквизиты Цикл
		СтруктураШапкиДокумента.Вставить(Реквизит.Имя);
	КонецЦикла;

	УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(Ссылка, СтруктураШапкиДокумента);

	Если СтруктураКорректировкиЗаказа <> Неопределено тогда
		
		СтруктураШапкиДокумента.Вставить("Ссылка" , СтруктураКорректировкиЗаказа.Ссылка);
		СтруктураШапкиДокумента.Вставить("Дата"   , СтруктураКорректировкиЗаказа.Дата);
		СтруктураШапкиДокумента.Вставить("Номер"  , СтруктураКорректировкиЗаказа.Номер);

	КонецЕсли;

	Если СтруктураШапкиДокумента.Свойство("ДоговорКонтрагента") тогда

		СтруктураДоговора = Новый Структура ("ВидДоговора,
											 |УчетАгентскогоНДС, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");

		УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтруктураШапкиДокумента.ДоговорКонтрагента, СтруктураДоговора);
		СтруктураШапкиДокумента.Вставить("ВидДоговора", СтруктураДоговора.ВидДоговора);
		СтруктураШапкиДокумента.Вставить("УчетАгентскогоНДС", СтруктураДоговора.УчетАгентскогоНДС);
		СтруктураШапкиДокумента.Вставить("ВалютаВзаиморасчетов", СтруктураДоговора.ВалютаВзаиморасчетов);
		СтруктураШапкиДокумента.Вставить("РасчетыВУсловныхЕдиницах", СтруктураДоговора.РасчетыВУсловныхЕдиницах);
		
	Иначе

		СтруктураШапкиДокумента.Вставить("ВидДоговора", Неопределено);

	КонецЕсли;

	
	Если НЕ СтруктураШапкиДокумента.Свойство("УчитыватьНДС") Тогда

		СтруктураШапкиДокумента.Вставить("УчитыватьНДС", Истина);

	КонецЕсли;

	
	Если НЕ СтруктураШапкиДокумента.Свойство("НДСВключенВСтоимость") Тогда

		СтруктураШапкиДокумента.Вставить("НДСВключенВСтоимость", Истина);

	КонецЕсли;

	Если НЕ СтруктураШапкиДокумента.Свойство("ОтражатьВНалоговомУчетеУСН") Тогда

		СтруктураШапкиДокумента.Вставить("ОтражатьВНалоговомУчетеУСН", Ложь);

	КонецЕсли;

	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	СтруктураШапкиДокумента.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);	
	СтруктураШапкиДокумента.Вставить("ВидДокумента",  МетаданныеДокумента.Имя);
	
	Если СтруктураШапкиДокумента.Свойство("Организация") Тогда
		ОшибкаПолученияУчетнойПолитикиНУ = Ложь;
		СтруктураПолейУчетнойПолитикиНУ = Новый Структура("ОрганизацияНеЯвляетсяПлательщикомНДС");
		ОбщегоНазначения.ДополнитьПоложениямиУчетнойПолитики(СтруктураШапкиДокумента, СтруктураШапкиДокумента.Дата,ОшибкаПолученияУчетнойПолитикиНУ , СтруктураШапкиДокумента.Организация, "Нал", СтруктураПолейУчетнойПолитикиНУ);
		
		Если ОшибкаПолученияУчетнойПолитикиНУ Тогда
			СтруктураШапкиДокумента.Вставить("ОрганизацияНеЯвляетсяПлательщикомНДС", Ложь);
		КонецЕсли; 
	Иначе
		СтруктураШапкиДокумента.Вставить("ОрганизацияНеЯвляетсяПлательщикомНДС", Ложь);
	КонецЕсли;
	
	ВидПоступления = Неопределено;
	Если СтруктураШапкиДокумента.Свойство("ВидПоступления",ВидПоступления) тогда
		Если ВидПоступления = Перечисления.ВидыПоступленияТоваров.ПоОрдеру тогда
			СтруктураСклада = Новый Структура("СкладОрдер");
			УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(Ссылка,СтруктураСклада);
			
			СтруктураСкладаОрдера = Новый Структура("Склад");
			УправлениеЗапасамиПартионныйУчет.ПолучитьРеквизитыОбъекта(СтруктураСклада.СкладОрдер,СтруктураСкладаОрдера);
			
			СтруктураШапкиДокумента.Вставить("СкладПриходногоОрдера",СтруктураСкладаОрдера.Склад);
		КонецЕсли;
	КонецЕсли;

	СтруктураШапкиДокумента.Вставить("ПредставлениеДокумента", СокрЛП(СтруктураШапкиДокумента.Ссылка));

	Возврат СтруктураШапкиДокумента;
	
КонецФункции

Функция ОтобратьСтрокиПартийПоКодамОпераций(СтрокаКодовОпераций, ТаблицаПартийНДС, СтруктураПараметров)
	
	Перем СоответствиеКодовОперацийСтрокамНДСПартий;
	
	Результат = Новый ТаблицаЗначений;
		
	Для каждого Колонка ИЗ ТаблицаПартийНДС.Колонки Цикл
			
		Результат.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);
			
	КонецЦикла;
	
	Если СтруктураПараметров.Свойство("СоответствиеКодовОперацийСтрокамНДСПартий",СоответствиеКодовОперацийСтрокамНДСПартий) тогда

		СтруктураКодовОпераций = Новый Структура(СтрокаКодовОпераций);
			
		Для каждого Элемент из СтруктураКодовОпераций Цикл
			МассивСтрокПоКодуОперации = СоответствиеКодовОперацийСтрокамНДСПартий[Перечисления.КодыОперацийПартииТоваров[Элемент.Ключ]];
			Если МассивСтрокПоКодуОперации <> Неопределено Тогда
				Для Каждого СтрокаТаблицы ИЗ МассивСтрокПоКодуОперации Цикл
					НоваяСтрока = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Результат;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции //ОтобратьСтрокиПоКодамОпераций

Функция ОтобратьСтрокиПостроителемЗапроса(СтрокаКодовОпераций, ТаблицаЗначений)
	
	СтруктураКодовОпераций = Новый Структура(СтрокаКодовОпераций);
	
	ВидСравненияКодаОперации = ВидСравнения.ВСписке;
		
	СписокОтбора = Новый СписокЗначений;
	Для каждого Элемент из СтруктураКодовОпераций Цикл
		СписокОтбора.Добавить(Перечисления.КодыОперацийПартииТоваров[Элемент.Ключ]);
	КонецЦикла;
	
	ПостроительТаблицаПартийНДС = Новый ПостроительЗапроса();
	ПостроительТаблицаПартийНДС.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаЗначений);
	Отбор = ПостроительТаблицаПартийНДС.Отбор;
	ЭлементОтбора = Отбор.Добавить("КодОперацииПартииТоваров");
	ЭлементОтбора.ВидСравнения = ВидСравненияКодаОперации;
	ЭлементОтбора.Значение = СписокОтбора;
	ЭлементОтбора.Использование = Истина;
		
	ПостроительТаблицаПартийНДС.Выполнить();
		
	Если ПостроительТаблицаПартийНДС.Результат.Пустой() тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат ПостроительТаблицаПартийНДС.Результат.Выгрузить();
	
КонецФункции //ОтобратьСтрокиПостроителемЗапроса

Функция ПолучитьТаблицуПартийДляСписанияНДС(СтруктураПараметров)
	
	// Партии могут списываться из регистров ПартииТоваровНаСкладахБухгалтерскийУчет и ПартииТоваровПереданныеБухгалтерскийУчет
	// Отберем из соответствующих таблиц партии с видом движения "расход"
	
	КодыОпераций = Перечисления.КодыОперацийПартииТоваров;
	
	ТаблицаПартий = СтруктураПараметров.ТаблицаДвиженийПартииТоваровНаСкладахУпр.Скопировать();
	ТаблицаПартий.Очистить();
	ТаблицаПартий.Колонки.Добавить("РегистрУчета");
	Для каждого СтрокаПартииНаСкладах из СтруктураПараметров.ТаблицаДвиженийПартииТоваровНаСкладахУпр Цикл
		Если СтрокаПартииНаСкладах.ВидДвижения = ВидДвиженияНакопления.Расход 
		   ИЛИ (СтрокаПартииНаСкладах.ВидДвижения = ВидДвиженияНакопления.Приход 
		   И   СтрокаПартииНаСкладах.КодОперации = КодыОпераций.ВозвратОтПокупателя) тогда
			CтрокаПартии = ТаблицаПартий.Добавить();
			ЗаполнитьЗначенияСвойств(CтрокаПартии,СтрокаПартииНаСкладах);
			Если СтрокаПартииНаСкладах.КодОперации = КодыОпераций.ВозвратОтПокупателяТекущийМесяц тогда
				// Возврат текущего месяца учитывается как сторно реализации
				CтрокаПартии.Количество = - CтрокаПартии.Количество;
				CтрокаПартии.Стоимость  = - CтрокаПартии.Стоимость;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаПартииПереданные из СтруктураПараметров.ТаблицаДвиженийПартииТоваровПереданныеУпр Цикл
		Если СтрокаПартииПереданные.ВидДвижения = ВидДвиженияНакопления.Расход тогда
			CтрокаПартии = ТаблицаПартий.Добавить();
			ЗаполнитьЗначенияСвойств(CтрокаПартии,СтрокаПартииПереданные);
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаПартий;
	
КонецФункции


// СЛУЖЕБНЫЕ ФУНКЦИИ ДЛЯ СОВМЕСТИМОСТИ С БП
////////////////////////////////////////////////////////////////////////////////

// ДВИЖЕНИЯ ПО НДС
////////////////////////////////////////////////////////////////////////////////


// Выполняет общие для всех документов действия связанные с пометкой на удаление
// счета-фактуры при удалении документа, являющегося основание данного счета-фактуры.
//
// Параметры:
//  ДокументОбъект  - объект документа, 
//  ВидСчетаФактуры - строка, вид счета-фактуры, по умолчанию "СчетФактураВыданный"
//
Процедура СинхронизацияПометкиНаУдалениеУСчетаФактуры(ДокументОбъект, ВидСчетаФактуры = "СчетФактураВыданный") Экспорт
	Попытка //После обновления платформы не всегда срабатывает запрос 11.10.2017, Юра
	Если ДокументОбъект.ПометкаУдаления <> ДокументОбъект.Ссылка.ПометкаУдаления Тогда
		// Произошло изменение пометки на удаление
		
		//Попытаемся найти счет-фактуру
		СчетФактура = НайтиПодчиненныйДокумент(ДокументОбъект.Ссылка, ВидСчетаФактуры);

		//Если потерпели неудачу, то необходимо ввести новый документ 
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			// Есть счет-фактура нужно установить для него пометку удаления
			СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
			СчетФактураОбъект.УстановитьПометкуУдаления(ДокументОбъект.ПометкаУдаления);
			
			Если ДокументОбъект.ПометкаУдаления Тогда
				Сообщить("Документ «" + СчетФактура + "» помечен на удаление.",СтатусСообщения.Информация);
			Иначе
				Сообщить("У документа «" + СчетФактура + "» снята пометка на удаление.",СтатусСообщения.Информация);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Исключение
	КонецПопытки;
		
КонецПроцедуры // СинхронизацияПометкиНаУдалениеУСчетаФактуры()

//***{+Добавления}*** Тасмаджиев 19/07/2018// ->>
// Возвращает Истина, если по документу необходимо выписать счет-фактуру.
//
// Применяется для печати универсального передаточного документа
//
// Параметры:
//  ДокументОбъект - документ, для которого надо определить необходимость выписки счета-фактуры
//
Функция ОпределитьСчетФактураТребуется(ДокументОбъект) Экспорт 
	
	УчитыватьНДС = ОрганизацияУчитываетНДС(ДокументОбъект.Организация, ДокументОбъект.Дата);
	ПрименяетсяОсвобождениеОтУплатыНДС = ПрименяетсяОсвобождениеОтУплатыНДС(ДокументОбъект.Организация, ДокументОбъект.Дата);
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.ДоговорКонтрагента, "УчетАгентскогоНДС, ВидДоговора");
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВидДокумента = МетаданныеДокумента.Имя;
	
	Если ВидДокумента = "ВозвратТоваровПоставщику" ИЛИ ВидДокумента = "ВозвратТоваровПоставщикуИзНТТ" Тогда
		Если НЕ РеквизитыДоговора.УчетАгентскогоНДС 
			И НЕ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			Возврат ДокументОбъект.ПоставщикуВыставляетсяСчетФактураНаВозврат;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ВидДокумента = "КорректировкаРеализации" ИЛИ ВидДокумента = "РеализацияТоваровУслуг" Тогда
		Если ВидДокумента = "КорректировкаРеализации" Тогда
			Если ДокументОбъект.КорректироватьНДС = Ложь Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		ЕстьНДС = (ДокументОбъект.Товары.Итог("СуммаНДС") > 0) ИЛИ (ДокументОбъект.Услуги.Итог("СуммаНДС") > 0);
		Если НЕ УчитыватьНДС Тогда
			Возврат ЕстьНДС;
		ИначеЕсли РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
			Возврат Ложь;
		ИначеЕсли НЕ ЕстьНДС И НЕ ПрименяетсяОсвобождениеОтУплатыНДС Тогда
			Возврат Ложь;		
		Иначе
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ВидДокумента = "ОтчетКомитентуОПродажах" Тогда
		ЕстьНДС = ДокументОбъект.Товары.Итог("СуммаНДСВознаграждения") > 0; // В этом виде документов по-другому
		Если НЕ УчитыватьНДС Тогда
			Возврат ЕстьНДС;
		ИначеЕсли НЕ ЕстьНДС И НЕ ПрименяетсяОсвобождениеОтУплатыНДС Тогда
			Возврат Ложь;		
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ОпределитьСчетФактураТребуется()

Функция ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период) Экспорт

	Отказ = Ложь;
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитикиНалоговыйУчет(Период, Отказ, Организация);
	
	Если Не Отказ Тогда
		//***{+Редактирования}*** Тасмаджиев 19/07/2018// ->>
		//Возврат УчетнаяПолитикаНУ.ПрименяетсяОсвобождениеОтУплатыНДС;
		Возврат УчетнаяПолитикаНУ.ОрганизацияНеЯвляетсяПлательщикомНДС;
		//***{-Редактирования}*** Тасмаджиев 19/07/2018// <<-
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции
//***{-Добавления}*** Тасмаджиев 19/07/2018// <<-

//***{+Добавления}*** Тасмаджиев 06/08/2018// ->>
//***=!{Документооборот зависимости}!=*** ->>
// Функция находит и возвращает документ, являющийся отправной точкой исправлений (либо РТУ либо корректировку РТУ)
// либо первоначальный документ РТУ при передаче истины в параметр Исходный
Функция ПолучитьИсправляемыйДокументРеализации(ДокРеализации, Исходный = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокРеализации) 
		И ТипЗнч(ДокРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
		И (ДокРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки ИЛИ Исходный) Тогда
		
		Возврат ПолучитьИсправляемыйДокументРеализации(ДокРеализации.ДокументРеализации, Исходный);
		
	Иначе
		Возврат ДокРеализации;
	КонецЕсли;
	
КонецФункции  //***{-Добавления}*** Тасмаджиев 06/08/2018// <<-

//***{+Добавления}*** Тасмаджиев 06/08/2018// ->>
//***=!{Документооборот зависимости}!=*** ->>
// Возвращает порядок корректировки НДС (по проекту Федерального Закона N 79859-6)
//
// Параметры
// 	Дата  	- 	тип дата, в данном параметре передается
//            	дата на которую необходимо определить порядок корректировки НДФЛ
// Возвращаемое значение:
//  Число   - 	версия постановления, 
//				1 - корректировка НДС выполняется по периоду отгрузки 
//              2 - корректировка НДС выполняется по периоду соглашения об изменении условий договора
//
Функция ПолучитьПорядокКорректировкиНДС(Дата) Экспорт 

	НачалоПримененияПравила = '20130701';
	
	Если Дата >= НачалоПримененияПравила Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;

КонецФункции  //***{-Добавления}*** Тасмаджиев 06/08/2018// <<-

//***{+Добавления}*** Тасмаджиев 09/08/2018// ->>
//***=!{Документооборот УПД}!=*** ->>
// Получает версию постановления в зависимости от переданной даты
//
Функция ПолучитьВерсиюПостановления(Дата) Экспорт
	
	//НачалоПримененияИсправленныхСчетовФактур = Константы.НачалоПримененияИсправленныхСчетовФактур.Получить();
	//
	//Если ЗначениеЗаполнено(НачалоПримененияИсправленныхСчетовФактур)
	//	И Дата >= НачалоПримененияИсправленныхСчетовФактур Тогда
	//	Возврат 2; // Дата начала применения исправленных счетов-фактур задана и меньше или равна переданной даты
	//Иначе
		Возврат 1; // Дата начала применения исправленных счетов-фактур не задана или задана, но больше, чем переданная дата 
	//КонецЕсли;	
		
КонецФункции //***{-Добавления}*** Тасмаджиев 09/08/2018// <<-
