Функция СформироватьШтрихКодЗаказа(Знач ПрефиксШтучногоТовара = Неопределено, Знач ПрефиксВнутреннегоШтрихкода = Неопределено) Экспорт
	
	//Если ПрефиксШтучногоТовара = Неопределено Тогда
	//	ПрефиксШтучногоТовара = СокрЛП(Константы.ПрефиксШтучногоТовара.Получить());
	//КонецЕсли;

	//Если ПрефиксВнутреннегоШтрихкода = Неопределено Тогда
	//	ПрефиксВнутреннегоШтрихкода = Константы.ПрефиксВнутреннегоШтрихкода.Получить();
	//КонецЕсли;

	
	ПрефиксШтучногоТовара = "0";
	ПрефиксВнутреннегоШтрихкода = Формат(0, "ЧЦ=2; ЧН=; ЧВН=");


	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(РегШтрихКоды.Штрихкод, 5, 8)) КАК Код
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК РегШтрихКоды
	|ГДЕ
	|	РегШтрихКоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
	|	И РегШтрихКоды.Штрихкод ПОДОБНО ""9" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + "_________""
	|");

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ТекКод = ?(Выборка.Код = NULL, 1, Мин(ОбщегоНазначения.ПривестиСтрокуКЧислу(Выборка.Код) + 1, 99999999));

	Штрихкод = "9" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + Формат(ТекКод, "ЧЦ=8; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции // СформироватьШтрихКод()

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции // КонтрольныйСимволEAN()


Функция ИщемШтрихКарты()  Экспорт
	Штрих = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|Р.Штрихкод
	|ИЗ РегистрСведений.Штрихкоды КАК Р
	|ГДЕ Р.Владелец = &Карт";
	Запрос.УстановитьПараметр("Карт",ЭтотОбъект.Ссылка);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Штрих;
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Если Выб.Количество()>1 Тогда
		Штрих = "Косяк";
		Возврат Штрих;
	КонецЕсли;
	
	Выб.Следующий();
	Штрих = Выб.Штрихкод;
	Возврат Штрих;
КонецФункции

Функция СоздаёмШтрихКарты() Экспорт
	Штрих = Неопределено;
	ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	
	ТекЗапись.Владелец         = ЭтотОбъект.Ссылка;
	ТекЗапись.ТипШтрихкода     = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	ТекЗапись.Штрихкод         = СформироватьШтрихКодЗаказа();
	
	Попытка
		Штрих = ТекЗапись.Штрихкод;
		ТекЗапись.Записать();
		Исключение
	КонецПопытки;

	Возврат Штрих

КонецФункции

