
////////////////////////  Описание:   //////////////////////////////

//Поле/Описание/Значения

//Вид оплаты
//Вид оплаты заказа
//"1 - не указан вид оплаты или наличные
//2 - безнал"     => ИЗМЕНЕНИЯ 31.08.2018 Женя /////////////////////////////////////// т.к. в виде оплаты нет выбора наличных средств, то 1 записывается в случае, если не указан вид опдаты.

//Статус загрузки
//Статус создания документа Заказ покупателя
//"0 - загружен не проведен
//1 - загружен, проведен"

//Статус оплаты
//Если безнал, отслеживаем загрузку оплаты
//1 - загружена

//Помещён в ЕМЕ
//Отслеживаем запись в БД для обмена с ЕМЕ
//1 - загрузили для обмена

//Принят в ЕМЕ
//Отслеживаем забрала ли ЕМЕ
//"0- не принят на стороне ЕМЕ
//1- принят на стороне ЕМЕ"

//Получен ответ от ЕМЕ
//Отслеживаем обработала ли ЕМЕ
//"0 - не отработала
//1 - отработала"

//Снят с мониторинга
//Заказ отправлен или вышел за границы отслеживаемых систем
//Фиксация "снят с мониторинга" в РС "_5LB_ЭтапыОбработкиЗаказов". Если изменяется статус заказа, то значение "снят с мониторинга" у данного заказа 
// становится 1. В случае, если "снят с мониторинга" уже имеет значение 1, то никаких действий не делать.

//Результат загрузки
//Создание нового заказа покупателя
// 0 - записан и не проведен, отмена проведения
// 1 - проведен 
// 2 - пометка удаления     => ИЗМЕНЕНИЯ 31.08.2018 Женя   /////////////////// Добавлен новый параметр со значением "2" для мониторинга заказов покупателей, которые были помечаны на удаление

//////////////////////    Пример скриптов:   ////////////////////////////

//Поле для анализа/Что отслеживает/Алгоритм/Вид оповещения

//Дата загрузки заказ
//Создание документов Заказ покупателя в 1С
//Если дата последнего заказа не снятого с мониторинга меньше текущей на показатель N - Алерт 
//Критичный


//Статус загрузки
//Статус загрузки	Отслеживаем проведение документов Заказ покупателя в 1С
//Если есть записи с значением 0 - Алерт
//Критичный


//Дата загрузки статуса оплаты
//Отслеживаем загружает ли 1С оплату с сайта
//Если последняя дата загрузки статуса оплаты меньше текущей на показатель N - Алерт 
//Критичный


//Дата передачи в ЕМЕ
//Отслеживаем передачу заказов из 1С в ЕМЕ
//Если последняя дата передачи в ЕМЕ меньше текущей на показатель N - Алерт 
//Критичный


//Дата принятия в ЕМЕ
//Отслеживаем работу ЕМЕ по загрузки заказов
//Если последняя дата принятия в ЕМЕ меньше текущей на показатель N - Алерт 
//Критичный


//Дата получения ответа от ЕМЕ
//Отслеживаем получения данных в 1С из ЕМЕ
//Если последняя дата получения ответа ЕМЕ меньше текущей на показатель N - Алерт 
//Критичный


//Снят с мониторинга
//Отслеживаем отгрузку в 1С
//Если кол-во записей с значение 0 привышает N - Алерт
//Стандартный
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////



