
Процедура СравнитьТаблицы(Табл1, Табл2, Табл1Рез, Табл2Рез) Экспорт
	
	Перем МенеждерВТ;
	
	Если Табл1.Колонки.Количество() <> Табл2.Колонки.Количество() тогда
		Сообщить("Разное количество колонок в сравниваемых таблицах!");
		Возврат;
	КонецЕсли;
	
	Табл1Рез.Колонки.Очистить();
	Табл1Рез = Табл1.Скопировать();
	Табл1Рез.Очистить();
	Табл2Рез.Колонки.Очистить();
	Табл2Рез = Табл2.Скопировать();
	Табл2Рез.Очистить();
	
	стрПоля1 = "";
	стрПоля2 = "";	
	стрУсловия = "";
	Для ПозКол = 0 По Табл1.Колонки.Количество() - 1 Цикл
		КолИмя = Табл1.Колонки[ПозКол].Имя;
		стрПоля1 = стрПоля1 + "Т1." + КолИмя + ", ";
		стрПоля2 = стрПоля2 + "Т2." +КолИмя + ", ";		 
		стрУсловия = стрУсловия + "Т1." + КолИмя + " = Т2." + КолИмя + " И ";
	КонецЦикла;
	стрПоля1 = Лев(стрПоля1, СтрДлина(стрПоля1) - 2);
	стрПоля2= Лев(стрПоля2, СтрДлина(стрПоля2) - 2);	
	стрУсловия = Лев(стрУсловия, СтрДлина(стрУсловия) - 3);
	стрПослПоле = Табл1.Колонки[ПозКол-1].Имя;
	
	МенеждерВТ = Новый МенеджерВременныхТаблиц;
	
  	Запрос1 = Новый Запрос("ВЫБРАТЬ * ПОМЕСТИТЬ втТ1 ИЗ &Таб1 КАК Т1 ИНДЕКСИРОВАТЬ ПО " + стрПоля1);
	Запрос1.МенеджерВременныхТаблиц = МенеждерВТ;
	Запрос1.УстановитьПараметр("Таб1", Табл1);	
	Запрос1.Выполнить();
	
	Запрос2 = Новый Запрос("ВЫБРАТЬ * ПОМЕСТИТЬ втТ2 Из &Таб2 КАК Т2 ИНДЕКСИРОВАТЬ ПО " + стрПоля2);
	Запрос2.МенеджерВременныхТаблиц = МенеждерВТ;
	Запрос2.УстановитьПараметр("Таб2", Табл2);
	Запрос2.Выполнить();  


	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеждерВТ;
	Запрос.Текст= "
		 |ВЫБРАТЬ " + стрПоля1 + "            
		 |ИЗ	              
		 |	втТ1 КАК Т1
		 |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ * ИЗ втТ2) КАК Т2
	 	 |ПО " + стрУсловия + "	
		 |ГДЕ
		 |		Т2." + стрПослПоле + " Есть NULL 	
		 |";
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Т1", "Т1");	 
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Т2", "Т2");		
	Табл1Рез = Запрос.Выполнить().Выгрузить();		
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеждерВТ;
	Запрос.Текст= "
		 |ВЫБРАТЬ " + стрПоля1 + "            
		 |ИЗ	              
		 |	втТ2 КАК Т1
		 |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ * ИЗ втТ1) КАК Т2
	 	 |ПО " + стрУсловия + "	
		 |ГДЕ
		 |		Т2." + стрПослПоле + " Есть NULL 	
		 |";
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Т1", "Т1");	 
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Т2", "Т2");		
	Табл2Рез = Запрос.Выполнить().Выгрузить();	

	ЗапросУДАЛЕНИЕ = Новый Запрос;
	ЗапросУДАЛЕНИЕ.МенеджерВременныхТаблиц = МенеждерВТ;
	ЗапросУДАЛЕНИЕ.Текст = "УНИЧТОЖИТЬ втТ1";
	ЗапросУДАЛЕНИЕ.Выполнить();
		
	ЗапросУДАЛЕНИЕ.МенеджерВременныхТаблиц = МенеждерВТ;
	ЗапросУДАЛЕНИЕ.Текст = "УНИЧТОЖИТЬ втТ2";
	ЗапросУДАЛЕНИЕ.Выполнить();	
	
КонецПроцедуры
